[[{"title": "Best I’ve ever used!", "rating": "5.0 out of 5 stars", "customer_id": "Jean Parker", "body": "I absolutely love these! They’re comfortable to write with. The twist up eraser is a terrific feature and I loved them so much I bought another set of them!", "people_count": 0, "image_usage": 0, "written_date": "March 20, 2023", "product_index": 0}, {"title": "Mechanical pencils that work", "rating": "4.0 out of 5 stars", "customer_id": "Edwin D.", "body": "These simply work and are comfortable even after long periods of writing. The only thing is that their removable erasers are kinda expensive, but overall great.", "people_count": 0, "image_usage": 0, "written_date": "March 25, 2023", "product_index": 0}, {"title": "Good Pencils", "rating": "4.0 out of 5 stars", "customer_id": "L.J. Bakke", "body": "I ordered these pencils because I like this brand. Pencils are well built and fell good in your hand . The only thing that I don't like these are not side clicker pencils. I didn't read the complete product description so that is on me. I'd recommend this product to anyone who likes top- clicker mechanicsl pencils.", "people_count": 0, "image_usage": 0, "written_date": "February 25, 2023", "product_index": 0}, {"title": "great pencil", "rating": "5.0 out of 5 stars", "customer_id": "Kss", "body": "Love these! They write dark and the lead is smooth and soft! And the rubber grip is comfy!", "people_count": 0, "image_usage": 0, "written_date": "March 13, 2023", "product_index": 0}, {"title": "Unfortunately not light green", "rating": "5.0 out of 5 stars", "customer_id": "Lauri", "body": "Love 0.9 lead mechanical pencils. What I hoped would be a light green as shown is actually just green. The product itself is great and my favorite brand.", "people_count": 0, "image_usage": 1, "written_date": "March 4, 2023", "product_index": 0}, {"title": "Exactly what I needed", "rating": "4.0 out of 5 stars", "customer_id": "Joyce 815", "body": "The Twist-Erase mechanical pencils are simple-looking mechanical pencils. The eraser twists out and it's a decent size both in terms of length and diameter. I love that you can retract the eraser when not in use so it won't get dirty or broken off when you put it back in your pencil case. They're very comfortable to hold and write with, and the lead they came with is perfect for producing clean, consistent lines. Definitely would purchase again.", "people_count": 0, "image_usage": 0, "written_date": "December 15, 2022", "product_index": 0}, {"title": "Quality pencils.", "rating": "5.0 out of 5 stars", "customer_id": "K. O. Mathis", "body": "All the features worked: twist up eraser, lead advance, good construction and balance, quality lead. Overall a good pencil for the money.", "people_count": 0, "image_usage": 0, "written_date": "January 26, 2023", "product_index": 0}, {"title": "Comes apart too easily and lead falls out.", "rating": "3.0 out of 5 stars", "customer_id": "Mimi 9265", "body": "A bargain pencil but definitely not my favorite. The tip can easily poke holes in your purse or pocket. My biggest frustration is how easily the top comes off when you don’t want it to. Retracts and erases fine but I’ll be using these at home and not carrying them for the reasons stated.", "people_count": 0, "image_usage": 0, "written_date": "March 11, 2023", "product_index": 0}, {"title": "Okay, but the eraser disappears when used by a left handed person?", "rating": "4.0 out of 5 stars", "customer_id": "Sanford Shuster", "body": "The lead is easy to load, they are comfortable to do my crosswords, but as a lefty as you write the eraser retracts back into the base? You have to twist it to reveal the eraser and lefties will be a little frustrated!", "people_count": 1, "image_usage": 0, "written_date": "November 17, 2022", "product_index": 0}, {"title": "Packaging", "rating": "5.0 out of 5 stars", "customer_id": "Krïstalïna", "body": "Bubble wrap for your next orders on this is a must. Please think of the led inside, it would be much more appreciated. Delivery was great, safe, and thank you for letting us know where the package was left at, very helpful and will purchase this again, Thank you guys!", "people_count": 0, "image_usage": 0, "written_date": "December 29, 2022", "product_index": 0}], [{"title": "Son loves these for school", "rating": "5.0 out of 5 stars", "customer_id": "K’sMom", "body": "Comfortable and comes with large erasers which are perfect for my kiddo.", "people_count": 0, "image_usage": 0, "written_date": "January 19, 2023", "product_index": 0}, {"title": "Love mechanical pencils. Neat. No need to go over to the pencil sharpener", "rating": "5.0 out of 5 stars", "customer_id": "barbara mozo", "body": "Nice colors available. Long lasting twist up eraser. Comfortable cushion for fingers. .07 lead, just right! Made well.", "people_count": 0, "image_usage": 0, "written_date": "January 13, 2023", "product_index": 0}, {"title": "The only con for me is the waste of lead and easy to brake pencil", "rating": "3.0 out of 5 stars", "customer_id": "Melvs😎", "body": "I love everything about this pencil except for the waste of lead when the lead is about the size on the pic attached. The reserved lead inside won’t really push the remaining lead down causing you to dispose of the current , still decent amount of lead and dispense the brand new lead. I have had a lot of these, I always order this particular one because of the comfort and lightness but if it weren’t for the waste of lead and easy to break up overtime over other mechanicals, I would give 5 stars.", "people_count": 1, "image_usage": 1, "written_date": "January 17, 2023", "product_index": 0}, {"title": "Good lead size come apart easily", "rating": "3.0 out of 5 stars", "customer_id": "Al", "body": "I like using thicker lead sizes to write, but the design of this it comes apart at the middle very easy", "people_count": 0, "image_usage": 0, "written_date": "March 8, 2023", "product_index": 0}, {"title": "Good mechanical pencils", "rating": "4.0 out of 5 stars", "customer_id": "Alexandra Lincks", "body": "Great pencils, perfect for work/school!", "people_count": 0, "image_usage": 0, "written_date": "October 31, 2022", "product_index": 0}, {"title": "Wow!", "rating": "5.0 out of 5 stars", "customer_id": "Heather", "body": "When my son came home from school asking for these pencils, I though he just liked being able to twist up the erasers. In all fairness, that is the feature that excited him the most, but he kept saying they were easy to write with and his hand wasn't as tired after using it. I do my best to get my kids school supplies that they enjoy using because I know how much more I enjoy my own work when I have tools and supplies that work well or I like for whatever reason. So while a pencil choice might sound a bit silly, I see it as a way of encouraging my kids at school.Compared to other pencils, these aren't exactly cheap, so I initially picked up a 2 pack at a local store, hoping my son would get his fascination with the twist eraser out of his system and this would be the end of it. But when I actually used the pencil? Well let's just say it's the first time in my life I've said 'Wow' after writing with a pencil. It's so incredibly smooth! It actually writes smoother than many pens I've used. And it does not break nearly as easily as most other pencils we've used, mechanical or wooden. So off to Amazon I went to purchase more at a better price, because mom wants a few of these pencils now, too.Now, personally, I'm not super jazzed about the twist eraser as the eraser likes to twist itself out while in my purse (not all the way out, but out enough that I have to twist it back in before each use). This is probably because I don't use pencils often so it sits in my purse getting jostled around for quite a while before it gets pulled out. My son does not have this issue with the ones in his backpack, as he uses them every day at school. He also uses the eraser a lot, so having an extra long eraser is not only 'cool', it's practical for him.One could just buy the strong-yet-buttery-smooth lead refills and put them in a cheaper pencil, if you don't have need or desire for the extra eraser. But this pencil is also very comfortable in my hand, lightweight and balanced well, so I haven't bothered to do that personally. Still, it's an option if you prefer a different pencil design.", "people_count": 35, "image_usage": 0, "written_date": "October 16, 2015", "product_index": 0}, {"title": "best pencil ever", "rating": "5.0 out of 5 stars", "customer_id": "Katharine J.", "body": "There's been a few iterations of this instrument, but overall it's the best pencil ever", "people_count": 0, "image_usage": 0, "written_date": "December 19, 2022", "product_index": 0}, {"title": "Only pencil I use", "rating": "5.0 out of 5 stars", "customer_id": "T. Kish", "body": "I love these because they hook on the front of my shirt and don’t fall off. I use it for work and they last a long time.", "people_count": 0, "image_usage": 0, "written_date": "November 30, 2022", "product_index": 0}, {"title": "Everything in a pencil !", "rating": "5.0 out of 5 stars", "customer_id": "teachermom", "body": "I've had a favorite pencil for years and have spent top dollar on them.Until now.My husband just thanked me for buying these pencils for his propagating business. they are tough , no smear, clear writing and the lead doesnt break . he uses them for writing tags on his plants. he's searched forever for the right pencil for this job and this is it !i use them for writing everything- lists, notes, calendars - anything needing a dependable pencil with an eraser that works! not some dinky piece of plastic eraser but a large, twist up clean working eraser that is perfect in removing every trace.i think they are made with kids in mind because of the price point and the durability, and the strong lead and the great eraser. but for perfectionist adults , they are the bomb!", "people_count": 3, "image_usage": 0, "written_date": "March 19, 2022", "product_index": 0}, {"title": "My favorite pencils.", "rating": "5.0 out of 5 stars", "customer_id": "Bunnylondon", "body": "I get the cheaper kind for my staff and keep these at my desk. Lol.", "people_count": 0, "image_usage": 0, "written_date": "November 27, 2022", "product_index": 0}], [{"title": "Favorite mechanical pencils", "rating": "5.0 out of 5 stars", "customer_id": "1feistymama", "body": "I love mechanical pencils for never needing to sharpen them, but most have time erasers. The twist erasers are great! I also purchased replacement lead and erasers. Both are easy to replace.", "people_count": 1, "image_usage": 0, "written_date": "October 25, 2022", "product_index": 0}, {"title": "Work well", "rating": "4.0 out of 5 stars", "customer_id": "Logo Cop", "body": "These pencils work well.", "people_count": 1, "image_usage": 0, "written_date": "August 11, 2022", "product_index": 0}, {"title": "Favorite mechanical pencils", "rating": "5.0 out of 5 stars", "customer_id": "Amazon Customer", "body": "I mostly write with mechanical pencils and these are my favorite. The erasers can break easily so be aware not to twist them up too far when erasing.", "people_count": 0, "image_usage": 0, "written_date": "September 24, 2022", "product_index": 0}, {"title": "BEST mechanical pencil ever!!!", "rating": "5.0 out of 5 stars", "customer_id": "Amazon Customer", "body": "I have used numerous mechanical pencils and this is by far the BEST ever! The lead does not break and is very dark so you can see it. Dataset is great and it was the most economical. Thank you Pentel!!", "people_count": 4, "image_usage": 0, "written_date": "August 18, 2022", "product_index": 0}, {"title": "Absolutely fantastic pencil!!!", "rating": "5.0 out of 5 stars", "customer_id": "Old Codger", "body": "I never dreamed that a simple pencil could have such an effect on life. I know this may sound stupid for a simple pencil, but bear with me.I originally ordered this because I have Parkinson's and had been using .7mm pencils for years but was having a great deal of problems with the leads breaking when I had a spasm. I decided to try this pencil because it had a .9mm lead and I thought that it just MIGHT help with the lead breaking problem so I ordered one. Well, it worked very well for the breakage problem. I haven't broken a lead since I started using this pencil. However, I have discovered other great benefits. The new retracting eraser smooths the whole erasing thing out nicely and makes eraser longevity and changing much less of a problem. The larger soft rubber grip also makes the pencil a LOT easier to hang on to, especially for those with my condition.One improvement I have learned to make on the grip: The fattest part of the grip, as it comes, is at the top and doesn't add to the ergonomics of holding the pencil much. I have found that if you simply unscrew and remove the bottom of the pencil where the lead comes out, the rubber grip can simply be slipped off, turned around and reinstalled. Now the fat part of the grip is at the bottom and keeps the fingers in a more sure and comfortable position. The way the manufacturer delivers them doesn't make sense in this respect.However, this pencil is a quantum leap in usability over every other pencil I have ever used and I have since thrown out every other pencil in the house and replaced them with this one.Thank you Pentel for making a better product to simplify our lives.", "people_count": 42, "image_usage": 0, "written_date": "July 18, 2012", "product_index": 0}, {"title": "Great mechanical pencil!", "rating": "5.0 out of 5 stars", "customer_id": "M. Lee", "body": "I've always loved mechanical pencils, from the time I used the old Scripto pencils when I was in high school in the late '60s. I've felt guilty about using the cheap disposable ones from the dollar store, because they just add plastic waste to the landfills. Finally I decided to get some quality pencils that could be refilled, just like my beloved high-school Scriptos. These Pentel pencils are great! The have a metal point that holds the lead nice and steady, and they feel solid in the hand. Looking forward to using these for many years!", "people_count": 4, "image_usage": 0, "written_date": "March 19, 2022", "product_index": 0}, {"title": "Writes and Erases well.", "rating": "4.0 out of 5 stars", "customer_id": "Amazon Customer", "body": "Like the way it feels in my hand. I am able to write well with this pencil, despite my difficulties with handwriting. Sometimes the led does not come out right away, but that is typically after I let my students write with it, so who knows! Eraser works well.", "people_count": 0, "image_usage": 0, "written_date": "March 17, 2022", "product_index": 0}, {"title": "Gift for a young artist", "rating": "5.0 out of 5 stars", "customer_id": "LS", "body": "A new gift for a boy who shows talent with art.", "people_count": 1, "image_usage": 0, "written_date": "October 6, 2022", "product_index": 0}, {"title": "best lead pencils ever", "rating": "5.0 out of 5 stars", "customer_id": "carol", "body": "This is a great product I've been using these for over 20 years and I'm so glad that Pentel still makes them. I love the 5 mm size it works the best for me. I would highly recommend these pencils.", "people_count": 2, "image_usage": 0, "written_date": "July 31, 2022", "product_index": 0}, {"title": "Best pencil I've found for my kids", "rating": "5.0 out of 5 stars", "customer_id": "T. Morris", "body": "I've tried numerous pencils for my grade-school kids and I think these are the best.Why?They're cheap, less than $2 per.They easily take refills. Some of the cheaper pencils make it hard to put in refills.The lead guide is metal.The lead is darker than typical.And the biggest reason...The eraser is HUGE. Even though my kids have separate erasers, they seem to never grab those, but instead use the erasers on their pencils. That means on many of their pencils, the erasers are worn down. And on many pencils, the eraser must be removed to put in more lead. When the eraser is worn down to the nub, it's really hard to pull it out to add more lead.Another nice thing about this pencil: the lead refills do not go where the eraser goes. So even when the huge eraser is worn all the way, it's still easy to add more lead.", "people_count": 11, "image_usage": 0, "written_date": "December 4, 2020", "product_index": 0}], [{"title": "Best Value :", "rating": "5.0 out of 5 stars", "customer_id": "Star Man", "body": "Best ergonomics, utility and Value for the $ .. .", "people_count": 0, "image_usage": 0, "written_date": "October 3, 2022", "product_index": 0}, {"title": "Nice Pencil", "rating": "4.0 out of 5 stars", "customer_id": "Roger C. Burchett", "body": "This Pentel Twist Erase XP has a precise and reliable lead propelling mechanism. The long Eraser works well and lasts a long time.The twist-erase mechanism on this model has enough drag to prevent (mostly) the irritating problem of the eraser creeping out while writing, as happens to me with other Pentel Twist Erase Pencils.An annoyance is that the rubber grip has a lot of friction inside my shirt pocket. When I pull it out, the top part of the pencil sometimes pulls off, leaving the end in my pocket. This happens with several models of Pentel cushioned-grip pencils. I decided I like the cushioned grip enough to put up with the minor drawback.", "people_count": 3, "image_usage": 0, "written_date": "August 5, 2021", "product_index": 0}, {"title": "Getting to the point about this pencil", "rating": "5.0 out of 5 stars", "customer_id": "F. L. OKelley", "body": "Without a doubt, Pentel Twist-Erase Mechanical Pencils are the ultimate mechanical pencils.Here is what you get: a dozen mechanical pencils with 0.9mm HB refills (equivalent to a number 2 pencil), that always stay sharp and NEVER break, a white polymer eraser that doesn't tear pages, doesn't leave ghost images, and lasts for what seems like an eternity. The silicone grip is comfortable without being too bulky. These pencils are durable and virtually maintenance-free and will last many years if they don't grow legs and walk away. The fact that they are green simply makes me smile!I have used the Pentel Twist-Erase pencils for years. In fact, I have some that are \"ancient\" and still work as well as if I had purchased them yesterday. In earlier years, there weren't color choices, they didn't have a soft grip, and I felt grateful just to find one of these pencils with a 0.9mm refill.Pentel also makes options available if you prefer a 0.5mm lead (which I break very often) and 0.7mm lead (which are okay if that's your preference). Even at 0.9mm, which is considered a bold/wide/broad refill, the refill still maintains an excellent point as if it were just recently sharpened. In fact, I have passed along all my mechanical pencils that have anything except 0.9mm refills because that is the size for me.I can with complete confidence recommend these pencils. In my opinion, there are none better.", "people_count": 3, "image_usage": 0, "written_date": "March 27, 2015", "product_index": 0}, {"title": "I can’t get the pencil to work after I refill the lead.", "rating": "2.0 out of 5 stars", "customer_id": "Sheila Watson", "body": "I liked the thought of the pencil; however, I can’t get it to work after refilling the lead", "people_count": 0, "image_usage": 0, "written_date": "March 25, 2023", "product_index": 0}, {"title": "A teacher's honest opinion", "rating": "5.0 out of 5 stars", "customer_id": "Curl", "body": "These are the absolute best mechanical pencils I have ever used. They are strong and lasting. The lead size is perfect for strength.", "people_count": 3, "image_usage": 0, "written_date": "August 11, 2022", "product_index": 0}, {"title": "Great pencils", "rating": "5.0 out of 5 stars", "customer_id": "Susie Reynolds", "body": "Great price for a great pack of pencils!", "people_count": 1, "image_usage": 0, "written_date": "September 5, 2022", "product_index": 0}, {"title": "Not the best", "rating": "2.0 out of 5 stars", "customer_id": "Cameron Duncan", "body": "Bought these for my business. The biggest complaint I have is the pencil comes apart very easily. Probably fine if you’re sitting at a desk but if you keep it in your shirt pocket like I do, I’d suggest something else.", "people_count": 0, "image_usage": 0, "written_date": "February 2, 2023", "product_index": 0}, {"title": "Best Mechanical Pencil ever!", "rating": "5.0 out of 5 stars", "customer_id": "Kami Vonlindern", "body": "I absolutely love these! Already had two but wanted more. and they have refillable erasers that last longer than those short one on other pencils. Bought the lead and extra erasers to go with it. Don't write with anything else. Recommend", "people_count": 2, "image_usage": 0, "written_date": "May 2, 2022", "product_index": 0}, {"title": "School necessity", "rating": "5.0 out of 5 stars", "customer_id": "Hurst", "body": "Great working pencil for back to school!", "people_count": 1, "image_usage": 0, "written_date": "August 12, 2022", "product_index": 0}, {"title": "Best-designed mechanical pencils", "rating": "5.0 out of 5 stars", "customer_id": "am0eba", "body": "I've been a fan of Pentel Twist-erase pencils for over a decade. For me, the design is just right as far as functionality goes: the eraser is always available, and is easy to adjust with a simple twist of the pencil body halves. There's no cap blocking access, so it's quick and easy to correct mistakes - and I make a lot.There's a rubbery grip near the tip to keep my fingers from slipping off the pencil, and the lead adjustment is straightforward with a couple of clicks on the eraser to extend or retract.Specifics about this particular model: Twist-Erase EXPRESS 0.9mm Fashin Color Orange -- 0.9mm lead is great for bold, easy writing (other thicknesses available: 0.1mm, 0.3mm, 0.5mm, 0.7mm)- Orange color (transparent) makes it stand out on a cluttered desktop (other colors could be used for other thicknesses to make swapping between them easy.)- durable and reliable- Twist-Erase EXPRESS body is substantially thinner than Twist-Erase III version which I had been using for years.", "people_count": 17, "image_usage": 0, "written_date": "May 22, 2019", "product_index": 0}], [{"title": "Definitely Durable", "rating": "5.0 out of 5 stars", "customer_id": "PjA", "body": "This mechanical pencil is the best! Several of mine are over 8 years old and are my prized possessions. When taking minutes for several organizations I prefer to use Pentel pencils which are comfortable to hold, have leads in different hardness (I prefer mine to write darker), and the twist eraser is easy to maneuver and erases clean. Unfortunately, everyone wants to barrow my pencils and thus, they disappear.... I tried other brands but they do not hold up to this product's durability. Others are cheap plastic and the metal tips and pocket clips break off.", "people_count": 0, "image_usage": 0, "written_date": "June 21, 2021", "product_index": 0}, {"title": "Best mechanical pencils", "rating": "5.0 out of 5 stars", "customer_id": "Disney Freak Mom", "body": "These pencils are amazing. Lots of lead is included but the best part is the huge twist up eraser!", "people_count": 2, "image_usage": 0, "written_date": "July 2, 2022", "product_index": 0}, {"title": "Pencil is fine! Lead is horrible!", "rating": "2.0 out of 5 stars", "customer_id": "Alicia", "body": "I wonder if these pencils do not use Pentel quality lead! The lead is NOT HB! It is \"super hard lead!\" No matter how gently I write with this pencil it cuts through the paper. (When I press light enough to not tear the paper, it does not write!) Each pencil comes with a VERY short and VERY hard piece of lead in the pencil. Grab your HB lead refill and add them to this box of pencils so you can add FRESH PENTEL LEAD to each pencil as you discover none of them write! Pencils seem to be of good quality, I have added real HB lead to them repeatedly and they work fine. If you treat them like \"lead ready\" pencils, you will be happy with your purchase! :-)", "people_count": 0, "image_usage": 0, "written_date": "August 8, 2022", "product_index": 0}, {"title": "Pentel", "rating": "5.0 out of 5 stars", "customer_id": "Jessica Espericueta", "body": "I ordered these for school. I needed them because I didn’t have pencils. Liked the price and amount I received.", "people_count": 0, "image_usage": 0, "written_date": "June 25, 2022", "product_index": 0}, {"title": "great pencils if you don't keep them in your pocket", "rating": "4.0 out of 5 stars", "customer_id": "Jessica Langridge", "body": "Ok I really like these except that when I keep them in my scrubs pocket the top comes off when I go to pull them out and the barrel/eraser part detaches and the lead spills out, very annoying but if I didn't try to keep them in a pocket they'd work fine. I would prefer that they stay together a bit better. Other than that they are great, sturdy pencils", "people_count": 1, "image_usage": 0, "written_date": "July 23, 2021", "product_index": 0}, {"title": "Good Quality", "rating": "4.0 out of 5 stars", "customer_id": "Lynne", "body": "For years, I've purchased Bic mechanical pencils, but in recent years, I've noticed they just aren't the same quality they used to be. The parts are all plastic, and in just a short time, they stop \"gripping\" the lead so that it slips back up into the pencil when you try to write with them. Also, the Bic pencils come with very fragile lead that snaps in two with just the least pressure, and their erasers are small and not replaceable. These Pentel pencils are a much better quality! They have a metal part that grips the lead...no slippage. The eraser is very long and can be replaced when it is used up, and the lead that comes in the pencil is a good quality...you can actually write with it without breakage. The grip is nice, too...very comfortable. The only thing not to love is the fact that when you use the eraser, you have to hold the twisting section that raises and lowers the eraser or it will twist all the way back into the pencil, and you will find yourself rubbing the paper with the plastic surrounding the eraser. Once you know to hold this part, it's fine.", "people_count": 7, "image_usage": 0, "written_date": "June 19, 2013", "product_index": 0}, {"title": "Not durable", "rating": "4.0 out of 5 stars", "customer_id": "Simon", "body": "As I became sick of wooden pencils and cheap pencils, I decided to invest in this Pentel-Twist pencil. I am not happy with the pencil. The graphite/led in the pencil constantly gets loose and doesn't do its job. This is fixable, but it is a process to fix, which is not good in a situation where you are taking a test or something time-consuming. I do have to say, the price is great, and when the pencil works it is great. The pencil also has a long twist-eraser so you don't have to be worried about using up the eraser. The biggest problem of the pencils are that they are not durable enough, leading to the led loosening up.", "people_count": 0, "image_usage": 0, "written_date": "February 23, 2020", "product_index": 0}, {"title": "Caveat Emptor", "rating": "2.0 out of 5 stars", "customer_id": "CJ Caras", "body": "I first used the Pentel Twist Erase pencil 3 years ago as I was searching for a good mechanical pencil with a refillable eraser. I have not used any other since. I loved it for all the reasons other buyers have mentioned--large/long refillable eraser, rubber grip (not perfect but better than nothing), and interchangeable parts in case something breaks. I was hesitant to purchase this one, the \"Express XP\", since it was not the same item I was used to.The original, if taken apart would be four pieces (apart from led/eraser). This pencil is only three pieces, since the pocket clip (now a more flexible plastic) is one piece with the upper barrel. BTW, the eraser that fitted the original also fits the Express XP.I've seen the original pencils sell for $3.00 apiece, but this set was a dozen for much less. So a cheaper and simpler design, construction, and material.But when it comes to performance, this pencil has a flaw. With every one of these pencils I had, both my wife and I experienced that sometimes the lead would break inside the tip so it would be stuck in the tip. This happened A LOT--if it didn't I wouldn't mention it or feel the need to edit my original review (which was five stars by the way, but the one who uses an item for years is not the same as the one who uses it for a day or two). But when the lead gets stuck, how do you dislodge it? First, unscrew the tip. Now look inside the removed tip and you'll see that there is a piece of lead in there and you should not be able to see through the lead hole. Then you have to take another mechanical pencil of the same width, get the lead to protrude about a centimeter, and then carefully push that lead into the tip from where it normally writes. Eventually the broken lead will fall out. It's possible to do this cumbersome operation without a second pencil, i.e. with the original, but you have to have more lead in the barrel, pull back on the clinging apparatus, push the barrel as if you're going to push out some lead, now hold it so that some lead will begin to fall out, about a centimeter or so, and then continue as mentioned above. If you don't want to fiddle around with this BS--imagine you're on a bus or in a classroom taking a test or following a fast-talking lecturer and all of a sudden the lead gets stuck like this. Don't waste your time. Spend a few dollars extra and get the original.", "people_count": 11, "image_usage": 0, "written_date": "August 21, 2010", "product_index": 0}, {"title": "I use nothing else", "rating": "5.0 out of 5 stars", "customer_id": "VRV", "body": "This is great and I only use these with my work.", "people_count": 0, "image_usage": 0, "written_date": "June 9, 2022", "product_index": 0}, {"title": "Best pencils for doing math", "rating": "5.0 out of 5 stars", "customer_id": "Kenny", "body": "no need to sharp the pencil and look for erasers, can focus and think, 0.9mm is the best because they don't break.", "people_count": 0, "image_usage": 0, "written_date": "April 23, 2022", "product_index": 0}], [{"title": "Our absolute favorite pencils!", "rating": "5.0 out of 5 stars", "customer_id": "Victor", "body": "As musicians, we like having 0.9s, which can sometimes be tricky to find. But as humans, what my family really likes is that the eraser works great and lasts for a really long time! Thought these weren't being sold anymore, but psyched to find them now on Amazon. Bought two packs (24 pencils) and will probably someday regret that I didn't get more!", "people_count": 0, "image_usage": 0, "written_date": "September 24, 2021", "product_index": 0}, {"title": "Great pencils", "rating": "5.0 out of 5 stars", "customer_id": "John Kuhns", "body": "I have used these pencils for my bachelor's, masters and now I am working on my Ph.D.. I love the way they feel. I spend hours writing (chemistry is my major) and my hand does get tired after a long day, or a long test with a lot of writing. If I did not use these pencils my hand would tire much quicker. When I found these I fell in love immediately. They are definitely worth it.", "people_count": 0, "image_usage": 0, "written_date": "April 4, 2021", "product_index": 0}, {"title": "My favorite mechanical pencil", "rating": "5.0 out of 5 stars", "customer_id": "Nayeli", "body": "I've been using these for years. Very good product, I love them.", "people_count": 0, "image_usage": 0, "written_date": "May 17, 2022", "product_index": 0}, {"title": "Ok pencil", "rating": "4.0 out of 5 stars", "customer_id": "Buntheng Tith", "body": "Ok pencil. Held up for about a month of use.", "people_count": 1, "image_usage": 0, "written_date": "December 12, 2021", "product_index": 0}, {"title": "Defective", "rating": "5.0 out of 5 stars", "customer_id": "Shirley B. Stafford", "body": "Love these pencils but the pack of 5 I just received are defective. They will not advance the lead and lead breaks easily. So far 3 out of 5 are useless.", "people_count": 0, "image_usage": 0, "written_date": "February 9, 2022", "product_index": 0}, {"title": "Not metal", "rating": "5.0 out of 5 stars", "customer_id": "Amazon Customer", "body": "Plastic", "people_count": 1, "image_usage": 0, "written_date": "July 6, 2022", "product_index": 0}, {"title": "Good, solid choice", "rating": "5.0 out of 5 stars", "customer_id": "Andrew", "body": "These aren’t my first Pentel pencils I’ve bought— I know they’re good quality. They’re durable and comfortable. I wish they came with refill erasers though instead of a big block eraser, but oh well.", "people_count": 0, "image_usage": 1, "written_date": "January 13, 2022", "product_index": 0}, {"title": "Easily the best pencil I've ever used.", "rating": "5.0 out of 5 stars", "customer_id": "Morgan Fanyo-Tabak", "body": "You can write precisely and accurately with this pencil. The grip is perfect for stabilization while writing fast, and the little \"hook\" at the top for hanging on pages/hanging in storage places is perfect for most situations. Ultimately, whether it be for school, work, or business, this pencil is the top notch.", "people_count": 0, "image_usage": 0, "written_date": "September 7, 2021", "product_index": 0}, {"title": "Adulthood is writing reviews about pencils.", "rating": "5.0 out of 5 stars", "customer_id": "Elizabeth", "body": "THE BEST PENCILS HANDS DOWN! I buy nothing else. I bring my own pens and pencils to work because I am stupidly picky and Pentel are always the best choice for me. These write very nicely, the lead is thick enough to avoid too much breakage but not so thick that you can’t write neatly in small spaces. The twist eraser is my favorite feature, way easier and less annoying than the click ones, and you never end up with a flattened eraser that’s impossible to remove and replace.", "people_count": 5, "image_usage": 0, "written_date": "July 2, 2020", "product_index": 0}, {"title": "My favorite pencil", "rating": "5.0 out of 5 stars", "customer_id": "Danny Hartman", "body": "I use these every day. They are my favorite pencil. They feel A LITTLE cheap in my hand, but not cheap enough to break, more like cheap enough that I don't have to worry about breaking them which is actually what I like. They write well, and clean.The only drawback is that the return is a little stiff when you try to retract the lead, so you break a lot of lead early on until you get used to that. After you get used to the stiff return, there are really no problems, and overall it is a great product.", "people_count": 0, "image_usage": 0, "written_date": "February 27, 2020", "product_index": 0}], [{"title": "Best Mechanical Pencils I've Ever Used", "rating": "5.0 out of 5 stars", "customer_id": "E. J. Russel", "body": "I've been using mechanical pencils since I could write. I've used them all: BIC, Paper Mate, Pilot, Uni Ball, Zebra, Vivo, and of course Pentel. Most mechanical pencils have at least one of three common issues: (1) the grip is too high on the barrel; (2) the lead jams if you try to put too many pieces in at once; or (3) the eraser doesn't last long enough. These yellow Pentel Twist Erase mechanical pencils have none of the issues I've just discussed. First, the grip is low enough on the barrel that you can actually hold the pencil at the grip and write accurately. Second, you can put at least 10 leads inside the pencil and it doesn't jam. Third, they have an impressively long eraser. I erase compulsively, and I've only been using two of these pencils since I bought them in July (it's a pack of 12), and the erasers are barely any shorter than they were when I took them out of the box.The long and short of it is that these pencils are GREAT. They're also yellow, which makes them even better.", "people_count": 2, "image_usage": 0, "written_date": "October 22, 2009", "product_index": 0}, {"title": "Great Pencils", "rating": "5.0 out of 5 stars", "customer_id": "Daitaulo", "body": "I've been using these pencils for more than twenty years. As yet I've found none I like better. They usually \"walk away\" long before they show any sign of wearing out. I think the fact that they keep \"getting borrowed\" is the only reason I need to buy new ones at all.", "people_count": 0, "image_usage": 0, "written_date": "June 8, 2021", "product_index": 0}, {"title": "They don’t work good", "rating": "3.0 out of 5 stars", "customer_id": "Paul Wiechmann", "body": "They would stop working at random times and the led doesn’t really come out when you push the top!", "people_count": 0, "image_usage": 0, "written_date": "May 3, 2022", "product_index": 0}, {"title": "Excellent device. The large .9mm lead makes it more forgiving.", "rating": "5.0 out of 5 stars", "customer_id": "MiRo", "body": "I have these in .5, .7, and now .9mm lead. Excellent product.", "people_count": 0, "image_usage": 0, "written_date": "March 23, 2022", "product_index": 0}, {"title": "Red Lead? Or Red Pencil?", "rating": "4.0 out of 5 stars", "customer_id": "K. Transue", "body": "overall, I'm a pretty positive guy, and I'm pretty happy with most things. This one was a bit of a disappointment, but will probably work out in the end. It took about a month to receive my \"Prime\" two-day shipping, because the product was apparently back ordered or something (how does a pencil maker run short on pencils?). I'm a huge fan of the higher end Pentel \"Twist Erase\" pencils, so I figured one with red lead and an eraser specifically designed for that lead would be the holy grail of erasable red lead in a mechanical pencil. But, the biggest disappointment is that \"red pencils\" didn't mean red pencils in the traditional sense ... It meant \"pencils that are red\". My bad. Now I have twelve black-lead pencils that I don't need, and I'm back to searching for good quality mechanical pencils with erasable red lead. Oops.", "people_count": 4, "image_usage": 0, "written_date": "March 30, 2014", "product_index": 0}, {"title": "When I purchase an item, l like continuity when getting replacements. I expect the same quality", "rating": "4.0 out of 5 stars", "customer_id": "Love, Peace & Hope", "body": "I would have given 5 stars but these are not exactly like what I purchased at an office supplier or in the store here locally. Great for spare mechanical pencils so I don't give up my original ones.", "people_count": 1, "image_usage": 0, "written_date": "March 8, 2021", "product_index": 0}, {"title": "My favorite pencils", "rating": "4.0 out of 5 stars", "customer_id": "Olivia", "body": "I have a bump on my finger from holding my pencil weirdly for so many years and after a while of writing my finger is irritated, but these are the only pencils I can use!", "people_count": 0, "image_usage": 0, "written_date": "April 3, 2021", "product_index": 0}, {"title": "Good, cheap, refillable pencils with long eraser", "rating": "5.0 out of 5 stars", "customer_id": "eric d.", "body": "I got these to switch to a model that is lest wasteful over my Paper-Mate non-refillable pencils. The obvious draw to these was the large eraser since the kids think use up the erases on regular pencils almost immediately. Eraser twists easy and stays in the position during erasing. Eraser is good quality and actually erases the pencil marks without smudging them around. Pencil is slim, comfortable to hold, and designed to reduce lead breakage. Overall, very happy to make a switch to these pencils and will purchase again.", "people_count": 0, "image_usage": 0, "written_date": "March 26, 2020", "product_index": 0}, {"title": "Not puppy proof - fine otherwise", "rating": "3.0 out of 5 stars", "customer_id": "A. Lowrey", "body": "Nice colors, love how convenient the extra long eraser is. My only complaint , if any, is that they are very lightweight and seem cheaply made. We got a 4 pack and the 2 that I gave my daughter are working fine. The puppy got both of mine. If I decide to try again, I think I’ll go with the more expensive packs.", "people_count": 2, "image_usage": 0, "written_date": "November 14, 2021", "product_index": 0}, {"title": "Twist-Erase are the Best", "rating": "5.0 out of 5 stars", "customer_id": "msmith0957", "body": "My freshman year of college, I got a pack of Pentel Twist Erase mechanical pencils. In my 3 years since then, I've never used anything since that have worked as well. I generally liked pencils (over the mechanical) because they felt sturdier in the hand, and the tips were generally tougher. I tend to write a little hard, so at 0.9mm, it's a much more natural write, for me at least.Previously, I had the original Twist Erase pencils (not EXPRESS) and these feel a little cheaper in construction, but otherwise write just as well. The wider body also feels much more natural.Most importantly, the eraser on Twist-Erase pencils are second to none. They're around 3-4 times larger than the average eraser, and will last you at least a solid 6 months per pencil, if you do a lot of erasing that is. You can also buy erasers independently to feed your pencils. Surprisingly, they aren't cheap either, and sometimes find better deals buying just a new pencil/eraser pair then buying just erasers.", "people_count": 0, "image_usage": 0, "written_date": "February 17, 2013", "product_index": 0}], [{"title": "Great erasers, regular pencil", "rating": "4.0 out of 5 stars", "customer_id": "Moira", "body": "Good with regular leads, I got then to use with green leads that are brittle and break between the barrel and the holder tip.I really like the replaceable twist erasers.", "people_count": 0, "image_usage": 0, "written_date": "April 7, 2021", "product_index": 0}, {"title": "Good construct, faulty mechanics.", "rating": "4.0 out of 5 stars", "customer_id": "Amazon Customer", "body": "This pencil is great....twist enamel eraser, strong construct, and nice grip. It writes incredibly smooth, and the lead has not broken on me after a solid three weeks of use, and I used them in my geologic mapping class, so they were harassed quite a bit.However, it seems to have trouble pushing the next lead stick through, and often times leaves me having to pick out the remaining lead from the tip with my fingernails. It can be very frustrating having to grab a little stub of lead from the end (1-2 mm of lead sticks out). I usually end up disconnecting the head and pushing the lead through with another pencil or pen.Aside from that happening, the pencil is great.", "people_count": 2, "image_usage": 0, "written_date": "March 14, 2016", "product_index": 0}, {"title": "Holds the lead solid.", "rating": "5.0 out of 5 stars", "customer_id": "Robert Morgan", "body": "I do a lot of handwritten work. I have had a lot of trouble with various mechanical pencil leads breaking over the past few years. I was blaming the leads. It turns out that the right pencil makes all of the difference. This is that pencil without breaking the bank.", "people_count": 0, "image_usage": 0, "written_date": "April 25, 2021", "product_index": 0}, {"title": "Pen Girl Seal of Approval", "rating": "5.0 out of 5 stars", "customer_id": "Somedaysam", "body": "I have a weird thing with pens and post-it’s, cute paper, etc. These are my favorite pens ever, ink is dark and smooth, doesn’t smear. It’s a fine tip but still bold writing. Love!!!", "people_count": 0, "image_usage": 0, "written_date": "November 15, 2021", "product_index": 0}, {"title": "nice pencils", "rating": "5.0 out of 5 stars", "customer_id": "glen wheeler", "body": "love the 0.9mm", "people_count": 0, "image_usage": 0, "written_date": "April 13, 2022", "product_index": 0}, {"title": "Perfect Combo", "rating": "4.0 out of 5 stars", "customer_id": "JC", "body": "Love this brand. Awesome price for this combo (Perfect for school); it has 0.5mm mechanical pencils, a case of leads, and erasers. The mechanical pencils have twist up erasers and it is a good length. There is a cushion area to support your fingers.", "people_count": 3, "image_usage": 1, "written_date": "August 11, 2020", "product_index": 0}, {"title": "as good as it gets, I guess ...", "rating": "4.0 out of 5 stars", "customer_id": "The Sarcasticynic", "body": "I used to use Papermate Logo II .7mm mechanical pencil with twist erase. That pencil was awesome! When I couldn't find them anymore, I found this pencil. Generally I'm satisfied with the pencil - I have a dozen or so scattered about the house. I have the same problem as other reviewers - the pencil separates in the middle. I usually put the smallest piece of Scotch tape on the white part. If it won't push at all, I've put too much tape on. But once I get it to push like normal, it doesn't come apart.UPDATE 11/25/12: After having owned these pencils for several months, I noticed the erasers on some of them would occasionally twist out by themselves as I used them, necessitating the need to twist them back several times during a crossword puzzle..", "people_count": 1, "image_usage": 0, "written_date": "January 16, 2012", "product_index": 0}, {"title": "Love pentel. Durable.", "rating": "5.0 out of 5 stars", "customer_id": "Jayla Jack", "body": "I bought these in Staples. They are great quality mechanical pencils. There is a long eraser and it lasts a long time. I've always loved pentel erasers and mechanical pencils! These are worth it and I'd definitely buy more.Update: I ordered an extra pack from amazon \"on July 3, 2015\" and they're holding up just fine two years later. I wouldn't have to buy more if people didn't borrow without returning them or if I didn't misplace them. I've been using this line since around 2012 (9th grade and before they upgraded it to the \"twist-erase\" version) . Before that, I bought the breast cancer ones from Pentel (they had stopped selling them in staples :( and I wasn't ordering things online yet in middle school lol). Before that, paper mate ones (that was so long ago I can't remember why I switched).", "people_count": 2, "image_usage": 0, "written_date": "March 21, 2015", "product_index": 0}, {"title": "Incorrect color depiction, but otherwise a great pencil", "rating": "4.0 out of 5 stars", "customer_id": "Avid Reader", "body": "These are very nice, just not quite as nice as the more expensive Twist-Erase III. For the price, this will be a great everyday pencil. Note that the 0.9mm lead size comes in Dark Green, not the Light Green that is pictured. I prefer the darker green myself, but I wish the correct color had been pictured (if you have young children, you'll understand why). All of the pencils I received came pre-loaded with 2 sticks of lead each. All pencils had one eraser, though in some instances the erasers were loose and needed to be pushed down all the way before the twist-erase would function.", "people_count": 7, "image_usage": 0, "written_date": "March 9, 2017", "product_index": 0}, {"title": "Good pencils.", "rating": "5.0 out of 5 stars", "customer_id": "Glenn", "body": "I like the pencil, in that I like the 0.9mm lead when writing (I like the bolder lines). There is nothing to dislike about it. For those who said that they didn’t get the pencils pictured, well the description did say assorted, in you get what was picked up and shipped. As for the negative reviews, your orders must have been a fluke.These are really good pencils.", "people_count": 0, "image_usage": 0, "written_date": "July 1, 2020", "product_index": 0}], [{"title": "Dependable choice for students", "rating": "5.0 out of 5 stars", "customer_id": "walth", "body": "I have been buying these pencils for students for several years now. Not a single one has failed; they either get lost or sometimes destroyed by students but they never fail otherwise.Aside from their dependability, what makes them a great choice for students are two factors:1. They have a great, big eraser!2. The graphite size is 0.9 mm, which works well for students because it doesn't break off too easily. Broken graphite bits can be problematic in school environments because it easily grinds into chair legs and other furniture, and marks the floor. This is better with thicker graphite.", "people_count": 0, "image_usage": 0, "written_date": "November 26, 2018", "product_index": 0}, {"title": "pretty good", "rating": "4.0 out of 5 stars", "customer_id": "Zhou", "body": "i like it, very comfortable pencel", "people_count": 0, "image_usage": 0, "written_date": "August 29, 2021", "product_index": 0}, {"title": "BE Careful with this multi-colored set!", "rating": "3.0 out of 5 stars", "customer_id": "J. L. Merriman", "body": "I was looking for mechanical pencils that have different colored LEAD. And I have ordered (it should be here tomorrow) an extra pack of RED LEAD for the RED pencil. But I got the pack today, with two extra packs of erasers, as I ordered (thank you very much for the quick delivery), but my black, red, blue, green, and purple mechanical pencils all have BLACK lead.There were a few other varieties of these multicolored pencils, and I discarded them because they seemed to say clearly that the color was only ON the pencils, not IN them. So I chose this one. Wrong. Buyer beware!", "people_count": 0, "image_usage": 0, "written_date": "August 13, 2020", "product_index": 0}, {"title": "Mechanical pencils", "rating": "4.0 out of 5 stars", "customer_id": "Snowhite62", "body": "I wanted to give it a higher mark but one of the pencils broke with in the first week, the rest have stood up well,I will rebuy them because I like the .5mm tip and the ease with which I can add the replacement lead, also want to mention this is one of the only pencils I have used and I have used many different brands that gives you a nice big eraser and not just big but good quality.", "people_count": 0, "image_usage": 0, "written_date": "October 27, 2018", "product_index": 0}, {"title": "Great Product!", "rating": "5.0 out of 5 stars", "customer_id": "Pat", "body": "These are of good quality, writes easily and love the twist eraser. I clip these onto notebooks, paper pads, etc. so I always have a writing instrument available. I love these!", "people_count": 0, "image_usage": 0, "written_date": "July 17, 2021", "product_index": 0}, {"title": "Very good pencils for drawing", "rating": "5.0 out of 5 stars", "customer_id": "Sandra C", "body": "I have tried a lot of pencils, some much more expensive than these. These are so nice to draw with. Good for details and shading.", "people_count": 0, "image_usage": 1, "written_date": "October 9, 2021", "product_index": 0}, {"title": "Good basic mechanical pencils", "rating": "5.0 out of 5 stars", "customer_id": "Aaron B", "body": "Not much to write about, these mechanical pencils work well and they have a nice long eraser that is extended with a twist of the pencil. The 0.5mm lead is nice and thin but doesn't break too much.", "people_count": 0, "image_usage": 0, "written_date": "March 29, 2021", "product_index": 0}, {"title": "Regular 0.5mm lead won't fit", "rating": "1.0 out of 5 stars", "customer_id": "Donna", "body": "I love the Twist-Erase pens, but this XP version is terrible. They work fine with the initial lead which comes with them, but that's the extent of it. They will not accept the regular refills of the 0.5mm leads! Don't waste your time or money.", "people_count": 0, "image_usage": 0, "written_date": "February 13, 2023", "product_index": 0}, {"title": "Super price. Just as good so far as ones bought years ago at 1/2 to 1/3 the price", "rating": "5.0 out of 5 stars", "customer_id": "George R. Wills", "body": "Instead of clicking a button on the side to advance the lead, you push the end of the pencil. I'm guessing that is a much simpler (less expensive) design. I am delighted with the price and they work fine also.", "people_count": 0, "image_usage": 0, "written_date": "January 27, 2021", "product_index": 0}, {"title": "No breaking lead", "rating": "5.0 out of 5 stars", "customer_id": "zando", "body": "Best mechanical pencil ever! I generally use ticondaroga (the absolute best IMO) because mechanical pencil lead breaks easily, but these are amazing! No breaking, smooth, just like using a pen!", "people_count": 0, "image_usage": 0, "written_date": "May 31, 2021", "product_index": 0}]]