[[{"title": "Not tourney worthy but fine for practice", "rating": "4.0 out of 5 stars", "customer_id": "Epilady", "body": "This is a box of balls, not pressurized. But it worked great for practice and were not so expensive that we worried about losing them. Would not use for a game but perfect for practice.", "people_count": 1, "image_usage": 0, "written_date": "October 3, 2022", "product_index": 1}, {"title": "My Standard Poodle loves these", "rating": "5.0 out of 5 stars", "customer_id": "Denise L", "body": "My dog tears through balls made for dogs but these last. Great price for multiple balls.", "people_count": 0, "image_usage": 0, "written_date": "February 18, 2023", "product_index": 1}, {"title": "Great bounce, strong outer coating, interior less durable - don't buy for your dog", "rating": "4.0 out of 5 stars", "customer_id": "Shelly", "body": "Bought these for my 7 mo. old puppy St. Berdoodle. He destroyed the inside in less than two hours, but the outside is holding up. So while it doesn't bounce it's still in one piece and rolls and wobbles across our floor, which means we can still play with it and it is a bit unpredictable/fun for the dog. I'm both disappointed and impressed. I realize this is not the recommended use of the tennis ball so I'm giving it 4 stars.", "people_count": 2, "image_usage": 0, "written_date": "May 26, 2022", "product_index": 1}, {"title": "Definitely not for dogs!", "rating": "5.0 out of 5 stars", "customer_id": "Mellissa", "body": "I'm sure these are great for tennis, but don't buy them for your pups, they can bite right through them.", "people_count": 0, "image_usage": 0, "written_date": "January 21, 2023", "product_index": 1}, {"title": "Very affordable for my use which is NOT tennis", "rating": "3.0 out of 5 stars", "customer_id": "dobs", "body": "Pros: Great price for the number of tennis balls.Cons: Has an inferior bounce and even though I didn't use this for tennis I can tell this will not work well. It would be better suited for something like ball hockey where you want a more dead feeling ball.", "people_count": 0, "image_usage": 0, "written_date": "January 17, 2023", "product_index": 1}, {"title": "Throw the ball!", "rating": "5.0 out of 5 stars", "customer_id": "Gref", "body": "Since they were bought for my Golden Retriever I will let her comment on them: “Ruff, ruff! Throw the ball! Chase the ball!! Woof, woof! Do again, and again, and…” She likes them a lot.", "people_count": 1, "image_usage": 0, "written_date": "November 19, 2022", "product_index": 1}, {"title": "Nice practice balls", "rating": "3.0 out of 5 stars", "customer_id": "Wesley L. Salen", "body": "Low bounce but they work well for beginners style tennis play.", "people_count": 0, "image_usage": 0, "written_date": "February 18, 2023", "product_index": 1}, {"title": "Perfect for dogs and fetch, probably not for tennis", "rating": "5.0 out of 5 stars", "customer_id": "Kelly McCoig", "body": "Not sure if this is the same with every batch, but the set I received each ball was two halves barely fused together and then wrapped with the yellow tennis ball covering. Since these balls bounce poorly and are misshapen, I don’t feel it would be conducive to playing tennis. But for indoor fetch with my labradoodle, they are absolutely perfect. I plop them all in a basket and my pup picks them all out and brings them to the closest human for a riveting game of indoor fetch. I have these set on a six-month recurring delivery so by the time I am down to only a ball or two, which seems perfect for our needs. If you want to play outdoor fetch, I would recommend a 3-pack of name brand tennis balls to have on hand as well.", "people_count": 1, "image_usage": 0, "written_date": "January 9, 2022", "product_index": 1}, {"title": "Bouncy balls, good for tennis practice", "rating": "5.0 out of 5 stars", "customer_id": "steven", "body": "", "people_count": 26, "image_usage": 0, "written_date": "April 8, 2018", "product_index": 1}, {"title": "Dogs love them!", "rating": "5.0 out of 5 stars", "customer_id": "Steve W", "body": "We have 2 Cocker Spaniels that are insane over yellow tennis balls 🎾These are perfect for them.12 balls for ~$15 is an absolute deal. My boys tear the heck out of them and now I don’t mind ‼️Thank you 😊", "people_count": 2, "image_usage": 0, "written_date": "August 25, 2022", "product_index": 1}], [{"title": "Seems a little softer than usual", "rating": "4.0 out of 5 stars", "customer_id": "Michael J. Baham", "body": "Bought for new practices but they seem a little soft or flat", "people_count": 1, "image_usage": 0, "written_date": "April 26, 2022", "product_index": 1}, {"title": "Not durable. Pressurized for no reason.", "rating": "1.0 out of 5 stars", "customer_id": "sheena", "body": "I have a 36 pound border collie, which is quite literally a tennis ball fetching addict! I bought these for him. They only last 2 times It fetching (1hr-2hr) at most. At the least, they have lasted about 45 minutes. My dog does not chew on them,, he is not one of the dogs who’s goal is to destroy them! The only thing he does besides fetch them, is bite down on them repeatedly as if he were trying to make it squeak. The only time he does this is while he is being the ball back after after i throw it. I am no idea why these balls are pressurized they shouldn’t be because they’re 2/2 they’re made from chew rubber halves, that aren’t even still together very well. If they were still together very well my 36 pound border collie would not be able to bite down on them. He was done over and over while bring in the bathroom looks like he’s kind of chewing gum are trying to squeak them. I swear yesterday one of these balls just slash and 2/2 just covered by the felt after only 6 throws. I have no idea what they’d be like for tennis but I have a feeling they do the same thing! I buy tennis balls, because my dog prefers them, so much that he won’t play with another type of ball!! I try ( i am buying real ones ) to buy real, pressurized, tennis balls, instead of the ones that they specifically make for dogs.I do so because, they are not made if 2 halves glued together (which always eventually come apart) , and because the pressurized ball bounce incredibly well . Even after they loose pressure they still bounce better than n the balls made from 2 halves, and most definitely these balls, which are pressurized, but quickly loose pressure after the halves start to detach. Another thing i take issues with, is that these “pressurized bells come in a box, so they are not fully pressurized when they are received. Pressurized tennis balls should be stored in a container which is designed to maintain the pressure of the balls . Like the container which holds 3 at a time, the balls are not subject to pressure change until the pressure in the container, becomes less than that inside each of the balls. I would gave given 2 stars , if not for this hypocrisy.", "people_count": 2, "image_usage": 0, "written_date": "July 24, 2022", "product_index": 1}, {"title": "They bounce", "rating": "5.0 out of 5 stars", "customer_id": "Patricia Mueller", "body": "I asked my son what he wanted for his 8th grade graduation. He says, “oh I don’t know. Maybe just a few tennis balls”. I was thinking I’d be buying some Xbox or PlayStation crap so if my kid decides he wants “a few tennis balls”, I’m going nuts!So naturally I ordered him a crap ton of these. Now I’m not really a pro tennis player. Actually I’ve only played real tennis twice in high school and then decided that was enough so I don’t know how to accurately judge a quality tennis ball. But my kid was excited as hell. They bounce. Dogs have chewed them and they didn’t tear apart right away and they launch off a baseball bat. So I’m going with these being some A+ tennis balls.", "people_count": 0, "image_usage": 0, "written_date": "September 1, 2021", "product_index": 1}, {"title": "Use these with a chuck-it for a dog", "rating": "5.0 out of 5 stars", "customer_id": "Dianne", "body": "have a bucket full of balls to play chuck it with my dog. Working out well and probably will get more in the future.", "people_count": 2, "image_usage": 0, "written_date": "October 1, 2022", "product_index": 1}, {"title": "Great for dogs", "rating": "3.0 out of 5 stars", "customer_id": "Mark Valgemae", "body": "I agree with other reviewers that these do not look like good balls to play tennis. However, I bought these to bring to the dog park and throw to my ball obsessed Golden Retriever. I am lucky he does not have any interest in destroying them, just chasing, retrieving and carrying around. As balls seem to disappear quickly at the dog park (taken by other dogs, not seen where thrown or dropped and lost when distracted) having value priced balls is the key for me.One thing to be aware of. If you use a Chuck-it like I do, these balls seem to be ever so minutely smaller than the “real” tennis balls, so they have a slightly different release point.", "people_count": 0, "image_usage": 0, "written_date": "February 13, 2022", "product_index": 1}, {"title": "Inexpensive, high visibility balls", "rating": "3.0 out of 5 stars", "customer_id": "P. Schmidt", "body": "I needed something soft to put over some protruding bolts on the bottom of an overhead storage area shelf that I did not feel were practical to cut off, but which might cause injury if anyone were to climb into or under the shelf area. The bolts had an off thread that I could not find acorn nuts for, so I thought about foam balls, tennis balls, etc. I settled on these because they are not 'serious' tennis balls, not really being intended for actual play (they are advertised for 'training'), but because the price was fairly low, they are bright yellow, and they are the correct size for my application. I planned to drill, or poke, a small hole in each ball, inject some Great Stuff expanding foam, then jam the ball over the protruding nut (into the hole that I made), and when the injected foam hardens, it should form around the bolt threads and hold the balls onto the bolts pretty well, yet I could still remove the balls easily enough if necessary later on. The high visibility yellow would warn people, and the large soft balls would not cause injury.I have seen some other people's reviews that these balls were not very durable when used as toys for their dogs, and I cannot comment on that. However I did notice that these balls have a visible raised seam under the fuzzy coating, probably due to sloppy molding of the rubber sphere underneath. So, I would agree with others that these are not the highest quality tennis balls. Still, good enough for my odd application.", "people_count": 1, "image_usage": 0, "written_date": "November 22, 2017", "product_index": 1}, {"title": "No case, just loose balls", "rating": "3.0 out of 5 stars", "customer_id": "That Picture Guy", "body": "I have never before gotten tennis balls not in a can, so I do not know if this is standard, but they seemed to lack bounce. I will continue to use them when I go practice against a wall but I will not buy again.", "people_count": 1, "image_usage": 0, "written_date": "July 5, 2022", "product_index": 1}, {"title": "Want Slow But Unpredictable? Ask for Kevenz!", "rating": "3.0 out of 5 stars", "customer_id": "Stucco Boxes", "body": "These are shipped in a box. No can. Not pressurized. That's because they come flat. Most of them are pretty round, but a few had a lip on the seam of the ball which could be fun if you put a fierce spin on them. My wife and I had fun making fun of how bad these tennis balls are. They'd be good for dog fetching / dog toys, or juggling. But for tennis? Even with raw beginners? Not so much.Update a month later--- these are just really bad.", "people_count": 0, "image_usage": 0, "written_date": "March 3, 2022", "product_index": 1}, {"title": "Mediocre balls", "rating": "2.0 out of 5 stars", "customer_id": "Sergio R. Lopez", "body": "I recommend getting Penn or Wilson - you really feel the difference.", "people_count": 0, "image_usage": 0, "written_date": "March 5, 2023", "product_index": 1}, {"title": "Dog makes short work of them", "rating": "3.0 out of 5 stars", "customer_id": "Brian E. Hall", "body": "A lot of reviews seem to say that these held up well to dogs, but our 50 lb dog makes short work of them. The name brands seem to last quite a bit longer.I'm not a tennis player, but these also don't look like very high quality tennis balls.That said, they're some of the lowest priced out there.", "people_count": 0, "image_usage": 0, "written_date": "April 14, 2022", "product_index": 1}], [{"title": "Not a great tennis ball for dogs", "rating": "2.0 out of 5 stars", "customer_id": "Victoria", "body": "I can’t speak for how well they work to play tennis with, but I can say they are not a good ball for dogs. I wouldn’t describe my dog as a powerful chewer of toys, but she demolished each and every ball that came in this package within an hour or two of receiving them. If you want a durable ball for your dog, it’s probably most worth your money to pay the extra little amount for Penn or Wilson balls.", "people_count": 1, "image_usage": 1, "written_date": "October 22, 2022", "product_index": 1}, {"title": "Break easy", "rating": "3.0 out of 5 stars", "customer_id": "Dani", "body": "These break easy and don’t last very long. I also don’t play tennis, I just use them for my dog. Not a good dog ball", "people_count": 0, "image_usage": 0, "written_date": "June 23, 2022", "product_index": 1}, {"title": "Great tennis balls for dogs", "rating": "5.0 out of 5 stars", "customer_id": "Amazon Customer", "body": "Best tennis balls for dogs. Our pups would destroy the cheap tennis balls basically after 1 use. We've had these for a few months and they still haven't ruined any of these.Haven't used them for tennis, but even when they were new they felt a little flat. Maybe they are good practice balls.", "people_count": 0, "image_usage": 0, "written_date": "January 31, 2022", "product_index": 1}, {"title": "Perfect for a lab.", "rating": "5.0 out of 5 stars", "customer_id": "William C.", "body": "Just the right size. My dog gives these a 5/5.", "people_count": 1, "image_usage": 0, "written_date": "August 16, 2022", "product_index": 1}, {"title": "I mean....they're balls what more can you say?", "rating": "5.0 out of 5 stars", "customer_id": "Tawnie Royer", "body": "So they bounce. They're round. The dog loves to chew the felt off and I see it in his poop a couple days later. He didn't complain. I guess they served their purpose.", "people_count": 0, "image_usage": 0, "written_date": "April 28, 2022", "product_index": 1}, {"title": "Not a big bounce, but great for non-tennis use", "rating": "3.0 out of 5 stars", "customer_id": "Tiffany", "body": "When I brought mine to play tennis, immediately a tennis instructor said they weren't good because the bounce wasn't good. She demonstrated and she was right - not a great bounce at all and it'd be hard to play with. HOWEVER, I use them when I do therapy with patients (occupational therapy) to practice reaching and catching/throwing. GREAT for those types of uses. It could also be used to help cushion legs of walkers or other creative activities too. Happy with my purchase as a therapy item, not so great as an actual tennis ball.", "people_count": 1, "image_usage": 0, "written_date": "November 4, 2021", "product_index": 1}, {"title": "would not buy again", "rating": "3.0 out of 5 stars", "customer_id": "V. Linnik", "body": "At least one ball in the box had a big hole in it on arrival.", "people_count": 0, "image_usage": 0, "written_date": "June 24, 2022", "product_index": 1}, {"title": "Great cheap tennis balls", "rating": "5.0 out of 5 stars", "customer_id": "luxury55", "body": "Great for hitting around with kids etc. everyday playing balls", "people_count": 1, "image_usage": 0, "written_date": "July 7, 2022", "product_index": 1}, {"title": "My Dog Loves Kevenz Balls!", "rating": "5.0 out of 5 stars", "customer_id": "Linda H.", "body": "Seriously though, these are good quality tennis balls. Great price too!", "people_count": 0, "image_usage": 0, "written_date": "May 23, 2022", "product_index": 1}, {"title": "Cheap-ish balls good enough for dog toy.", "rating": "4.0 out of 5 stars", "customer_id": "Aaron Quinley", "body": "Great balls for tossing for my dig to catch and fetch. These are in no way suitable for playing tennis. They have no real bounce by comparison. They’ll bounce slightly but they aren’t pressurized. They’re priced ok enough such that I don’t fret when I accidentally throw one over the fence into no-man’s land.", "people_count": 0, "image_usage": 0, "written_date": "April 19, 2020", "product_index": 1}], [{"title": "Classic You-Get-What-You-Pay-For", "rating": "2.0 out of 5 stars", "customer_id": "richmondsteve", "body": "These balls start with a bounce rating of 2 at best, and they get worse from there... rather quickly too. I've had balls from nearly all the major brands that bounce better, for a longer time, than these do. Might be o.k. for dogs or toddlers, but not really for serious tennis players.", "people_count": 0, "image_usage": 0, "written_date": "July 26, 2022", "product_index": 1}, {"title": "Not a premium ball.", "rating": "4.0 out of 5 stars", "customer_id": "Kelly Hannanchuba", "body": "They go to the dogs faster than other brands but it's a good price if you're using them as toys.", "people_count": 0, "image_usage": 0, "written_date": "May 26, 2021", "product_index": 1}, {"title": "Great for my purpose!", "rating": "5.0 out of 5 stars", "customer_id": "D. Rutledge", "body": "I'm not a tennis player, just needed these for a project and they were fine. I didn't notice any difference in any other tennis ball I have ever used (again, I'm no tennis player). I would buy these again, great for the price.", "people_count": 0, "image_usage": 0, "written_date": "June 23, 2021", "product_index": 1}, {"title": "Work for dog balls", "rating": "5.0 out of 5 stars", "customer_id": "Toyfire", "body": "We couldn't figure out where the tennis balls were coming from in our yard, until we noticed our lab squeezing under the fence and stealing them from the neighbors yard. These were given to the neighbor to apologize for our dog's sticky paws. Now these have been showing up in our yard too.", "people_count": 0, "image_usage": 0, "written_date": "February 22, 2021", "product_index": 1}, {"title": "Great for OCD Dogs!", "rating": "5.0 out of 5 stars", "customer_id": "KDC", "body": "I bought these for my obsessive compulsive Border Collie who lives to chase balls. We can't even call them balls, or spell ball because she knows what that means so these are \"Yellow Turkeys\". I don't know how well they will work for tennis but they are a great for throwing 100,000 times in a row to be retrieved by an insane dog. She usually rips all of the fuzz off of yellow turkeys but not these, they don't de-fuzz as easily as other Yellow Turkeys. Eventually, she's going to figure out what yellow Turkey means and we'll have to call them something else. Regardless of what we call them, I'll be buying more!", "people_count": 13, "image_usage": 0, "written_date": "October 10, 2017", "product_index": 1}, {"title": "worth the money", "rating": "4.0 out of 5 stars", "customer_id": "Evan", "body": "if you buy them to throw for a dog they are totally fantastic, I wouldn't play tennis with them though.", "people_count": 0, "image_usage": 0, "written_date": "April 21, 2021", "product_index": 1}, {"title": "Round, bright and sturdy!", "rating": "5.0 out of 5 stars", "customer_id": "sking", "body": "Our Boston Terrier is OBSESSED with tennis balls! She can chase them for hours. Unfortunately she also tears them up. This bundle of tennis balls is just what we needed to keep her running! They appear as sturdy as any tennis ball can be, have a bright easy to see color. Loved that we could buy them in a large amount.", "people_count": 0, "image_usage": 0, "written_date": "October 22, 2020", "product_index": 1}, {"title": "Verified Purchase", "rating": "5.0 out of 5 stars", "customer_id": "eason", "body": "I bought these to practice and play with my dogs. Their favorite game is chasing the ball while I'm working on my swing. I get to practice, they exhaust themselves, everybody wins. A pack of 18 generally lasts me about 2 months or so of daily use, which isn't bad considering the amount of puncturing dog teeth they endure. I can tell you that with no dogs involved, these would last a very long time. If you're a bit more serious player, I'd definitely recommend these for practice if you have the space. I can hit these balls about 40-50 yards with a sand wedge.", "people_count": 0, "image_usage": 0, "written_date": "March 30, 2018", "product_index": 1}, {"title": "Perfect for a pit puppy", "rating": "5.0 out of 5 stars", "customer_id": "OoberDogLover", "body": "I love these tennis balls! Way higher quality than the ones available at most pet stores. They have held up well to my pitbull mix who can shred a Petco tennis ball in less than three minutes. She doesn't like the texture of the Kong tennis balls very much but these ones she loves. These balls are really well made and have a lot of bounce to them. The inner portion of the ball is pretty sturdy and resists puncture more than others I have tried. Good value for the price!", "people_count": 1, "image_usage": 0, "written_date": "April 26, 2019", "product_index": 1}, {"title": "Great addition to the dog park.", "rating": "4.0 out of 5 stars", "customer_id": "Amazon Customer", "body": "I donate these balls to a local dog park because they are inexpensive and no worries if one of the dogs take them home with them.", "people_count": 0, "image_usage": 0, "written_date": "November 23, 2020", "product_index": 1}], [{"title": "Not as good as wilson", "rating": "2.0 out of 5 stars", "customer_id": "Victoria Collis", "body": "Fine if you need a lot of tennis balls or if you’re using them for a dog, but they are definitely not as good as a name brand. They are not as hard, so they don’t bounce as well", "people_count": 0, "image_usage": 0, "written_date": "July 28, 2022", "product_index": 1}, {"title": "balls don't bounce well", "rating": "2.0 out of 5 stars", "customer_id": "Steve", "body": "Video Player is loading.", "people_count": 1, "image_usage": 0, "written_date": "October 24, 2022", "product_index": 1}, {"title": "Perfect for fetch", "rating": "4.0 out of 5 stars", "customer_id": "Joyce V", "body": "I bought these for my dog. She is obsessed with playing fetch with tennis balls. I think it's a good product, but not for a tennis player. Some of the balls were uneven with bubbles. I give four stars since a couple of them were defective, and a little expensive. I expected more quality.", "people_count": 0, "image_usage": 0, "written_date": "August 19, 2019", "product_index": 1}, {"title": "split quickly", "rating": "1.0 out of 5 stars", "customer_id": "Mike A.", "body": "6 month old german shepherd has split these quickly. Maybe its a bad batch as I have gotten before but these splits at rubber seems with little effort. Previous ones stood up to adult shepherd.", "people_count": 0, "image_usage": 0, "written_date": "January 16, 2023", "product_index": 1}, {"title": "Not Appropriate for Tennis", "rating": "2.0 out of 5 stars", "customer_id": "T. Cooper", "body": "I was excited by the deal and bought a pack. They come in a box and not a tube, this was in the description, I didn't read close enough. They don't bounce the same as a regular tennis ball and are too heavy. I would recommend these for playing with dogs, putting on the bottom of walkers and playing catch. Not for tennis", "people_count": 0, "image_usage": 0, "written_date": "March 19, 2022", "product_index": 1}, {"title": "Great entertainment for my pup…", "rating": "5.0 out of 5 stars", "customer_id": "kuki", "body": "Well these tennis balls are a godsend for my little bundle of energy... These definitely wear her out... She is addicted to them already and I love watching her run like the wind to catch and fetch them... She leaps like crazy chasing these tennis balls and gets so excited when she finally gets a hold of it... It's just as much fun for me as it is for her... Perfect size for a Shih Tzu dog... Will be buying more of these in the future for sure...", "people_count": 0, "image_usage": 0, "written_date": "May 9, 2018", "product_index": 1}, {"title": "Good for dogs.", "rating": "4.0 out of 5 stars", "customer_id": "hahaisdustin", "body": "Good for dogs. I don't play tennis, but the seam splits and it doesn't have the correct pressure.", "people_count": 0, "image_usage": 0, "written_date": "September 13, 2020", "product_index": 1}, {"title": "Dog tore up in seconds", "rating": "3.0 out of 5 stars", "customer_id": "Perry P", "body": "They r kinda cheap and aren’t standard pressure… dog tore them up in minutes", "people_count": 0, "image_usage": 0, "written_date": "December 11, 2021", "product_index": 1}, {"title": "A great value!", "rating": "5.0 out of 5 stars", "customer_id": "Amy Illich", "body": "This is the second time I’ve purchased these tennis balls. I bought them for my dog. I was worried about quality because the price was unbeatable but they are very sturdy, they have good bounce to them and my dog doesn’t tear these up. We always lose tennis balls at either the beach, park or they just go over our fence lol. Will continue to buy these. Very happy with the purchase!", "people_count": 1, "image_usage": 0, "written_date": "July 27, 2019", "product_index": 1}, {"title": "4/5", "rating": "4.0 out of 5 stars", "customer_id": "JJK", "body": "4/5", "people_count": 0, "image_usage": 0, "written_date": "May 19, 2021", "product_index": 1}], [{"title": "Do not bounce well", "rating": "2.0 out of 5 stars", "customer_id": "Elliot Higgins", "body": "Brand new balls seem like they are dead. Do not recommend", "people_count": 0, "image_usage": 0, "written_date": "September 21, 2022", "product_index": 1}, {"title": "I’m reviewing a dog toy, right!?!", "rating": "5.0 out of 5 stars", "customer_id": "Alison Hess", "body": "My dog tore them apart still- I won’t hold it against the product because even the sturdiest toys are goners but I loved being able to buy multiple tennis balls for this price and they last longer than the pet store toys but less than other name brand tennis balls—- in regards to dogs. I have no clue for actual play", "people_count": 0, "image_usage": 0, "written_date": "March 1, 2020", "product_index": 1}, {"title": "Horrible", "rating": "1.0 out of 5 stars", "customer_id": "Amazon Customer", "body": "Not sure what these are good for. No bounce, not round, too small.", "people_count": 0, "image_usage": 0, "written_date": "February 23, 2023", "product_index": 1}, {"title": "don't spend your money on these.", "rating": "3.0 out of 5 stars", "customer_id": "Mary C Johnson", "body": "these tennis balls are not for dogs who have a good bite. My dog popped one within ten minuets of opening the box!", "people_count": 0, "image_usage": 0, "written_date": "August 10, 2021", "product_index": 1}, {"title": "Not durable", "rating": "3.0 out of 5 stars", "customer_id": "Bailey", "body": "I read all the reviews saying how durable these were but unfortunately they were not durable at all. My dog barely had one for 15 min and it was already split in half. Usually we get the cheap ones from Wal-Mart and those have lasted a good month or so.", "people_count": 0, "image_usage": 0, "written_date": "October 5, 2020", "product_index": 1}, {"title": "Not the best for larger dogs", "rating": "3.0 out of 5 stars", "customer_id": "Justin", "body": "Bought these for my 65lb black lab to play with. Normally can get a few weeks out of a normal tennis ball before they pop. These only lasted a day or two before they split in half. They don't bounce as much and seem harder than normal.", "people_count": 0, "image_usage": 0, "written_date": "October 21, 2020", "product_index": 1}, {"title": "Decent", "rating": "4.0 out of 5 stars", "customer_id": "Winnie", "body": "I bought these with the intent to give some to my son to play tennis with and some for the dog. Tennis was never played, however the dog is totally obsessed. They seem to work well for the dog, tennis might be ok for a very casual player.", "people_count": 0, "image_usage": 0, "written_date": "July 12, 2018", "product_index": 1}, {"title": "11/12", "rating": "3.0 out of 5 stars", "customer_id": "Sophia Dafler", "body": "Only 11 tennis balls. One ball missing. The balls are cheap and not good quality, but that's to be expected based on the price.", "people_count": 0, "image_usage": 0, "written_date": "June 28, 2021", "product_index": 1}, {"title": "Bought for my lab!", "rating": "5.0 out of 5 stars", "customer_id": "Scott Unclebach", "body": "If you have a retriever you need to find a good deal on tennis balls. The balls you buy at the pet store just come apart in the middle quickly. Real tennis balls last much longer. Glad to find a reasonable source!!", "people_count": 0, "image_usage": 0, "written_date": "July 28, 2020", "product_index": 1}, {"title": "Got these for my Dog", "rating": "5.0 out of 5 stars", "customer_id": "lilly", "body": "My dog has a huge tennis ball obsession and was so happy when we poured out the box and they all bounced everywhere. I dont play tennis but I do have a tennis racket to throw the ball for my dog, from what I can tell its probably not the highest quality for a tennis player.", "people_count": 0, "image_usage": 0, "written_date": "February 10, 2020", "product_index": 1}], [{"title": "Bad quality", "rating": "1.0 out of 5 stars", "customer_id": "Atul", "body": "The surface of these balls is not of even thickeness on all sides. This causes ball to bounce unevenly. Additionally the balls bounce less and need more energy for hitting same distance compared to standard balls. Technically they lose lot of energy on collision and their coefficient of restitution is relatively low compared to standard tennis balls.", "people_count": 0, "image_usage": 0, "written_date": "November 8, 2022", "product_index": 1}, {"title": "not durable", "rating": "3.0 out of 5 stars", "customer_id": "Vincent Iijima", "body": "These tennis balls will last only for about half a pound of pressure! some in my box came pretty solid, but then after 5 min of using them, they could not bounce anymore! Would NOT recommend this to anyone - total waste of money", "people_count": 0, "image_usage": 0, "written_date": "October 17, 2020", "product_index": 1}, {"title": "They have a very bad odor", "rating": "3.0 out of 5 stars", "customer_id": "TwinMum", "body": "Got these to fluff pillows in the dryer. They smelled horrible straight out of the box, like someone had pooped on them. I dampened them and sprayed them with an odor killer and they were fine. May not use this brand next time I order tennis balls.", "people_count": 0, "image_usage": 0, "written_date": "September 7, 2020", "product_index": 1}, {"title": "Dogs love them too", "rating": "5.0 out of 5 stars", "customer_id": "boog", "body": "These are pretty good for my use. I throw them for my Black lab. He loves them too. He always retrieves them as required. However I have hound that also loves them. He manages to skin the fuzz off every one of them. He also pops them. Good balls though. They both love them.", "people_count": 0, "image_usage": 0, "written_date": "January 10, 2020", "product_index": 1}, {"title": "Great fun", "rating": "5.0 out of 5 stars", "customer_id": "Debbie Botto", "body": "Throughout the years I have bought my dogs balls from amazon. They are the favorite toy for them. When I see they are a lower price I stock up. You can never have to many balls.", "people_count": 0, "image_usage": 0, "written_date": "September 8, 2020", "product_index": 1}, {"title": "Great price for great ball", "rating": "5.0 out of 5 stars", "customer_id": "Alva", "body": "These were bought to be thrown for the dogs and have outlasted any other balls, they are very resillient to my dogs mouthing and have kept my dogs running and playing for many hours. I will be buying these again rather than any that say they are especially for dogs.. Having done my own tests for toughness these came out on top. 3 happy dogs and one happy customer. Will buy again", "people_count": 0, "image_usage": 0, "written_date": "March 15, 2018", "product_index": 1}, {"title": "Five more days and I'm out...", "rating": "3.0 out of 5 stars", "customer_id": "jeff phillips", "body": "Dog destroyed two of the within 35 minutes playing catch with a tennis ball launcher. Maybe she is a little too aggressive when it comes to tennis balls, but I have had some others last a little longer.", "people_count": 0, "image_usage": 0, "written_date": "November 9, 2020", "product_index": 1}, {"title": "no bounce - will return", "rating": "1.0 out of 5 stars", "customer_id": "AK", "body": "no bounce whatsoever, as if they are all deflated. will return", "people_count": 0, "image_usage": 0, "written_date": "February 8, 2023", "product_index": 1}, {"title": "Good for kids learning the play tennis", "rating": "4.0 out of 5 stars", "customer_id": "HarryG", "body": "Brought them for a tennis learning class for my 9 year old.Well made and quality is not on par with a known brand but Served my purpose of using them for practice. No complaints for the price I paid.", "people_count": 0, "image_usage": 0, "written_date": "February 6, 2019", "product_index": 1}, {"title": "What a great deal", "rating": "5.0 out of 5 stars", "customer_id": "Brazos", "body": "I wish i have ordered more, I mean, i am not the only one whose impressed by these balls. For some reason, they are like my dog's favorite toy right now, we go to a park which is just 2 blocks away from my apartment and plays catch almost everyday. BTW, my dog was such a chewer and these balls somehow survived, I have to say I was very impressed by the quality.", "people_count": 0, "image_usage": 0, "written_date": "February 6, 2018", "product_index": 1}], [{"title": "2 out of 12 with defects", "rating": "3.0 out of 5 stars", "customer_id": "Chris G", "body": "These balls looked like they would be a good value for the money but two out of the 10 had defects. One had a gash underneath the felt so it had no pressure inside and another had a significant wrinkle in the felt.", "people_count": 0, "image_usage": 0, "written_date": "August 28, 2020", "product_index": 1}, {"title": "Not for dogs", "rating": "2.0 out of 5 stars", "customer_id": "Meg", "body": "Not sure about how they are for tennis but if for a dog not worth the money. I thought the other comment were dramatic about how easy they are to chew up but they are so easy. My pit can chew everything even if it says it’s chew proof but even the penn tennis balls lasted a few days of fetch. One bit down from playing fetch and the ball is done.... total waste", "people_count": 0, "image_usage": 0, "written_date": "May 18, 2021", "product_index": 1}, {"title": "Great impulse purchase for my dog", "rating": "5.0 out of 5 stars", "customer_id": "ms", "body": "To be honest, this was one of those impulse purchases that seems to happen way too frequently while roaming Amazon. I wanted to see how much my dog would love 12 tennis balls bouncing around the house all at once!!! Balls came unpackaged in a cardboard box, so it was an easy tilt and drop for them to go flying. Purchase was worth the 30 seconds of entertainment.", "people_count": 43, "image_usage": 1, "written_date": "February 14, 2018", "product_index": 1}, {"title": "A dogs paradise", "rating": "5.0 out of 5 stars", "customer_id": "Angela M.", "body": "Purchased these for my Golden Retriever. It was like Christmas day opening the box. They have held up and didn't break like a lot of tennis balls/dog toys do when my golden chomps down on them. Think they would be great for tennis as well based on the quality.", "people_count": 0, "image_usage": 0, "written_date": "October 22, 2019", "product_index": 1}, {"title": "Meh", "rating": "3.0 out of 5 stars", "customer_id": "bh", "body": "As soon as I started hitting with them I realized there were holes in some of the balls out of the package. I guess these are good dog balls but not if you actually play tennis!", "people_count": 0, "image_usage": 0, "written_date": "September 8, 2020", "product_index": 1}, {"title": "Kevin’s 12 pak", "rating": "3.0 out of 5 stars", "customer_id": "Lisa M. Weathers", "body": "Not good, didn’t keep their bounce after a few uses.", "people_count": 0, "image_usage": 0, "written_date": "July 23, 2021", "product_index": 1}, {"title": "Works well for my needs but I don't play tennis.", "rating": "5.0 out of 5 stars", "customer_id": "Vanessa", "body": "For fun we tested to see if we got any \"dead\" balls. We are not tennis players but it seemed like 3 where towards their end of life. We put tennis balls in our drier to fluff our clothes, dry them faster and they eliminate the need for dryer sheets. Some are stored for later use and the rest are used to toss around when goofing off with our family and pets.", "people_count": 3, "image_usage": 0, "written_date": "May 8, 2017", "product_index": 1}, {"title": "Garbage product smells horrid.", "rating": "1.0 out of 5 stars", "customer_id": "Brian K", "body": "Bought them for a dog. I wasn’t expecting a lot but based on reviews, I thought they’d be okay. You can tell just by looking at them that they would be horrible for tennis. The wonky seams of the ball can be seen through the felt. They feel smaller than a standard ball too. Might be my imagination. I walked by my dog and thought her anal gland exploded because something smelt terrible. She had split a ball in half and for some reason they smell horrendous inside. A moment later she split another and they same funk as the first one.", "people_count": 1, "image_usage": 0, "written_date": "February 7, 2022", "product_index": 1}, {"title": "I bought these for my dog to play fetch with.", "rating": "1.0 out of 5 stars", "customer_id": "revchase610", "body": "My dog wanted nothing to do with them, I don't what that tells you. Neither good or bad. I would give them a go!", "people_count": 0, "image_usage": 0, "written_date": "December 17, 2022", "product_index": 1}, {"title": "These balls are garbage.", "rating": "1.0 out of 5 stars", "customer_id": "Lisa Arlinghaus", "body": "I bought these to play fetch with my dog with her Chuck It Stick. Not sturdy AT ALL. Most have broken in half after a few throws in the Chuck It Stick with my dog. The balls seem a tad smaller than normal, as they do not sit firmly in the Chuck It either, as other brands do. Very disappointed with these, will NOT buy again. Do not waste your money.", "people_count": 0, "image_usage": 0, "written_date": "August 15, 2022", "product_index": 1}], [{"title": "need more", "rating": "5.0 out of 5 stars", "customer_id": "Conor", "body": "These are outstanding tennis balls, our dog love to chasing these and they are strong enough to resist him chewing through them, held up pretty well. I do know they are not exist only for dogs, we actually played with these for a little family fun together as well. So overall, this is a great deal, i would purchase again for sure.", "people_count": 0, "image_usage": 0, "written_date": "February 7, 2018", "product_index": 1}, {"title": "Not for long pal", "rating": "2.0 out of 5 stars", "customer_id": "Katie O'Brian-Robles", "body": "Got these to toss to our dog Bella and if she'd play fetch, would have been delightful.. however she decided to shred and scatter so I have bits of yellow fluff floating all around and dangling from her whiskers... She actually set a new record for search and destroy with these balls and hey they weren't cheap..", "people_count": 0, "image_usage": 0, "written_date": "September 7, 2021", "product_index": 1}, {"title": "Good purchase", "rating": "4.0 out of 5 stars", "customer_id": "EMV", "body": "First of all they don't smell bad. Good price for what we are using them for. We plan to glue them to a board to make them look like a pile of cannonballs after they are spray painted.", "people_count": 1, "image_usage": 0, "written_date": "September 24, 2017", "product_index": 1}, {"title": "Durability", "rating": "5.0 out of 5 stars", "customer_id": "William Kenner", "body": "Nothing to dislike", "people_count": 0, "image_usage": 0, "written_date": "December 22, 2021", "product_index": 1}, {"title": "Great for playing with my dogs", "rating": "4.0 out of 5 stars", "customer_id": "Garbo916", "body": "I honestly cannot comment on how these are for tennis, but they are great for playing fetch with my dogs.", "people_count": 0, "image_usage": 0, "written_date": "November 8, 2019", "product_index": 1}, {"title": "BALLS!!!", "rating": "5.0 out of 5 stars", "customer_id": "weny", "body": "Bought these for our 2-year-old golden american eskimo mix. She can't get enough of playing fetch and tends to go through tennis balls quickly. These ones were really well priced and are working great for us! She hasn't broken one yet which is saying something. They wash clean easily. And they've made our pup a very happy girl.", "people_count": 0, "image_usage": 0, "written_date": "April 28, 2018", "product_index": 1}, {"title": "Not real good for Big Dogs.", "rating": "5.0 out of 5 stars", "customer_id": "englisc", "body": "My dogs love to chase these. Gives them good exercise.", "people_count": 0, "image_usage": 0, "written_date": "July 13, 2021", "product_index": 1}, {"title": "They shorted me", "rating": "4.0 out of 5 stars", "customer_id": "lucygirl1186", "body": "Product as described. Arrived in 2 days with prime. My only thing with it is they shorted me in one box. Not the biggest deal but if I pay for something I'd like to get what I paid for.", "people_count": 4, "image_usage": 1, "written_date": "July 7, 2017", "product_index": 1}, {"title": "Great for chairs!", "rating": "5.0 out of 5 stars", "customer_id": "Supremium", "body": "They’re perfect for chair legs!!!!!", "people_count": 0, "image_usage": 0, "written_date": "October 20, 2021", "product_index": 1}, {"title": "Great for dogs", "rating": "4.0 out of 5 stars", "customer_id": "lalaland", "body": "Bought for my dog best bang for buck. She breaks these a little quicker then the Penn or Wilson. But when she chews the way she does it doesn't matter. This is definitely the best route for dog tennis balls", "people_count": 2, "image_usage": 0, "written_date": "February 11, 2017", "product_index": 1}]]