[[{"title": "Worth The Price-Point; Pros and Cons", "rating": "4.0 out of 5 stars", "customer_id": "Momo", "body": "So this is actually a review including 2 bottles, as I recently bought one to replace the first one I had (first pic/blue-pink bottle) and haven't used the new one (Opal) yet. So functionality review will be based around my experience with my first.For the sake of those looking for a quick answer; I find the product to be worth the price-point. I also believe in getting what you pay for. I had my bottle for around a year (only tossed-out due to my own folly) and it did everything I wanted out of a bottle.Cons:- There was a bit of a weird, chemically smell/taste like others have mentioned. I did get it to go away; cannot say if others could as well.- You run a small-risk of getting a pre-dented bottle? Amazon makes it pretty easy to exchange (for me).-A little difficult to get the gasket in and out, so you can really make sure you don't have any bacteria growth in your lid.- Supposedly \"not actually vacuum-insulated\". **This is based on responses within other comments.Pros:- Absolutely keeps your drinks cold. Even if you just put the drink in cold, with no additonal ice.- At least sturdy enough to only get a little scuffed-up when it falls to the asphalt from the top of your car and no safety-bands on it.- Good for a long time, as long you don't heck up and let it get gross by accident. And you may even just be more confident in your sanitizing abilities than I am.As I mentioned above; I got my first bottle (blue/pink) about a year ago. I only replaced it because of my own mess-up, where I left Liquid IV I was drinking-on in it for waayy too long (I am ADHD and object permanency/executive dysfunction is a constant struggle) and I was not going to try and believe I could clean it thoroughly enouch, especially since the bacteria had gotten under the gasket as well (the thin, opaque, silicone-ring in your lid that creates the seal. The ring is removable (need something to pry it out), however that's a tight spot and didn't think I could scrub into it enough and feel safe.I don't believe my first bottle came with the additional 2-lids, so that was a nice surprise this-time-around, to have some options.I won't even really touch on the \"is it actually vacuum-insulated or not\" convo because, as much as I have a vague-knowledge about vacuum-spaces and the science to that.. I have the ability to admit I know nothing about how that applies to water-bottles enough to make some of the statements others have in their reviews. The Company seems adamant in that they are.. and if they have a step within their manufacturing process that involves attempting to create some kind of a vacuum-layer? Then I'm not going to sit here and try to call them liars, just because it doesn't seem to fit an ideal of what that should look like. 🤷🏼‍♀️Does it keep your stuff cold?? Yeah, 100%. I have put just refrigerated water, with no ice, and it's stayed cold for hours. Then it's even colder/longer with ice. I did get the weird, chemically smell/taste that others have mentioned. But I just used a straw-cleaning brush to get into the drinking-nozzle and crevices of the lid with some Dawn and really hot water and it was gone.There were a few, good drops that had happened and it barely dented, really even barely scuffed, which was impressive.. until.. lolWe come to the original order of the replacement bottle (Opal). Now, I was able to immediately order a replacement (that is 100% fine) and am sending this one back.. however, I am just incredibly curious what in the WORLD happened to it, more than anything?? Lol My old-bottle had never exactly fallen at 50mph onto a curb or anything like that.... But if the bottle in the 2nd pic is any indication to the possible results, I don't recommend being that rough with it. Lol the Amazon bag did not have any damage that correlated to the damage on the box/bottle, so I'm assuming it had already happened before being packaged for shipping to me. With how hard Amazon employees work, I don't really blame them for missing it (or not caring if they did see it lol).If you're looking for a water-bottle that functions and you don't mind the possibility of needing to exchange a faulty one and giving it a GOOD scrub before-use (really should be, anyways)? This is a great choice at a more humble price-point, compared to other brands whose products don't function much, if any better than this one would for you.", "people_count": 79, "image_usage": 1, "written_date": "February 5, 2023", "product_index": 4}, {"title": "Top Notch!", "rating": "5.0 out of 5 stars", "customer_id": "Christopher Inman", "body": "I have been suing my 32oz Iron Flask for well over a year. I used it EVERY day. Its on my desk at work, on the table at home, next to me in my car. I always keep a cold drink of water by my side in my Iron Flask. I can fill it with ice and water before I leave work friday and Monday morning when I roll into work I dump a little bit of ice out (assuming I dont refill the water along the way), wash and refill. Absolute beast when it comes to keeping ice and cold water.Its been durable as well. The color has a couple scratches to metal from dropping in on the ground. However, no dents. I use the flip open straw top exclusively and it was fine til i dropped it when open and it landed on that. It still works, but is a little wonky now (as in it has to be slightly pulled to the side to seal completely).I have never used it for hot drinks so I honestly dont know how it is for hot stuff, but thats not what I bought it for. I bought it specific for ice water at work. Its way to good to keep it on my desk alone so it travels with me. Zero complaints. Would buy then for family and my self again.", "people_count": 2, "image_usage": 0, "written_date": "April 4, 2023", "product_index": 4}, {"title": "Just what I wanted! Love it!", "rating": "5.0 out of 5 stars", "customer_id": "Christina", "body": "I drink tons of water and my previous water bottle while I like it I didn’t love it. I LOVE this bottle! It’s the 40 oz in peach. 1. Bigger than most water bottles without being awkward and enormous. 2. The peach is a beautiful color, I would call it more salmon or coral though than peach, but that’s what I wanted was coral so I’m happy. 3. My previous bottle drove me crazy because it was also metal and so LOUD! The handle is not one that swivels so it can’t hit the side and clang. Also when you drink (with the straw) it’s silent not a slurping noise. I bought the iron flask boot as well so the bottom doesn’t clang when you sit it down either. 4. Yesterday it was close to 80 degrees and it sat outside all day with me and the original ice still in it. It really does keep it cold! I’m not sure about hot because I don’t plan on using it for hot.Only con, which is not really a con, but I added the boot and paracord handle. I wish at least the boot came with it, you really do need it to protect the powder coating and noise reduction.", "people_count": 1, "image_usage": 1, "written_date": "April 7, 2023", "product_index": 4}, {"title": "Wonderful water bottle", "rating": "5.0 out of 5 stars", "customer_id": "Jay", "body": "I absolutely love this water bottle! The large size is perfect for my needs and lasts all day. The sturdy metal design is impressive and can withstand dents without any issues. I also appreciate the multiple tops that come with it, which can be customized for any type of drink, including hot coffee or cold water. The bottle does an excellent job of keeping my water cold throughout the day, which is a huge plus.One thing that really stands out to me is that the bottle does not leak, no matter how much I turn it upside down or drop it. The water tight lid is really effective, which gives me peace of mind knowing that I won't accidentally spill my drink. Additionally, cleaning the bottle is a breeze, and there's no chance for mold to grow.Lastly, the mint green color is beautiful and gets me lots of compliments wherever I go. Overall, I'm extremely pleased with this purchase and would definitely recommend it to others who are looking for a high-quality, reliable water bottle.", "people_count": 2, "image_usage": 0, "written_date": "April 2, 2023", "product_index": 4}, {"title": "Very good", "rating": "5.0 out of 5 stars", "customer_id": "kmcallah", "body": "I use this to keep water nearby me at all times, at home or at school. I love to drink water, especially cold water, and this flask does a great job at keeping water cold. I love the white with the light colorful marbling, it is easy on the eyes and I'm glad I went with it over one of the blue designs (I like blue too so they were also heavily considered when I was choosing a color). I've also stuck some stickers on mine recently and the design doesn't draw attention away from them.It is kind of wide, so I don't think it will fit in the average cupholder. I'm not personally concerned about this, so it isn't a deal breaker for me. I actually like the size of it a lot, I feel like it holds a decent amount of ice and water, and even though I drink from it often I don't have to fill it every time after I take a drink.I think if you're looking for a reliable water bottle, this is a good choice.", "people_count": 2, "image_usage": 0, "written_date": "March 29, 2023", "product_index": 4}, {"title": "Life Changing (Hear me out)", "rating": "5.0 out of 5 stars", "customer_id": "IIKrypticsII", "body": "This bottle is the one I've been looking for for soo long! Heads up, this is going to sound like a shill but its just that good IMO.Multiple lids - Amazing and such a nice convenience. Having the multiple lids have allowed me to use this for 90% of what I drink from now.Materials used - Soda safe! Soda always has a bad flavor from metal thurmice/cups but this one, I can safely say it works. Just be careful with which lid you use for this as carbonation could create a small explosion/leaking.Not a single drop has leaked from this bottle since I got it, 2-3 weeks IIRCThis bottle has allowed me to stop buying other bottles and actually drink water much easier (Your results may vary)Ive tried off-brand, cheap, expensive, Yeti tumblers, this one seals the deal for me. Insulation is decent, but dont take my word for that one. I am also not a coffee person, so do your research if you are that type of person. 4/5 stars only because cleaning can be a challenge with the lids.Got extra straw and a sticker with my purchase :) I can't be happier realistically.", "people_count": 10, "image_usage": 0, "written_date": "March 14, 2023", "product_index": 4}, {"title": "INCREDIBLY INSULATED", "rating": "5.0 out of 5 stars", "customer_id": "Shari", "body": "I typically use this for drinking water, so I know how well it keeps water cold all day. I did not, however, just how amazing the insulation is for hot liquid as well. I got new piercings so I whipped up a sterile saline solution just to have available to soak the piercing. I made it in the bottle by putting salt and pouring boiling water in. Then I put on the lid and put it in the fridge to use later. I figured I’d chill it so that if I want to use cold (for soothing or whatever) or warm I could heat some up in the microwave. ANYWAY…this was a day and a half before I used it for the first time. I went to pour some into a cup to heat up and soak my ear….but it was STILL BATHTUB HOT. Like….not warm. HOT. In the fridge for a day and a half. I am so impressed!", "people_count": 4, "image_usage": 0, "written_date": "March 27, 2023", "product_index": 4}, {"title": "The straw makes it easier to drink water discreetly", "rating": "5.0 out of 5 stars", "customer_id": "Karizma The Model", "body": "I purchased the peach colored Iron Flask bottle (18 oz.) and I love it. My size fits in a cup holder according to the description of the product . The design is sleek, beautiful, and the color shade is the same color as seen in the product's photos. My Iron Flask water bottle arrived on time and before I used it, I cleaned all the parts (including the bottle). It's like 3 bottles in one with the multiple lid options. This is an impressive water bottle and since it is designed well it should last a very long time. Definitely worth the investment. I love that this company have many colors available to personalize your bottle. In addition, my water stays cold for at least 8+ hours and the straw is easy to sip from. Love it!", "people_count": 3, "image_usage": 0, "written_date": "March 25, 2023", "product_index": 4}, {"title": "Cat & Elbow-proof", "rating": "5.0 out of 5 stars", "customer_id": "Marshall", "body": "I have six foot long elbows and cats who own every countertop in my home.As a result, this incredible water bottle has withstood some heavy hits and falls. Yet, it has never dented. The vacuum seal is still intact, still looks brand new.The exterior coloring has not yet scratched off after over a year of regular use, even on the bottom.The interior steel seems to be high quality, it \"sings\" when rubbed and has a rainbow sheen.I also have two of the wide mouth soup/food mugs, and they have the same durability.As a clumsy person who owns almost nothing without dents or damage, I highly recommend iron flask.", "people_count": 0, "image_usage": 0, "written_date": "April 7, 2023", "product_index": 4}, {"title": "The bottle is great, but the lids are very basic", "rating": "4.0 out of 5 stars", "customer_id": "C. Starr", "body": "I have been using a couple of Contigo water bottles for the past few years (a 24 oz. and 32 oz. Ashland Autospout), and I really liked them. However, they are not insulated, so will collect condensation on them when filled with ice water. I decided to get the Iron Flask because I know somebody who has one and likes it. I purchased the 40 oz. black bottle.I can fill this bottle with ice and cover the ice in water, and the ice will still be there 8-9 hours later, but only if you're not drinking out of it (I left ice water in it over night just as a test). If you are drinking from it occasionally, the ice is more likely to melt a little faster. Condensation has never formed on the outside of the bottle. The wide mouth is pretty much par-for-the-course for metal bottles; my Contigo tops actually fit well on this bottle. My MSR MiniWorks EX is a little more of a snug fit, but it still fits enough that I feel confident that I could use the two in concert to procure water outdoors. I have also purchased the Iron Flask paracord handle, which makes the bottle easier to carry. I do see some room for improvement, though not with the bottle itself, which has been working out great so far. My complaints are mostly with the straw/spout lid (which is the only one I use), and most of those I only really have because I am comparing it to my Contigo lids.The old Contigo Autospout lids were better in almost every respect; they had a lower profile, they were more watertight, they had a more rigid straw, and you could operate them with one hand. The Iron Flask lid often has to be set on a surface to be opened with one hand. Having a springy spout with a button-operated catch is a much easier and more convenient system to use one-handed. The loop on the spout lid is also just about perpendicular to the long axis of the bottle, which makes carrying it in hand or attaching it to a backpack a little more cumbersome than a design with an more steeply angled loop. As mentioned above, I purchased the paracord handle, and that makes this bottle significantly more convenient. The air inlet on the lid is plugged by a small post that is molded into the drinking spout. This is enough to keep water from pouring out when the spout is closed, but if the bottle is laid on its side, there will be some minor seeping over time. Something like an umbrella valve might make this problem go away. The last problem I have is the straw is not quite as rigidly fixed to the top as I'd like. If you fill up the bottle with ice, it is harder to jam the straw all the way to the bottom because it is held to the lid with a flexible fitting (looks like silicone, maybe). The Contigo straw was less likely to wobble around as you pushed it through the ice, which meant it was easier to put on when the bottle was filled with ice.All in all, I'd say the bottle is very good, but the tops are a little lacking. I would simply use the tops to my old Contigo bottles if they had longer straws that went all the way to the bottom of the bottle, but they don't. Iron Flask should seriously consider creating something similar to the old Autospout lids (or even just licensing the design or something). Even if they sold it separately, I think it would be an excellent addition to a very good bottle.", "people_count": 93, "image_usage": 0, "written_date": "November 8, 2022", "product_index": 4}], [{"title": "Great Flasks!", "rating": "5.0 out of 5 stars", "customer_id": "Emily", "body": "These are by far my favorite water bottles. I have like 7 of them for our family of 5. We've had them for over 2 years now and they are so easy to clean. You never feel like you can quite get a part clean and they don't stink or anything! They are sturdy! We've dropped them on the ground countless times and they are still alive. You can buy new lids and straws if yours does break! These keep things cold for a very long time even in the hot summer heat! They are not leak proof if they are left open but once you close them they are leak proof!", "people_count": 0, "image_usage": 0, "written_date": "April 4, 2023", "product_index": 4}, {"title": "Functional, Pretty, Leak-Proof", "rating": "5.0 out of 5 stars", "customer_id": "Amazon Customer", "body": "This is my second iron flask purchase--I only purchased a new one because I wanted one that would fit in my car's cup holder. I love the mint green color--and I love the wide straw lid that comes with these iron flask water bottles. It does a great job of keeping my water cold. I haven't tried hot beverages in this, but I'm sure it would do a great job at keeping those hot as well. The only issue I've ever had has been cleaning the lid/gaskets thoroughly, as some reviewers have mentioned previously. However, if you keep up on cleaning them and don't let beverages sit in the water bottle for long, these water bottles will last you a long time. Overall, best bang for your buck for a sturdy, leak-proof, lightweight water bottle. Highly recommend!!", "people_count": 3, "image_usage": 0, "written_date": "March 22, 2023", "product_index": 4}, {"title": "Excellent Product and Support", "rating": "5.0 out of 5 stars", "customer_id": "Ian", "body": "I purchased the 64oz bottle to replace my TAL Hydration version of the same size.I realize it seems a bit excessive to get a 64oz bottle but personally I disagree. I know I'm hydrated if that bottle is empty at the end of the day. The best part is if I put a little ice in there, the water is gonna be cold for a long time.In terms of the Iron Flask version it's really got everything I need. 3 different lids to choose from. I usually use the flip top one which is much easier to clean than the screw cap I was using previously. The black/white gradient design is pretty sick as well. Honestly the best part so far has been the customer service. I tried to order a replacement cap for my TAL bottle and waited....and waited. No response, so eventually I cancelled the order and went with Iron Flask. I didn't realize it came with a lifetime warranty until I received it. Messaged support to register my bottle and it was all done within the hour.I may come back to this review in the future as I've only had the bottle a couple weeks but so far so good.", "people_count": 11, "image_usage": 1, "written_date": "February 28, 2023", "product_index": 4}, {"title": "Surprising impulse purchase", "rating": "5.0 out of 5 stars", "customer_id": "Technetron", "body": "I didn't \"need\" a water bottle, but all my friends had cups they carried around with them. The IRON °FLASK Sports Water Bottle - 32oz seemed like a practical option -- much cheaper than the hot brands. Now, I don't know what I did without it.The stainless steel double-walled bottle keeps drinks with ice for half-a-day or more. The three options for spouts gives me a choice. Plus, the bottle just looks great: I got the all black model. I expect years of use from the bottle; so, I bought some extra straw caps.", "people_count": 0, "image_usage": 0, "written_date": "April 1, 2023", "product_index": 4}, {"title": "Great product", "rating": "5.0 out of 5 stars", "customer_id": "Brandon", "body": "I was in the market for a water bottle that would stay cool or hot throughout the day as my job has me on the road every now and then and hydration is a must. I did not want to pay $60 for a hydro flask as I think that’s just absurd. I found iron flask and even though I’ve only have it for about a week or so it keeps my drinks at a consistent tempature which is ultimately what I was looking for. Also what you get sold me a couple of my buddies said when they purchased a hydro flask they only got the wide mouthed top but with the iron flask you get 3 different tops and an extra straw in case one breaks as well as the item having a lifetime warranty. Last but not least the price point is reasonable and will not break the bank which is always a plus.", "people_count": 10, "image_usage": 1, "written_date": "March 14, 2023", "product_index": 4}, {"title": "Impressed with the iron flask", "rating": "4.0 out of 5 stars", "customer_id": "Crystal", "body": "I recently purchased an Iron Flask and I must say, I am quite impressed.Firstly, the design of the Iron Flask is very sleek and modern. It looks great and I've received a lot of compliments on it. The matte finish is really nice and it doesn't show any fingerprints or smudges. The lid and the handle are also well-designed and easy to use.Secondly, the insulation of the Iron Flask is fantastic. It keeps my water cold for hours, even on hot days. I've also used it to keep my tea hot and it works just as well for that. I was worried that the lid might leak, but it's been completely watertight so far.Thirdly, the size of the Iron Flask is perfect for me. It's not too big and bulky, but it's also not too small. It holds just the right amount of water for me to get through a workout or a day at the office without having to refill it too often.The only reason I'm not giving it a five-star review is because I think the price is a little bit high compared to other water bottles on the market. However, if you're looking for a high-quality water bottle that will last you a long time, then I think the Iron Flask is definitely worth the investment.", "people_count": 7, "image_usage": 1, "written_date": "March 3, 2023", "product_index": 4}, {"title": "Great Water!", "rating": "5.0 out of 5 stars", "customer_id": "Amazónica", "body": "I absolutely love my Iron Flask water bottle! It's the perfect size for staying hydrated throughout the day and the double-walled insulation keeps my drinks cold for hours on end. I also love the fact that it's made with high-quality stainless steel, which means it's both durable and easy to clean.The lid is also very well designed - it has a convenient handle for carrying and a secure snap closure to prevent leaks. Plus, the flip-top lid makes it easy to drink on the go without having to unscrew the entire top.Overall, I couldn't be happier with my Iron Flask water bottle. It's a high-quality product that's both functional and stylish, and I would definitely recommend it to anyone looking for a great water bottle!Oh and by the way if anyone is interested Googipet, makes awesome vitamin Chews for dogs to keep your pup happy and healthy.", "people_count": 2, "image_usage": 1, "written_date": "March 3, 2023", "product_index": 4}, {"title": "Very unique design", "rating": "5.0 out of 5 stars", "customer_id": "Caitlin Henry", "body": "This is a great water bottle, if I put ice in it, the ice will last all day until late in the evening. It keeps water ice cold and has not leaked at all. I got this several months ago and it still looks brand new and I havent experienced any issues with it. It came with 3 different lids. I need a straw to motivate myself to drink water, but it came with the straw lid, a wide mouth lid, and a regular lid with a mouthpiece that has a screw-off lid", "people_count": 0, "image_usage": 1, "written_date": "March 29, 2023", "product_index": 4}, {"title": "This may sound silly but...", "rating": "5.0 out of 5 stars", "customer_id": "R. J.", "body": "I know it sounds dumb to say that a water bottle can make your life better, but I'm saying it anyway. It's not like I don't have a shelf full of water bottles already, some top brands included but none of them were ever \"just right\". This bottle is perfect for me. I got the 22 ounce wide mouth. It came with 3 lids. It fits in the cup holder in my car which is key for me. I also purchased the silicone boot for the bottom. If you are on the fence don't hesitate. It's a fabulous bottle at a very reasonable price.", "people_count": 0, "image_usage": 0, "written_date": "March 24, 2023", "product_index": 4}, {"title": "About to buy my second", "rating": "5.0 out of 5 stars", "customer_id": "Megan Bartlett", "body": "I had this bottle since 2020. I absolutely loved it, and then the lid cracked when I dropped it. Totally my fault. I emailed customer service asking if I could just purchase a new lid alone and instead they sent me a little mini bottle for free as that was the only way for me to get a new lid. Customer for life now.My little crotch goblin somehow sent my beloved bottle to Narnia. One minute I hear him playing with it and the next, it’s totally vanished. Turned the house upside and can’t find it. So now I’m purchasing another and can’t wait until I’m hydrated once more.", "people_count": 0, "image_usage": 0, "written_date": "March 22, 2023", "product_index": 4}], [{"title": "Great all around bottle", "rating": "5.0 out of 5 stars", "customer_id": "Pat", "body": "I wanted a bottle that works when sick in bed, on the road or out and about. This works for all those reasons. I like the different lids though I use the straw mostly. It keeps cold though I haven't tried it for 24 hours. I have tried 12 and it remained cold. I like it as much as my corkcicles which are more expensive. I will probably be buying another one.", "people_count": 0, "image_usage": 0, "written_date": "April 9, 2023", "product_index": 4}, {"title": "Love these!", "rating": "5.0 out of 5 stars", "customer_id": "Viviana", "body": "Bought some for my husband and I. We love them! Does not fade in the dishwasher like most others do. Comes with additional types of lids and none of them leak, all of them do what they say they are going to do. Loved them so much, bought some for all our children for Christmas. We are all water-aholics, having to always have a bottle of water with us everywhere we go. This fits the bill! Yes, pricey, but so very well worth it! I am buying more when I need to. That may be a very long time though.", "people_count": 0, "image_usage": 0, "written_date": "March 25, 2023", "product_index": 4}, {"title": "Last Bottle Standing", "rating": "5.0 out of 5 stars", "customer_id": "Jocelyn Harrison", "body": "My 8yo has not managed to destroy this water bottle despite her best efforts. For perspective, she's gone through 3 this school year already prior to this one. She thought she'd broken the flip up straw on the lid, but it turns out she'd just popped it off. I was easily able to pop it back into place. It fits into the side pocket of her Jansport backpack. It doesn't get stinky or overly grubby despite going through a school day and not always getting cleaned before being put through another one. Definitely an example of getting what you pay for. I regret nothing. If you're on the fence, hop down and buy it.", "people_count": 0, "image_usage": 0, "written_date": "March 15, 2023", "product_index": 4}, {"title": "Can survive car crash unscathed!!", "rating": "5.0 out of 5 stars", "customer_id": "Susan Echeverria", "body": "I bought my first Iron flask march 2021 and it has been through hell and back yet still looks like I just pulled it out of the box! This will last 5lifetimes if not more. Me and my 40oz flask were in a bad crash early 2022 and has not a single scratch or any indication of damage of any sort. I’ve dropped it too many times to count-yes even on concrete and asphalt- and you can not tell at all. I recently got the 22oz simply because the 40oz does not fit cup holders and is more travel friendly. Tops are interchangeable, and comes with 3 lids plus 2 straws each. Also great for self defense if you have the paracord handle! This will forever be my go to! #customerforlife", "people_count": 6, "image_usage": 1, "written_date": "March 3, 2023", "product_index": 4}, {"title": "Fe Fi Fo Flask. I once saw The Man in the Iron Mask.", "rating": "5.0 out of 5 stars", "customer_id": "DillPickleSeeds", "body": "As far as flasks go, this is really nice. So much so, I am actually writing a review and worked in 'Fe' into the headline, because you know, Fe is the chemical symbol for Iron - and this is an Iron Flask. Oh, and that made me think about the Man in the Iron Mask bc 'Iron' is in both, and 'mask' rhymes with 'flask.' ... 5/5 stars.", "people_count": 0, "image_usage": 0, "written_date": "March 28, 2023", "product_index": 4}, {"title": "Careful...", "rating": "4.0 out of 5 stars", "customer_id": "Sai", "body": "I bought the 64oz which has a seam in the mouth (the 40oz doesn't) and I looked in there today, not even a week after it arrived, to find rust so just be sure to check every once in awhile that everything is kosure. I'm used to working with cast iron so I know I can scrub it out but it's not really something I want to have to worry about constantly.Other than that I feel like I haven't really been able to give this a fair shot but as mentioned, I bought a 40 oz as well which I'm hoping will be better.Also, I'm rating this as \"not easy to drink from\" (next section of review asks for a star rating on this feature) because I very much want a super fast, super smooth flow so I can chug like my embrava (not insulated) water bottles but I don't think that I will ever get that from any hot drink lid. Still a pita to have the lids be so... Gluggy and slow pour just because I prefer warm water.", "people_count": 2, "image_usage": 1, "written_date": "February 23, 2023", "product_index": 4}, {"title": "Absolutely Fantastic!", "rating": "5.0 out of 5 stars", "customer_id": "Tricia", "body": "I needed a new water bottle because my old one started leaking and I wanted to get one of a decent quality for a decent price. I never write reviews but I had to for this.I left this bottle in my car by mistake, overnight and through the day until mid afternoon. I live in Florida and it was 86F. When I drank from it, the water was still cool inside. After 19 hours. In a hot car.Great investment.", "people_count": 1, "image_usage": 0, "written_date": "March 28, 2023", "product_index": 4}, {"title": "Fantastic water bottle for the gym or general use", "rating": "5.0 out of 5 stars", "customer_id": "Michael Z.", "body": "I got this water bottle for using at Orange Theory, which involves a lot of time circuit training and running on the treadmill. The lid with the straw spout on it is great for quickly grabbing a drink even while jogging on the treadmill. Also, I sweat a lot, so the larger size is great.Overall, the bottle is so good I actually immediately bought myself a second one for general use at home. Highly recommend!", "people_count": 0, "image_usage": 0, "written_date": "March 29, 2023", "product_index": 4}, {"title": "Wow, is all that is needed.", "rating": "5.0 out of 5 stars", "customer_id": "tiffany1980", "body": "This is my husbands 2nd bottle. We had been looking for a large enough water to take to the gym. One that’s easy to drink from, keeps our water super cold and holds the right amount. We have tried others that don’t have a straw and I will tell you it’s a pain in the rear to try and drink from those style bottles. The option to switched tops is nice but the straw is the way to go. Iron Flask is our #1 go to! Great product guys!", "people_count": 0, "image_usage": 0, "written_date": "March 19, 2023", "product_index": 4}, {"title": "Mom approved", "rating": "5.0 out of 5 stars", "customer_id": "Julia Carson Cutsinger", "body": "These are the best for my kid to take to school. He never puts it in the little side drink holder on his backpack which means he is throwing it in the big part of his backpack. Other water bottles have leaked and soaked all of his folders and papers! This one has never gotten his backpack or papers wet. This mom approves these bottles. We have three different sizes and we love all of them. My kid has four of the 12-14 oz bottles and I will never switch!! If you are hesitant about purchasing this bottle, rest easy! Buy it!", "people_count": 0, "image_usage": 0, "written_date": "March 20, 2023", "product_index": 4}], [{"title": "OUTSTANDING customer service!", "rating": "5.0 out of 5 stars", "customer_id": "Caren", "body": "I love this water bottle, however, no matter what I did, I couldn't get rid of the chemical taste. I tried their recommended steps twice, still didn't work. I reached out to ask what else I could try since I really love the actual bottle. They sent me a replacement, no questions asked and it arrived quickly. The BEST customer service I've experienced in quite a while!", "people_count": 0, "image_usage": 0, "written_date": "March 24, 2023", "product_index": 4}, {"title": "your drink will stay at the temp you poured it in", "rating": "5.0 out of 5 stars", "customer_id": "Mikki Singh", "body": "This is my first vacuum insulated water jug as i used plastic (64oz) ones in the past. I am very happy with I pour cold water in it and its cold even after a couple hours or overnight. i always keep water with me and i wanted a 64 oz as i had in the past to avoid refills. Only thing I would find difficult is that I am used to a handle on the side of the plastic bottles, so along the purchase I bought the iron flask water bottle sleeve made for the 64oz, which has a handle on the side and bonus a shoulder strap to be hands free. Water in the plastic bottle would get to room temp but not this one. i love icy cold water and it stays like that until its empty. I researched a couple vacuum insulated 64 oz bottles and i decided to go with this one and with a week of using it i am happy with it.", "people_count": 3, "image_usage": 0, "written_date": "February 21, 2023", "product_index": 4}, {"title": "Ordered two more", "rating": "5.0 out of 5 stars", "customer_id": "DW", "body": "My wife has only had it long enough to use it twice at work, but she is very happy with it.We put it in the freezer the night before and put some of her drink into an ice cube tray.In the morning we put in the ice cubes, fill her flask, and off to work she goes.Part of her day does require her to be outside, so the Flask does go out with her. Still cold at the end of the day after refilling twice throughout the day.My only complaint is that the discount code they sent us doesn't work on Amazon sales for when we made a second purchase.", "people_count": 3, "image_usage": 0, "written_date": "March 13, 2023", "product_index": 4}, {"title": "Great Product", "rating": "5.0 out of 5 stars", "customer_id": "Happy Customer Happy Life", "body": "I fill this up with ice then continuously add water. I do not have to add ice for 3 days. It is naturally a little heavy when filled but so worth it. Only complaint I have is that it was slightly dented at the bottom corner. I needed it for a trip so did not return it.", "people_count": 0, "image_usage": 0, "written_date": "April 2, 2023", "product_index": 4}, {"title": "Most Used Purchase of 2020", "rating": "5.0 out of 5 stars", "customer_id": "WOG1981", "body": "This water bottle has been great in so many ways. I bought it while pregnant because I knew I’d need an easy way to drink tons of water while breastfeeding and caring for a new baby. Boy was I right! Used it in labor/delivery, all day especially those first few weeks when it was hard to get up and down to get a cup of water, all night when baby woke up to nurse and triggered me to be thirsty, and it was the first water bottle the baby learned to drink from when old enough for water. We always have it on us when we leave the house. We farm and garden and have used it daily on farm trips and it holds up to getting dropped, extreme heat, bitter cold, dirt, sand, cow poop, you name it. The colored powder coating and the rest of the water bottle still looks fantastic.Eventually the straw lid, that I love so much because it allows me to drink a lot of water quickly, started having suction issues, leaking, and eventually the mouthpiece became loose from me fiddling with it trying to get it to work and from cleaning and the kid lost it somewhere after that. Switched to the canteen style lid and didn’t like it.I decided to reach out to Iron Flask to see if they would replace the straw lid and they were super fast to respond to my email and sent me not one, but TWO replacement straw lids (for free). It came with 2 of the actual lids, 4 straws, and 2 straw cleaning brushes! Retail packaging and everything. Very impressive customer service.My only regret with this water bottle was not buying a second one in 40oz and having that one for daytime and the 32oz one that stays clean by the bedside for night time so if I’m tired and the daytime one is dirty I don’t take a dirt covered water bottle into the bedroom. Maybe that’ll be my next gift to myself.My husband has the biggest sized one for work and loves it too. So glad to not be buying him packs of water from the store anymore. Not we spend less, drink less micro plastics and fluoride, and have nice cold water on hand in abundance. I’ve noticed his water consumption has gone way up since he got his and he usually drinks the entire thing during his workday.Highly recommend this product and company.", "people_count": 38, "image_usage": 0, "written_date": "November 29, 2022", "product_index": 4}, {"title": "Great product line.", "rating": "5.0 out of 5 stars", "customer_id": "Jessica", "body": "This is my third Iron Flask bottle/tumbler. I have been very impressed with their products. I have had ice still in the bottle after 2-3 days. The only issue I had (on my older bottle) was the seal gasket as it got mold spots on it - this was user error as I didn’t pull it out and clean it on a regular basis. I just bought new straw lids + gaskets and they fit both bottles that are different sizes.", "people_count": 0, "image_usage": 0, "written_date": "March 23, 2023", "product_index": 4}, {"title": "The perfect bottle for making sure to get her daily water intake.", "rating": "5.0 out of 5 stars", "customer_id": "nkhat", "body": "I've had this bottle for over 2 years and still love it. It's sturdy and keeps my water very cold. The straw makes it very easy to drink from. It's heavy duty so it's best sitting on my counter throughout the day and I use smaller, lighter bottles when on the go. Highly recommend.", "people_count": 0, "image_usage": 0, "written_date": "March 29, 2023", "product_index": 4}, {"title": "Heavy Duty Water Flask", "rating": "5.0 out of 5 stars", "customer_id": "Patrick", "body": "I use this flask everyday to try to drink at least this full amount during the day. This is a solid flask, keeps the water cold for the entire day. Easy to use flip up straw to drink from. Comes with a second lid that doesn't have a straw.", "people_count": 0, "image_usage": 0, "written_date": "April 1, 2023", "product_index": 4}, {"title": "Stays cold. Or hot!", "rating": "5.0 out of 5 stars", "customer_id": "Sherrii", "body": "I am a die-hard Iron Flask lover. From my first purchase it's been a quality item. Recently I purchased the 64oz and the coffee cup, matching of course! So in summary, buy it! There are others out there, but Iron Flask is a bargain and it works!!", "people_count": 0, "image_usage": 1, "written_date": "April 4, 2023", "product_index": 4}, {"title": "Water bottle obsession", "rating": "5.0 out of 5 stars", "customer_id": "jmkt", "body": "I have a slight fever obsession with water bottles. I carry them with me everywhere. This 64 Oz bottle is perfection. Helps me easily meet my daily water goal and keeps water cold for a very long time. It’s a well made, sturdy bottle.", "people_count": 0, "image_usage": 0, "written_date": "March 28, 2023", "product_index": 4}], [{"title": "Solid Product!", "rating": "5.0 out of 5 stars", "customer_id": "jhauck6", "body": "Used this on vacation in Grenada to keep my drinks cold at the beach. Ice lasted all day and drinks stayed nice and cold. Great variety in the different lids they provide. A very solid water bottle I would purchase again.", "people_count": 0, "image_usage": 0, "written_date": "March 28, 2023", "product_index": 4}, {"title": "Very nice!", "rating": "5.0 out of 5 stars", "customer_id": "Deborah", "body": "Easy to clean, and easy to carry/use. Impressed with the cold property so far - kept water cold of over 30 hours with Ice still remaining. I have not tried it with hot liquids yet, but intend to use it just for cold anyway. So far, a very good product for the cost!", "people_count": 0, "image_usage": 0, "written_date": "April 3, 2023", "product_index": 4}, {"title": "Perfect size for travel", "rating": "5.0 out of 5 stars", "customer_id": "T T", "body": "I bought this for traveling overseas. It was the perfect size, fits in the backseat pocket of the plane and in my crossbody bag. The interchangeable lids are perfect and the wide opening is easy for filling and cleaning.", "people_count": 0, "image_usage": 0, "written_date": "April 1, 2023", "product_index": 4}, {"title": "Awesome!! My new Go To!", "rating": "5.0 out of 5 stars", "customer_id": "JLasagna", "body": "these are just as good as my Yeti but lower costs—- which will keep me a customer since I have teens that take them, and lose them on the regular, so replacing often! LolLOVE the color options too!", "people_count": 0, "image_usage": 0, "written_date": "March 29, 2023", "product_index": 4}, {"title": "Keeps drinks nice and cold", "rating": "5.0 out of 5 stars", "customer_id": "Mrs Tut", "body": "I've been using this for more than a month now and I am very satisfied with how cold it keeps my drinks. I put ice in my lemonade in the morning and there is still ice in the drink before I go to bed! I raved about it so much that my husband asked me to order one for him and he loves his too!", "people_count": 0, "image_usage": 0, "written_date": "March 22, 2023", "product_index": 4}, {"title": "Just the best bottle you can buy", "rating": "5.0 out of 5 stars", "customer_id": "Nicolas Leuchtenberg da Silva", "body": "The bottle feels so strong, I love the paint quality overall.I also think the different caps are a huge win, you can have so many choices.The packaging also was great and had no issues with transportation.", "people_count": 0, "image_usage": 0, "written_date": "March 31, 2023", "product_index": 4}, {"title": "Great hydro flask!", "rating": "5.0 out of 5 stars", "customer_id": "Lizbeth Dodge", "body": "Looks just just the picture, the blue marbled color is really so pretty. built really well, I’ve dropped it a few times and hasnt scratched or dented. Use it everyday. Love that it has a handle for carrying.", "people_count": 0, "image_usage": 0, "written_date": "April 8, 2023", "product_index": 4}, {"title": "Love this bottle!", "rating": "5.0 out of 5 stars", "customer_id": "Justin H.", "body": "Got this bottle a while back for a good work bottle to bring back and forth. This thing seals up tight and keeps drinks cold for a long time. I can often fill it halfway with ice and water and there will still be ice in it over 24 hours later. Bottle cannot be cleaned by hand without a bottle brush as the opening is too small for your hand but that’s only a minor inconvenience. Definitely recommend.", "people_count": 0, "image_usage": 0, "written_date": "March 12, 2023", "product_index": 4}, {"title": "Keep your Stanley, I'll take my Iron flask.", "rating": "5.0 out of 5 stars", "customer_id": "Kelly", "body": "I have owned LOTS of vacuum insulated stainless steel bottles and this is definitely my favorite. In fact, I own two iron flasks, one in the 64oz size that I keep in my fridge at home and this one, that I take with me on the go (since the 64 oz one is just too big to tote around). I love the lid options (the straw lid is my current favorite but it's nice to be able to shake it up sometimes). I love the color. I love the quality! I bought the silicone boot to go on the bottom which I would definitely recommend. Also, this does a good job of keep beverages cold, but I find the perfect combination is this bottle plus 3-4 reusable silicone ice cubes. My water stays ICE ICE cold all day long!I have zero complaints about this bottle and highly recommend this brand if you're in the market.I sincerely hope this review has been helpful to someone else! And yes, I paid full price for both of them. Feel free to ask any questions!", "people_count": 11, "image_usage": 1, "written_date": "February 15, 2023", "product_index": 4}, {"title": "Good overall experience with product and company", "rating": "5.0 out of 5 stars", "customer_id": "Kenny Kuang", "body": "Had an all red one for about 2 months before it got stolen, like it enough to get a replacement but it had a minor dent at the bottom. Customer service was helpful in getting that situation resolved quickly and without hassle. All things considered pretty good experience overall with the product and iron flask as a company, would recommend.For the bottle itself, it keeps drinks the same temperature they were put in for quite a while, poured hot water in at night when it was too hot to drink comfortably and then next morning it was a pleasant level of hot. From what I noticed the outer part of the bottle doesnt change temperature due to the drink inside.Lids, they all work though personal preference plays a big part in which you like best. Screw on lid is great for keeping drink temperature the same for longer but isnt great for frequent quick sips. Flip top is good but drinking from the bottle may be difficult for people with larger noses or larger bottle sizes due to the weight and since the hole is so recessed in the lid. Straw lid is convenient with ease of use and cleaning (inner section is removable and comes with a spare), solid top section doesnt feel the best since its rectangular shaped but you get used to it", "people_count": 6, "image_usage": 0, "written_date": "January 23, 2023", "product_index": 4}], [{"title": "Great Flask", "rating": "5.0 out of 5 stars", "customer_id": "John Jaeger", "body": "Bought a 32 oz Hydroflask as a souvenir while visiting Glacier National Park. Love the flask, but very pricy, and too large to fit the drink holders in my cars. So I decided to get a smaller bottle to take in the car. Chose the 22 oz Iron Flask. Every bit as nice as the Hydroflask, and substantially cheaper. Very, very happy with it.", "people_count": 0, "image_usage": 0, "written_date": "March 25, 2023", "product_index": 4}, {"title": "Pretty colors!", "rating": "5.0 out of 5 stars", "customer_id": "Courtnee", "body": "Love the colors options! Nice sturdy bottle and no \"sweating\". My ice so far seems to last about 2 full days. I bought for work. Might be ordering another another that fits in cup holders.", "people_count": 0, "image_usage": 1, "written_date": "March 29, 2023", "product_index": 4}, {"title": "Buy without worry.", "rating": "5.0 out of 5 stars", "customer_id": "Gregg Burtnett", "body": "This is a very well made product with a lifetime warranty. My wife and I each have one of these. We used the warranty for my wife’s due to the lid not sealing and it couldn’t be easier. The customer service staff was excellent and problem solved quickly.Now, we’re just back to enjoying them. I 100% recommend them.", "people_count": 0, "image_usage": 0, "written_date": "March 23, 2023", "product_index": 4}, {"title": "Nice Water bottle", "rating": "5.0 out of 5 stars", "customer_id": "AC", "body": "TLDR: 22oz. Three lids two straws. 24hour temp hold. If there’s remaining water in spout sometimes gets into straw bed. Overall leak proof.I got the 22oz iron flask, came with three lids and two straw inserts. Keeps my water cold for over 24 hours (with ice still partially intact) the straw is the order length however sometimes a bit of water pools in the area that the straw lays in, but other only if there’s water left in the spout, overall leak proof.", "people_count": 0, "image_usage": 1, "written_date": "March 11, 2023", "product_index": 4}, {"title": "sturdy", "rating": "5.0 out of 5 stars", "customer_id": "Zackery", "body": "I drop this thing at least once a day and there is never a mark to be seen. I suck at drinking water so carrying this big boy (40oz) around really helps me remember", "people_count": 0, "image_usage": 0, "written_date": "April 2, 2023", "product_index": 4}, {"title": "Awesome bottle", "rating": "5.0 out of 5 stars", "customer_id": "Shannon", "body": "Let me start off by saying that I just had this delivered a few hours ago so my review will be based off a short timeframe.I was blown away with my first impression of this bottle. I mainly got it to use the straw lid and was worried it would be loud. I planned on using this bottle mostly at night by my bed, so I wanted a quieter one. So far, it seems to be fairly quiet.The colors are also amazing and are pretty true to the pictures on here. Very happy with this purchase.", "people_count": 0, "image_usage": 0, "written_date": "February 27, 2023", "product_index": 4}, {"title": "Great but…", "rating": "5.0 out of 5 stars", "customer_id": "Jim", "body": "I like these water bottles. So much that I bought two to last longer. Great to drink from, excellent to last, and great sizes provided. I bought the 32 oz ones. Here’s the downside-they don’t keep it cold for 24 hours. I put ice and water in there every day and the ice lasts for maybe an hour or 2 and the cold only lasts for 8 hours max. Had these for about a year but looking for something that lasts longer for cold", "people_count": 0, "image_usage": 0, "written_date": "March 10, 2023", "product_index": 4}, {"title": "I love it!", "rating": "5.0 out of 5 stars", "customer_id": "Amazon Customer", "body": "Not to much to say. I can leave water with ice in it over night and still have ice the next day, the price point is good. It came with multiple tops and a straw option that I personally prefer. I work in a manufacturing plant and it gets beay up and dropped every day and there isnt a scratch on it. Exactly what I was looking for when I purchased.", "people_count": 0, "image_usage": 1, "written_date": "March 20, 2023", "product_index": 4}, {"title": "My second round of these bottles", "rating": "5.0 out of 5 stars", "customer_id": "Marc", "body": "Love these bottles. Family uses this brand exclusively. After about 2 years we had just beat them up too much. But still kept contents cold and ice still lasted. Can’t ask for more than that, when I’m the one dropping it.I give these as gifts, they’ve been great and a much better price than most. Kids are replaceable for a good price as well. All in all, happy", "people_count": 0, "image_usage": 0, "written_date": "March 21, 2023", "product_index": 4}, {"title": "Great water bottle", "rating": "5.0 out of 5 stars", "customer_id": "BirchyFruFru", "body": "This water bottle helps keep me on track with my water intake each day. I can put ice in it in the morning and the same ice will keep each refill nice and cold throughout the day. I really hate room temperature water so the fact it keeps the water cold is what's so major for me.", "people_count": 0, "image_usage": 0, "written_date": "March 21, 2023", "product_index": 4}], [{"title": "Good water bottle", "rating": "5.0 out of 5 stars", "customer_id": "Timi", "body": "It's a good water bottle easy to clean easy to use. And keeps my water cool for 12+ hours which is wild to me. I love it. Definitely worth the buy.", "people_count": 0, "image_usage": 1, "written_date": "April 1, 2023", "product_index": 4}, {"title": "Ready for summer", "rating": "5.0 out of 5 stars", "customer_id": "ERY04", "body": "Bought this for our 8 year old daughter who’s in cheer. She loved it and her water stays super cold - she’s ready for those Texas football games in August 🥵", "people_count": 0, "image_usage": 0, "written_date": "April 9, 2023", "product_index": 4}, {"title": "KEEPS ICE FOR DAYS", "rating": "5.0 out of 5 stars", "customer_id": "angelica", "body": "The best waterbottle for a cheap price! Stop buying these over priced waterbottles that don’t even keep you drinks cold, just because they’re trending. Iron flask is where it’s at!", "people_count": 0, "image_usage": 0, "written_date": "March 29, 2023", "product_index": 4}, {"title": "Replaced my Yeti", "rating": "4.0 out of 5 stars", "customer_id": "Kara Beth", "body": "I lost my old 36oz yeti to a U Haul, and it was the old style with a purchased straw lid ($13) and they don't make them the same anymore. I was looking for an alternative and found this, my boss had one so I decided to try it. I LOVE this bottle. It's lightweight but durable and keeps things just as cold as my yeti. It's cheaper AND comes with 3 lids at no extra cost! Idk how I slept on this bottle but I can't recommend it enough! And they're so pretty too.", "people_count": 0, "image_usage": 0, "written_date": "March 17, 2023", "product_index": 4}, {"title": "Pretty!", "rating": "5.0 out of 5 stars", "customer_id": "Jackie Scott", "body": "Hot stays hot and cold is very cold with ice added hardly melts in 24 hours. Interior cleans very easy, caps/covers are smart and versatile, my pretty favorite!", "people_count": 0, "image_usage": 0, "written_date": "April 2, 2023", "product_index": 4}, {"title": "Great flask new designs", "rating": "4.0 out of 5 stars", "customer_id": "Amazon Customer", "body": "My flask was gifted to me. In return I gifted to my daughter and two grandaughters, each a flask. My friend was told by her Dr that she needs to drink more water, she hates water. So I surprised her and sent her a flask. The confetti design was so fun. She loved it. I told her to use plenty of ice with her water, maybe some lemon or lime juice and keep the flask filled and by her side at all times. That’s what I do. Never out of arms reach. Because of the ease of use and water stays cold with the ice, I’m drinking more water and staying hydrated. So is my friend and grandaughters!", "people_count": 0, "image_usage": 0, "written_date": "March 6, 2023", "product_index": 4}, {"title": "Best water bottle", "rating": "5.0 out of 5 stars", "customer_id": "kevin jordan", "body": "I finally found the ideal insulated water bottle, the IRON flask F water bottle 22oz. It is really well made and comes with 3 different lids. One of which has a straw, a feature I was looking for. It keeps cold drinks cold and hot drinks hot. Customer service is great also.", "people_count": 0, "image_usage": 0, "written_date": "March 18, 2023", "product_index": 4}, {"title": "Mom Approved!", "rating": "5.0 out of 5 stars", "customer_id": "Effie", "body": "I got this as a gift for my mom and she loves it! She’s had it for 3 years now and it’s still her water bottle of choice. It holds her drinks cold and keeps them hot whenever she wants. It also looks super cute with stickers on them! My mom LOVES it.", "people_count": 0, "image_usage": 0, "written_date": "March 20, 2023", "product_index": 4}, {"title": "yes", "rating": "5.0 out of 5 stars", "customer_id": "Jill G", "body": "10/5. Customizable. Easy to carry. Made of real iron. Holds liquids very well. 10/5. I try selling this to everyone I know. IRON FLASK should hire me.", "people_count": 0, "image_usage": 0, "written_date": "March 31, 2023", "product_index": 4}, {"title": "Great bottle!", "rating": "5.0 out of 5 stars", "customer_id": "Amazon Customer", "body": "Great water bottle! The flow of water through the spout is great! I have the 40 oz and it is perfect! I love the three choices of lids and extra straw that come with the bottle! Bottle keeps the ice cold for days! For the price, this is a great bottle!", "people_count": 0, "image_usage": 0, "written_date": "March 19, 2023", "product_index": 4}], [{"title": "Exactly as described", "rating": "5.0 out of 5 stars", "customer_id": "KARO", "body": "I wanted a water bottle that is easy to drink from, easy to clean, and keeps water cold. This flask is the perfect fit, especially for traveling and having water close by at night. I ordered more after using the first one. I also appreciated how quickly i received the items.", "people_count": 0, "image_usage": 0, "written_date": "March 18, 2023", "product_index": 4}, {"title": "Great quality, great price.", "rating": "5.0 out of 5 stars", "customer_id": "Jiga202", "body": "Love this. Carry it around on its leash everywhere I go. Bought as Christmas presents this year and everyone loves. The only thing is I had to buy a special cup holder for it to fit in my car (Toyota Camry) but it fit in my friends car cup holder (Toyota Sienna)", "people_count": 0, "image_usage": 0, "written_date": "March 18, 2023", "product_index": 4}, {"title": "Overall happy with the flask. Seems to be keeping the temperature pretty well.", "rating": "5.0 out of 5 stars", "customer_id": "JThott", "body": "Overall happy with the flask. Seems to be keeping the temperature pretty well. I still have to figure out the best way to clean it because I use the straw with the lid, and I am not sure how I can clean the small hole on the lid more efficiently.", "people_count": 0, "image_usage": 0, "written_date": "March 21, 2023", "product_index": 4}, {"title": "This is my second bottle", "rating": "5.0 out of 5 stars", "customer_id": "JM", "body": "This is now my second purchase of this exact bottle because I lost my first one. I was happy to buy this again vs trying something new because I’m not sure I’ve ever had a better one. The only strange thing is it didn’t come with the rubber base on it like my last one, and I miss that. Otherwise, this is perfect!", "people_count": 0, "image_usage": 0, "written_date": "March 16, 2023", "product_index": 4}, {"title": "Happy, Hydrated", "rating": "5.0 out of 5 stars", "customer_id": "PT Umsted", "body": "Definitely sturdy and easy to use all around. Loved that it came with multiple cover options! Fits my cup holders in my car & peloton! Everything is almost 5 stars — but it’s a little leaky, especially if you fill it up to a certain point then put the cover on. Or if the straw is out and tips. Otherwise, good one!", "people_count": 0, "image_usage": 0, "written_date": "March 16, 2023", "product_index": 4}, {"title": "High quality. Easy to clean. Sleek design.", "rating": "5.0 out of 5 stars", "customer_id": "J.", "body": "I usually don’t write reviews, but when I stumble on a really high quality product out of nowhere I just can’t help myself. Highly recommend.", "people_count": 0, "image_usage": 0, "written_date": "April 4, 2023", "product_index": 4}, {"title": "Not to easy to clean but still worth it", "rating": "4.0 out of 5 stars", "customer_id": "Ian Bravo", "body": "Honestly, I really like this bottle, it's pretty thin so it fits in the cup holder in my car ( I bet it fits in most cars). I was looking for something made of metal or different from plastic because I hate the smell of plastic bottles after washing and washing really hard. The only two things that I don't like about this bottle it's that the lid is made of plastic, so of course it's gonna smell if you drink coffee or put some protein in your bottle, and also it the fact that is too thin is also bad because that makes it harder to clean deep your bottle. Other than that, I like the bottle, I never tried Flask ever before but I would buy from them again, maybe a bigger bottle but I'm pretty sure I would.", "people_count": 1, "image_usage": 0, "written_date": "February 17, 2023", "product_index": 4}, {"title": "Great Bottle", "rating": "5.0 out of 5 stars", "customer_id": "lindsey steiger", "body": "Keeps my water ice cold all day long while at clinical! I love this bottle so much that I have the matching coffee mug!", "people_count": 0, "image_usage": 0, "written_date": "April 5, 2023", "product_index": 4}, {"title": "5 Star Water Bottle!", "rating": "5.0 out of 5 stars", "customer_id": "Sandra B Green", "body": "This is the best water bottle I have every used. It keeps my water cold, easy to drink while driving, nice handle to hold while hiking and fits in my car's drink holder. I have tried many and this is 5 stars in my book!", "people_count": 0, "image_usage": 0, "written_date": "March 23, 2023", "product_index": 4}, {"title": "Straw lid too small", "rating": "4.0 out of 5 stars", "customer_id": "S.I. Reader", "body": "This is a great bottle. It will keep your ice without melting for hours, just put enough ice. However, the straw lid's sipping hole is extremely small. You have to work hard to get a mouthful. If you don't use this lid, no problem. However if you like to use this lid go with the Hydro Cell insulated bottles. The picture with the tiny opening is the IronFlask bottle, pink. The large opening is the Hydra Cell opening, red. Women, you can get early wrinkles around the mouth using small straws. Just saying. I love the big opening on the lids on the Hydro Cell bottles.", "people_count": 0, "image_usage": 1, "written_date": "February 28, 2023", "product_index": 4}], [{"title": "LOVE IT!", "rating": "5.0 out of 5 stars", "customer_id": "Atsila", "body": "One of the best purchases I've ever made. I've used this water bottle every day (literally) for a little over a year and it still looks and works as if it's brand new. The color hasn't faded and it hasn't dented- and I haven't exactly been gentle with it. The lids and plastic straws haven't been compromised even though I run them in the dishwasher to sanitize them. I mostly use the straw lid, but it's nice having the extra lids to use when washing the straw lid. I was worried that lugging around a half gallon by the handle would eventually strip the plastic screw pattern of the lid or break the handle, but they're still going strong. This bottle will probably last a lifetime unless I toss it off a mountain or something. I love the color choices. I'm tempted to buy a few others just for the colors even though I really don't need them. I definitely recommend Iron Flask, especially if you're an outdoorsy type. I fill mine up with ice and water and it will stay cold for many hours even when left in a hot car. These bottles would make great gifts too. Love it!", "people_count": 9, "image_usage": 1, "written_date": "January 14, 2023", "product_index": 4}, {"title": "Best water bottle you can buy", "rating": "5.0 out of 5 stars", "customer_id": "Leahhh", "body": "This bottle is 10/10. It has a great look, keeps drinks cold all day, and the straw is somehow easier to drink from than any other water bottle I’ve tried. Also love that it comes with 3 different lid options and a lifetime warranty!", "people_count": 0, "image_usage": 0, "written_date": "March 26, 2023", "product_index": 4}, {"title": "Good value", "rating": "5.0 out of 5 stars", "customer_id": "Joe", "body": "Bought this to replace a similar bottle that was more than double the cost to buy. Liquids stay cold for a long time. Wide open top makes it easy to clean. It does drip if it turned upside down with the straw opened.", "people_count": 0, "image_usage": 0, "written_date": "March 22, 2023", "product_index": 4}, {"title": "Perfect", "rating": "5.0 out of 5 stars", "customer_id": "Cole. F", "body": "Doesn't leak and easy to use, I've had it multiple months and still works the same as the day I bought it.", "people_count": 0, "image_usage": 0, "written_date": "April 2, 2023", "product_index": 4}, {"title": "Helps get your water in!", "rating": "5.0 out of 5 stars", "customer_id": "mkb", "body": "Decorated mine with stickers. Helped me get my daily water in. I carry this around every all day with me. Love it!", "people_count": 0, "image_usage": 1, "written_date": "April 2, 2023", "product_index": 4}, {"title": "Love it", "rating": "5.0 out of 5 stars", "customer_id": "Marisol Ruiz", "body": "I love my flask it’s easy to clean and has several drinking valves, leak proof and the esthetics are amazing in color", "people_count": 0, "image_usage": 0, "written_date": "March 28, 2023", "product_index": 4}, {"title": "Best Water Bottle Ever!", "rating": "5.0 out of 5 stars", "customer_id": "Traci M. Mills", "body": "This is the best water bottle I’ve ever owned. Just purchased my 2nd Iron Flask. My water stays chilled for hours during long hikes and the various tops give you lots of options. You won’t regret purchasing this product!", "people_count": 0, "image_usage": 0, "written_date": "March 23, 2023", "product_index": 4}, {"title": "Great customer service", "rating": "5.0 out of 5 stars", "customer_id": "Karina", "body": "My bottle top broke, I contacted iron flask customer service they got back to me the next morning. And a couple of days later I had the replacement in my doorstep. Super easy and efficient . They stand by their products!", "people_count": 0, "image_usage": 0, "written_date": "March 16, 2023", "product_index": 4}, {"title": "the best!", "rating": "5.0 out of 5 stars", "customer_id": "Teochi", "body": "i have an obsession with water bottles. I have so many, but this is the best one by far. i'm fangirling", "people_count": 0, "image_usage": 0, "written_date": "March 30, 2023", "product_index": 4}, {"title": "Stays cold", "rating": "5.0 out of 5 stars", "customer_id": "adriana", "body": "I love this flask, I bought this flask and also the hydro flask, both 64oz this one keeps the water colder for way longer. My wife left water sitting for a week and it was still cold! I really recommend.", "people_count": 0, "image_usage": 1, "written_date": "March 18, 2023", "product_index": 4}]]