[[{"title": "Great features, visibility not the best", "rating": "5.0 out of 5 stars", "customer_id": "developer1", "body": "This is a first impression, as I learn more, I'll add info.I chose this calculator because I needed more memories/variables for storing often-used constants for chemistry courses. It gives you the following memory/variables for quick recall/use: A,B,C,D,E,F,X,Y,M, looks like 9 memories. There are also 40 built-in scientific constants which are less easy to retrieve (shift,const then 01, 02, etc.) but might be handy (of course you can save selected ones in the memory/variables for easier access).Visibility is always an issue with calculators, both keypad glare and screen angle. Compared to a very basic TI-30Xa calculator, the Casio screen is less readable because the digits are smaller and much less contrast (blue on bluish screen vs black on white/gray for TI). As with most reflective LCD screens, including the TI, you have to get the light angle just right for maximum viewing. This is a significant problem I find because lighting varies a lot in different places. Under exam pressure, you can't afford to misread, but it can happen too easily with these screens. But the TI is easier to read - however, it is just a one-number at a time display. The Casio shows your whole formula as you type it, so for that feature you pay a price with less clarity. With the Casio, if I get the light angle best for the display, I tend to get glare on the buttons. The TI has the same issue, but the buttons are bigger and bolder and black/white, so more readable.I chose the white model Casio to see if somehow it is clearer. The numeric pad is white on gray buttons, which is pretty, but not as readable as white on black for sure. I may get the black model to see if that is clearer (actually not sure a black model is available for this exact version).My eyesight is not perfect, so this may be a non-issue for you, especially young people. I just find that the number of hours spent calculating and reading small text is a factor, so I'm trying to optimize eye strain to a minimum and evaluate study tools in that context.Otherwise, I think this Casio fx-115ES Plus is packed with a ton of powerful features and is a great value from that standpoint.Update 9/9/2022 - a feature I miss on this calculator is the \"change sign\" button, which flips the result from positive to negative or vice-versa. You can multiply by -1, but it feels cumbersome. Because this calculator enters whole expressions instead of one-number-per-operation like simple calculators, you may not have as much need for the \"change sign\" function. For me, it is natural and I often like to see partial results as I go. So if the calculation is for example: 66 / (1 - (grams / molar mass)), it is natural for me to first calculate grams / molar mass (showing me the moles of a substance), then \"Change Sign\" and add 1, then invert the answer and X 66. So \"change sign\" and \"invert\" go hand-in-hand for doing a computation \"from the inside out\" with minimum parentheses. It is also a useful skill in case you find yourself with a simple calculator on occasion. The Casio has the (-) key, but as yet I haven't found it more useful than the minus key. Maybe someone can explain it, the manual doesn't elaborate.Update: somehow I missed the \"Ans\" button next to the \"=\" key. So not a single button push, but the \"-\" button followed by the \"Ans\" button will invert the sign of your answer and you can proceed from there. Also, the Ans button is needed for taking a function of your last answer, such as log(), etc. (unlike simpler calculators where log always takes log of last calculation). And \"alpha\" \"Ans\" will get you the \"pre-answer\", the answer before the last answer. So there is a two-memory stack at work for the answers.Update: another real weakness of this calculator is there is no (that I know of) quick way to change from fixed point to scientific notation. This is standard on many very basic scientific calculators. You can go through a cumbersome mode shift with shift keys, selecting precision, yada, but a single dedicated key is what is needed. If you have .00612 and want to quickly see it as 6.12x10^-3 or vice versa -- forget it. I think that is a serious omission, and hopefully there is another brand out there with that useful key for my next calcluator. Too bad.", "people_count": 8, "image_usage": 0, "written_date": "September 5, 2022", "product_index": 9}, {"title": "good but also quality", "rating": "5.0 out of 5 stars", "customer_id": "Nitsan Simantov", "body": "look now im not a math mortician or a brain learnerim just a simple farm boy from west verginiabut Ill tell you what this calcurator is the bees kneesyou can do numbers plus numbers . and you can do numbers minus numbers . and then you can press equelyou can see the numbers good on the monitor . I dont think its OLED 🤔maybe Mini Q OLED? . its very small 🤔i really love the colors . white ish grey . very nice . that is why I buy thisi'ts very stylish but there is no wrist strap like my purple casio 😠 WHYYYYYYYYYif you press 1358008 and look upside down then the monitor will say a funny wordyou can not make phone call with this . the sim card slot does not fitI think maybe it have only wifi but I can not connect WHYYYYYYYYYthe device feel good in the hands . light but qualityit's definitely quality and worth goodthe monitor is easy to eye listen . i forgot the word of what you do with eyes when you want see somethingfor best clarity turn down contrast a bit . press:onshiftmodedown arrow8adjust left right like you wantsolar works good . better then apple iWatch that have no solar! .also has backup battery . but its not lithium ironlet me tell you just go ahead and go ahead and go ahead and go ahead and go ahead and get this from your amazonwith this calcurator you will not be a disappointment to your fanilyI'ts also good cat toypiece! ✌️", "people_count": 1, "image_usage": 1, "written_date": "March 24, 2023", "product_index": 9}, {"title": "Lot's of Capability for the Cost", "rating": "5.0 out of 5 stars", "customer_id": "D. White", "body": "I've been using this calculator for several years now. I teach chemistry at my local community college, and I always recommend this one for its ease of use and convenient fraction entry capability. You just have to get used to the fact that, when in math mode, if the calculated answer can be expressed as rational number ( an exact number in fraction form) it will first show that number. To get the decimal equivalent, you need only press one key that toggles between the formats. You can spend a lot more money on a scientific calculator, but you don't get that much of a boost for the money in terms of everyday numerical calculations, including integrals. Highly recommended.", "people_count": 0, "image_usage": 0, "written_date": "March 24, 2023", "product_index": 9}, {"title": "Excellent calculator!", "rating": "5.0 out of 5 stars", "customer_id": "Dennis", "body": "I am forced to use this calculator for my Fundamentals of Engineering exam. I was not thrilled with the idea of using a calculator as I have never seen any professional using one in their daily life (Excel is a thing afterall).But after using it while reviewing, I have to say its really not bad at all! It has so many features and small quality of life improvements over other calculators I’ve used. I still don’t see myself using it for anything else other than the exam, but it really is a great calculator.", "people_count": 0, "image_usage": 0, "written_date": "April 5, 2023", "product_index": 9}, {"title": "I use it every day!", "rating": "5.0 out of 5 stars", "customer_id": "William", "body": "Simple to use and very helpful to my Pre-Calculus class!", "people_count": 0, "image_usage": 0, "written_date": "April 7, 2023", "product_index": 9}, {"title": "Got me through electrical FE and PE", "rating": "5.0 out of 5 stars", "customer_id": "Jason", "body": "Hands down best calculator for the engineering tests. The phasor calculations for power tests really save you time and effort. Best calculator for these 2 tests", "people_count": 0, "image_usage": 0, "written_date": "March 23, 2023", "product_index": 9}, {"title": "A calculating calculator.", "rating": "5.0 out of 5 stars", "customer_id": "Lucy S", "body": "I love this one and returned the others, great for college level math and science courses. Acceptable to use while testing in California.", "people_count": 0, "image_usage": 0, "written_date": "March 21, 2023", "product_index": 9}, {"title": "Good for Engineers", "rating": "5.0 out of 5 stars", "customer_id": "Deepika Pandit", "body": "As a civil engineer, I think this is the one of the best calculators to buy as it can be used for any engineering exams.", "people_count": 1, "image_usage": 0, "written_date": "March 18, 2023", "product_index": 9}, {"title": "Helped so much", "rating": "5.0 out of 5 stars", "customer_id": "Charlotte Eszlinger", "body": "Definitely recommend", "people_count": 0, "image_usage": 0, "written_date": "March 24, 2023", "product_index": 9}, {"title": "Great for electrical engineering!", "rating": "4.0 out of 5 stars", "customer_id": "Abigail", "body": "I love the polar and rectangular conversons on this calculator. The white color is cute!", "people_count": 0, "image_usage": 0, "written_date": "March 12, 2023", "product_index": 9}], [{"title": "Perfect", "rating": "5.0 out of 5 stars", "customer_id": "Ebuka", "body": "Great calculator", "people_count": 0, "image_usage": 0, "written_date": "March 22, 2023", "product_index": 9}, {"title": "Consider this before buying a graphing calculator", "rating": "5.0 out of 5 stars", "customer_id": "SirGawain", "body": "Individual needs will vary; you're the best judge for your situation. But, if you're unsure which calculator to buy for typical math and science courses, go with this one first. Hold off on buying a graphing calculator, like a TI-84 Plus CE, until it's clear that you'll actually use it.Why? -- most courses and exams don't restrict the use of scientific calculators; user-friendly graphing software is available online [desmos, wolframalpha, etc]; and, at it's lowest point, the TI-84 CE Plus is about $100 USD new, whereas this fx-115 ES Plus 2 hovers around $15 new.If you end up needing something like a HP Prime or TI-89 later down the road, you'll have saved $100 by not buying a TI-84. (Though, even at that point, you could argue for learning python or another language to accomplish the same tasks on your pc.)You may struggle to see the screen a bit, but this calculator is a workhorse and has the functionality you'll need for your exams and day to day.", "people_count": 2, "image_usage": 0, "written_date": "December 20, 2022", "product_index": 9}, {"title": "great calculator", "rating": "5.0 out of 5 stars", "customer_id": "maha", "body": "I recommend this", "people_count": 0, "image_usage": 0, "written_date": "March 12, 2023", "product_index": 9}, {"title": "10 stars calculator", "rating": "5.0 out of 5 stars", "customer_id": "Juanpi", "body": "Amazing fir college math. Easy to use. For the price it is an amazing item", "people_count": 0, "image_usage": 0, "written_date": "February 21, 2023", "product_index": 9}, {"title": "Excelente", "rating": "5.0 out of 5 stars", "customer_id": "Mhidalgo", "body": "Excelente inversión, muy buena para ingeniería álgebra y estadística", "people_count": 0, "image_usage": 0, "written_date": "February 21, 2023", "product_index": 9}, {"title": "Nice produce", "rating": "4.0 out of 5 stars", "customer_id": "Cyprus sun boy", "body": "Casio calculator fx115es plus is not the easiest to learn on , but, it is the most powerful calculator out there for the money ..", "people_count": 1, "image_usage": 0, "written_date": "January 24, 2023", "product_index": 9}, {"title": "la mejor calculadora casio calidad-precio", "rating": "5.0 out of 5 stars", "customer_id": "rami f.", "body": "Una cientifica gama media para estudiantes de segundaria y universidad.Cuenta con una lista de constantes y conversaciones mas utilizados en fisica y quimica.Precio justo, calidad excelente.Muy recomendable.", "people_count": 0, "image_usage": 0, "written_date": "January 26, 2023", "product_index": 9}, {"title": "Remember to turn off the fractional display and this is a nice calculator.", "rating": "4.0 out of 5 stars", "customer_id": "superchk", "body": "Nice calculator with a clear display and interesting color scheme to make it more decorative/interesting to use. The one thing about it and this is my first Casio so I didn't expect this, is that it starts in a weird mode where all fractions (floats) are displayed as fractions. This includes large fractions that are not very useful/usable such as 37/95. I had to watch a youtube video to resolve this problem as the instructions were not very helpful. There is a button that one can push that converts from decimals to fractions and back again at will. Once I discovered that, I had no problem using the calculator.", "people_count": 2, "image_usage": 0, "written_date": "October 31, 2022", "product_index": 9}, {"title": "Works well", "rating": "5.0 out of 5 stars", "customer_id": "Nelly", "body": "Very helpful and no issues", "people_count": 0, "image_usage": 0, "written_date": "February 6, 2023", "product_index": 9}, {"title": "Bang-for-buck champion of the calculator world!", "rating": "5.0 out of 5 stars", "customer_id": "Captain Bourbon", "body": "The bang-for-buck on this thing is crazy high. It does an astounding number of things for about $15, and is super easy to learn too. Get one!", "people_count": 0, "image_usage": 0, "written_date": "January 17, 2023", "product_index": 9}], [{"title": "History is lost every power cycle - not best choice for engineering.", "rating": "3.0 out of 5 stars", "customer_id": "Another_Tech_Geek", "body": "Deal-breaker first: this calculator forgets its entire history every time it is powered off or the mode is changed. The only thing it remembers is the last answer it gave and things you have specifically stored in memory.It automatically turns off after \"about 6 minutes\" (per the manual) and you cant change this timeout periodPI is a two button sequence between far ends of the keypad.There is also no engineering notation display mode and the ENG button will have to be pressed to convert each answer to engineering notation (I believe this is a \"casio thing\" and not a gripe particular to this model).The rest of the calculator works awesome and I like that it's a little smaller, lighter, and thinner than the Ti-36XPro.Ultimately though, for just a few dollars more, I cannot recommend this over the Ti-36XPro unless the size difference makes or breaks it for you.", "people_count": 0, "image_usage": 0, "written_date": "January 28, 2023", "product_index": 9}, {"title": "Good calculator", "rating": "4.0 out of 5 stars", "customer_id": "saniya", "body": "I like this calculator it was good for my college class. I was a little confused at the beginning to change fractions to a decimal but than i got it", "people_count": 0, "image_usage": 0, "written_date": "December 4, 2022", "product_index": 9}, {"title": "NA", "rating": "5.0 out of 5 stars", "customer_id": "Ramiro Lorio", "body": "Excelente equipo", "people_count": 0, "image_usage": 0, "written_date": "January 30, 2023", "product_index": 9}, {"title": "Thought I bought the wrong one 🥲", "rating": "4.0 out of 5 stars", "customer_id": "Galy P.", "body": "I’ve been able to use this calculator for Al most 3 months perfectly but I thought I bought the wrong one and I did I could have returned it but needed it for class for the next couple weeks so I couldn’t so I looked up how to stop making it simplify my equations in fractions and it was able to switch it from fractions to decimals so I’m happy.", "people_count": 1, "image_usage": 0, "written_date": "September 27, 2022", "product_index": 9}, {"title": "Best calculator I've owned", "rating": "5.0 out of 5 stars", "customer_id": "Amazonian", "body": "Need a calculator for any math class buy this one. Not able to use as graphing calculator and not sure if it works for stats. Works for everything else", "people_count": 1, "image_usage": 0, "written_date": "December 28, 2022", "product_index": 9}, {"title": "Regrettably ungainly in one special use.", "rating": "4.0 out of 5 stars", "customer_id": "TheAmatuer", "body": "I needed to replace an old Sci/Eng calculator which I often used for metric conversions. On receiving this Casio fx-115-ESP2 I attempted feet-to-meters & found that I needed to remember a 2-digit code to identify which of 44 conversions (22 * 2-ways) I wanted to execute. Ridiculous. Although these codes are printed on the inside of the sliding cover; they are in a -TINY- font which requires both sharp eyes & bright light to read, after first sliding off the cover. I'd rather reach for my tablet or phone to do the conversion. Given this usability failure I re-boxed & returned it.(Oddly, another selection function on this calc uses paged lists to help select the proper item, but metric conversions don't have this option. Any argument that the id numbers are used in programming sequences is entirely without merit. There is an similar Sharp calculator for which it's manual describes a paged conversions selection option.)", "people_count": 0, "image_usage": 0, "written_date": "April 2, 2022", "product_index": 9}, {"title": "calculator for chem", "rating": "5.0 out of 5 stars", "customer_id": "user", "body": "Bought this for my chemistry class since we can not use programable calculators and this is defintly the best price for the best product. It has all the. Conversion you would need and it is extremely easy to use. If you need help with converting it from fraction to decimal just press the S<->D button it is right above the del (delete) button. so far that was the only issue I had and it was resolved.", "people_count": 3, "image_usage": 0, "written_date": "September 10, 2022", "product_index": 9}, {"title": "Exactly what I needed!", "rating": "5.0 out of 5 stars", "customer_id": "Lindsay Kent", "body": "I needed this calculator for my college Algebra class, and it has got me through well. Came quickly, no issues!", "people_count": 0, "image_usage": 0, "written_date": "December 1, 2022", "product_index": 9}, {"title": "Buen producto", "rating": "5.0 out of 5 stars", "customer_id": "Juliana Bustamante P.", "body": "La calculadora es buena yligera!", "people_count": 0, "image_usage": 0, "written_date": "December 17, 2022", "product_index": 9}, {"title": "It's a steal", "rating": "4.0 out of 5 stars", "customer_id": "Sam", "body": "Really does the job well. Highly worth it for the price.", "people_count": 0, "image_usage": 0, "written_date": "September 18, 2022", "product_index": 9}], [{"title": "Would recommend", "rating": "5.0 out of 5 stars", "customer_id": "Lawrence leitman", "body": "Quick and easy to use. Good for high school students.", "people_count": 0, "image_usage": 0, "written_date": "November 30, 2022", "product_index": 9}, {"title": "My calculator is not laying flat on the table and clicking while I'm ysing it.", "rating": "3.0 out of 5 stars", "customer_id": "Oleksiy Yefremenko", "body": "Good convenient calculator. Operation is bit unusual, comparing to more simple and old models.The only this frustrates me is thing plastic used for calculator case and its not even made flat. I would wish also more contrast digits signs. My calculator is white and has light gray buttons with white digits on them. When you are not under bright light conditions, white digits hard to see on top of grey buttons. Also hard to read button second function, which is printed on the case above the button.", "people_count": 0, "image_usage": 0, "written_date": "November 17, 2022", "product_index": 9}, {"title": "Excelent!!!!! We love it", "rating": "5.0 out of 5 stars", "customer_id": "Tixi L.", "body": "Is useful, good quality, it arrives on time,", "people_count": 0, "image_usage": 0, "written_date": "November 3, 2022", "product_index": 9}, {"title": "Excelente", "rating": "5.0 out of 5 stars", "customer_id": "EAC", "body": "Excelente producto", "people_count": 0, "image_usage": 0, "written_date": "November 14, 2022", "product_index": 9}, {"title": "Pretty good", "rating": "5.0 out of 5 stars", "customer_id": "Alijah", "body": "It’s a good calculator, no complaints takes a while to figure out all the buttons tho", "people_count": 0, "image_usage": 0, "written_date": "October 5, 2022", "product_index": 9}, {"title": "Resistance and durability", "rating": "5.0 out of 5 stars", "customer_id": "Sofia Vasquez", "body": "Yes it’s a bit dirty because I got this months ago for my trig and chem class, I am a college student currently attending chaffey and well some professors don’t let you use graphic calculators so therefore this buy was necessary and totally worth the money. It works perfectly fine, does more than I expected! You do have to make sure to do some operations first when using cos, sin. The usual and also you do have to close parenthesis but trust me this is super helpful!", "people_count": 2, "image_usage": 1, "written_date": "April 11, 2022", "product_index": 9}, {"title": "cool", "rating": "5.0 out of 5 stars", "customer_id": "sanai", "body": "", "people_count": 0, "image_usage": 0, "written_date": "November 21, 2022", "product_index": 9}, {"title": "Great for Engineering FE Preparation", "rating": "5.0 out of 5 stars", "customer_id": "Sarah Boisvert", "body": "I bought this calculator to use for school and for the Fundamentals of Engineering exam. It works great and the only issue I had with it was that the 2 button was placed in my calculator upside down. The button still works though, so it was a funny little mistake!", "people_count": 0, "image_usage": 0, "written_date": "July 5, 2022", "product_index": 9}, {"title": "Needed for high school", "rating": "5.0 out of 5 stars", "customer_id": "Shezzabeast", "body": "This was one of my son school requirements so it was very cheap and it does the job plus some!", "people_count": 0, "image_usage": 0, "written_date": "September 8, 2022", "product_index": 9}, {"title": "Tremendous value for the engineering student", "rating": "5.0 out of 5 stars", "customer_id": "Amazon Customer", "body": "This calculator has excellent functionality at a student friendly budget price point. One of the most useful functions for the engineering student is the ability to do calculations with imaginary numbers in both rectangular and polar form. The equation solver is also very helpful, with the ability to compute up to 3 variables. Also, there are a large assortment of constants that come with the calculator. You can also compute first derivatives and definite integrals. It also has a nice assortment of statistical functions: std deviation, cumulative distribution function, etc. Lastly, the inputting of computations is more intuitive compared to most of the Texas Instruments calculators, and at 1/4 the cost. A great educational investment!", "people_count": 4, "image_usage": 0, "written_date": "December 24, 2021", "product_index": 9}], [{"title": "Gets the job done", "rating": "5.0 out of 5 stars", "customer_id": "Danielle Nanguang", "body": "Video Player is loading.", "people_count": 7, "image_usage": 0, "written_date": "February 9, 2022", "product_index": 9}, {"title": "There's a function to find the roots of a quadratic equation", "rating": "5.0 out of 5 stars", "customer_id": "Aby Kuriakose", "body": "There is a function that allows you to find the roots of a quadratic equation (look this calc up on yt). People always say get a graphing calculator for this function but this scientific one has it. My only complain is that the numbers are a little hard to see but that's not that big of an issue.", "people_count": 1, "image_usage": 0, "written_date": "May 28, 2022", "product_index": 9}, {"title": "Retire your HP 35s and get real! FE Exam Preparation Tool", "rating": "5.0 out of 5 stars", "customer_id": "ALF@11kft", "body": "\"Plain english or math formula entry\" makes calculations amazingly straight forward. 1 button conversion from fraction to decimal. Stats, factorials, small matrices, etc. For $15??? Apologies for geeking out, but Casio should charge 10 times the street/Amazon price for this. I love HP, but this Casio model has easily owned them.", "people_count": 0, "image_usage": 0, "written_date": "May 27, 2022", "product_index": 9}, {"title": "Great features. Test approved.", "rating": "5.0 out of 5 stars", "customer_id": "GG", "body": "Amazing scientific calculator with great features. Some of the buttons aren't intuitively laid out in my opinion but easy enough to Google. Approved for engineering classes and exams.", "people_count": 0, "image_usage": 0, "written_date": "August 7, 2022", "product_index": 9}, {"title": "Used it for class", "rating": "5.0 out of 5 stars", "customer_id": "Amanda Fernandez", "body": "Easy to read and understand, pretty solid overall.", "people_count": 0, "image_usage": 0, "written_date": "September 22, 2022", "product_index": 9}, {"title": "Great all around", "rating": "5.0 out of 5 stars", "customer_id": "David", "body": "Great calc an d easy to learn", "people_count": 0, "image_usage": 0, "written_date": "September 9, 2022", "product_index": 9}, {"title": "Gets the job done!", "rating": "4.0 out of 5 stars", "customer_id": "Adrienne", "body": "Honestly, a really nice calculator! Gets the job done, I just wish the screen would light up due to me working on homework in the dark.", "people_count": 0, "image_usage": 0, "written_date": "March 30, 2022", "product_index": 9}, {"title": "Good for programming and base conversions", "rating": "4.0 out of 5 stars", "customer_id": "Sergio.Rea", "body": "I needed an easy way to convert numbers between decimal, hexadecimal and binary bases while programming but didn’t want to keep opening the Windows calculator app. So this little calculator made it easy for me. Now I keep it on the side while working on my microcontrollers. It’s simple, cheap and easy to use.", "people_count": 2, "image_usage": 0, "written_date": "December 15, 2021", "product_index": 9}, {"title": "Great Scientific Calculator", "rating": "5.0 out of 5 stars", "customer_id": "A. Keleher", "body": "This is my favorite calculator, I bought it for a probability and statistics class. It's perfect, loved the display. Casio is a great company, I've owned a few watches made by Casio and their calculators are just as good", "people_count": 0, "image_usage": 0, "written_date": "May 23, 2022", "product_index": 9}, {"title": "My son love it", "rating": "5.0 out of 5 stars", "customer_id": "alicia mcintosh", "body": "My son love it", "people_count": 0, "image_usage": 0, "written_date": "August 29, 2022", "product_index": 9}], [{"title": "Remarkably Heat-resistant", "rating": "5.0 out of 5 stars", "customer_id": "Abigail", "body": "Shoved the Casio fx-115ES Plus Scientific Calculator along with papers and handful of pens in an oven one day to make kitchen counter appear tidy to visitors. Weeks later, forgetting that such papers, pens, and calculator ever existed, I preheat the oven to 350°. I open the oven door after pre-heat to find the paper singed, the pens soft, but the Casio fx-115ES Plus Scientific Calculator survives, hard to the touch, still able to flawlessly compute trigonometric functions. The photo is taken today, weeks after the ordeal with the pre-heating oven.I do not condone or recommend ever placing a calculator in any oven, ever. But know that if you happen to, the Casio fx-115ES Plus Scientific Calculator may be your best bet.", "people_count": 102, "image_usage": 1, "written_date": "April 21, 2021", "product_index": 9}, {"title": "Works great", "rating": "5.0 out of 5 stars", "customer_id": "Tammy Chapman", "body": "Works great", "people_count": 1, "image_usage": 0, "written_date": "August 31, 2022", "product_index": 9}, {"title": "Really the best out there.", "rating": "5.0 out of 5 stars", "customer_id": "Jeff Cannon", "body": "This is a fantastic calculator. It does everything the average user would need. I am a Land Surveyor and Drafter and it's perfect. Not too overly complicated like a graphing calculator would be. This calculator is not allowed on California State tests but that's literally the only downside (and seriously, how often would that even be an issue?).The feel is great, the numeric buttons are decent size as to help avoid fat thumbing, and it's best feature EVER - the DEL button which every single calculator should be required to have.And the price? AMAZING. This really should be a $30+ calculator. It is PERFECT in my opinion and you will not regret it.", "people_count": 16, "image_usage": 0, "written_date": "December 17, 2020", "product_index": 9}, {"title": "Screen is too dark to read", "rating": "3.0 out of 5 stars", "customer_id": "Fahad ahammed", "body": "Screen is too Dark to Read", "people_count": 0, "image_usage": 0, "written_date": "October 15, 2022", "product_index": 9}, {"title": "awesome calculator!", "rating": "5.0 out of 5 stars", "customer_id": "kelly", "body": "it's a bit different than your typical high school math class calculator, but my math teacher still approved of this one! it can give you either decimal answers, fraction answers, or square root answers depending on what buttons you press!", "people_count": 0, "image_usage": 0, "written_date": "March 20, 2022", "product_index": 9}, {"title": "Math and stuff", "rating": "5.0 out of 5 stars", "customer_id": "Sam", "body": "Calculator time, time to calculate", "people_count": 0, "image_usage": 0, "written_date": "July 31, 2022", "product_index": 9}, {"title": "Fully featured calculator", "rating": "4.0 out of 5 stars", "customer_id": "Samir Shah", "body": "Kids love using this calculator with intuitive display showing calculations like you would do on paper. It is feature rich though cryptic to change mode etc. You need a bit of practice and cheat sheet handy if you are a power user. The display looks great, though it's a bit slower to render than our old faithful previous Casio scientific calculator that lasted for ~20 years. Casio upgrading to a faster processor/graphic processing would help. Great price to get the brand we trust the most for the calculator!", "people_count": 5, "image_usage": 0, "written_date": "March 21, 2021", "product_index": 9}, {"title": "Good purchase", "rating": "5.0 out of 5 stars", "customer_id": "Chantel", "body": "Works perfectly...easy to use.", "people_count": 0, "image_usage": 0, "written_date": "August 3, 2022", "product_index": 9}, {"title": "Great Calculator", "rating": "5.0 out of 5 stars", "customer_id": "Merandy", "body": "I lost my previous calculator of the same model and I had no hesitation in buying this again. I had used the previous calculator for more than 5+ years. This new version has the same features and I expect this will last long as well. Very easy to use and I heavily use the built-in quadratic equation function, constants, and conversions. It is a simple calculator with many great functions.", "people_count": 0, "image_usage": 0, "written_date": "November 28, 2021", "product_index": 9}, {"title": "Carried me through trigonometry", "rating": "5.0 out of 5 stars", "customer_id": "Anonomyous", "body": "Easy to use, values popped right out, perfect for trigonometry.", "people_count": 0, "image_usage": 0, "written_date": "July 1, 2022", "product_index": 9}], [{"title": "Hard to figure out at first.", "rating": "5.0 out of 5 stars", "customer_id": "jumbled_journi", "body": "It was a little hard to figure out at first (like how to get decimal answers, etc.) but now that I feel comfortable using it, I really like this calculator. I'm in an easier college math class and my professor suggested a basic scientific calculator. While this one feels more than 'basic,' it gets the job done and I really like the new design, too.", "people_count": 1, "image_usage": 0, "written_date": "October 1, 2021", "product_index": 9}, {"title": "Llego a tiempo y en buenas condiciones", "rating": "5.0 out of 5 stars", "customer_id": "Edward Walls", "body": "Si cumple las funciones especificadas, gracias 🙂", "people_count": 0, "image_usage": 0, "written_date": "June 21, 2022", "product_index": 9}, {"title": "Great for Chem 1110", "rating": "5.0 out of 5 stars", "customer_id": "Amazon Customer", "body": "Was perfect for my Chem 1110 class", "people_count": 0, "image_usage": 0, "written_date": "June 16, 2022", "product_index": 9}, {"title": "Easy to use and so cute!", "rating": "5.0 out of 5 stars", "customer_id": "CK", "body": "I use this for college algebra and calculus! I love the colors and design of the calculator. I’m not usually great with calculators but this one is so easy to use. Good price too.", "people_count": 0, "image_usage": 0, "written_date": "February 10, 2022", "product_index": 9}, {"title": "Best deal. Cost more everywhere else", "rating": "5.0 out of 5 stars", "customer_id": "Imani Curtis", "body": "These calculators take time to learn how to use but it's what I needed for my Algebra class and it works fine. Cheapest you'll find it.", "people_count": 1, "image_usage": 0, "written_date": "March 8, 2022", "product_index": 9}, {"title": "Not the product I wanted", "rating": "2.0 out of 5 stars", "customer_id": "Dennis D.", "body": "I wanted the hyper scientific calculator, so now I'll have learn to use this, sure hope I can find the info easily", "people_count": 0, "image_usage": 0, "written_date": "January 1, 2023", "product_index": 9}, {"title": "Has good instructions to learn to use calculator", "rating": "5.0 out of 5 stars", "customer_id": "Joni", "body": "This has been so helpful in math!! It has good instructions that make it easy to learn how to use", "people_count": 0, "image_usage": 0, "written_date": "March 23, 2022", "product_index": 9}, {"title": "Excellent", "rating": "5.0 out of 5 stars", "customer_id": "Patricia M. Santiago", "body": "Amazing product for your money. Meets my high schoolers every need for classes! High recommend. Price is reasonable.", "people_count": 0, "image_usage": 0, "written_date": "March 30, 2022", "product_index": 9}, {"title": "excelente producto", "rating": "5.0 out of 5 stars", "customer_id": "Daniel", "body": "excelente calculadora, recomendable para usar hasta en la Universidad, cuenta con todas las funciones que pudieras necesitar, de un tamaño agradable, sin desperdicio, recomendable.", "people_count": 0, "image_usage": 0, "written_date": "March 5, 2022", "product_index": 9}, {"title": "LOVE!", "rating": "5.0 out of 5 stars", "customer_id": "A.F", "body": "I’m currently taking intro to Statistics and it has all the features I’ve needed so far. Very cute design too!I would definitely purchase again if needed.", "people_count": 0, "image_usage": 0, "written_date": "February 14, 2022", "product_index": 9}], [{"title": "JUST AS GOOD AS 1ST GEN", "rating": "5.0 out of 5 stars", "customer_id": "Drum 247", "body": "Excellent scientific calculator$15.99 regardless of its low price it is the bestThere are YouTube videos out on this calculator watch a fewimho this is the best you can get and an excellent priceHIGHLY RECOMMENDED", "people_count": 0, "image_usage": 0, "written_date": "December 11, 2021", "product_index": 9}, {"title": "Updated appearance, otherwise same as previous model", "rating": "5.0 out of 5 stars", "customer_id": "Steven", "body": "The 2nd edition of the fx-115ES Plus does away with the purple-highlighted curvy body and replaces it with a clean sleek white look. Otherwise it's essentially the same calculator, with the same screen resolution, features and speed. I was hoping for something new, but all they gave us was a new \"Mode 0\" which gives a QR code for an authenticity check (but not for any other purpose like with the fx-991EX) and a slightly more legible Mode screen.Both 1st and 2nd editions are basically the same great calculator, so shop on price and which appearance you prefer.", "people_count": 39, "image_usage": 0, "written_date": "June 10, 2020", "product_index": 9}, {"title": "It's weird to really like a calculator, but I really like this calculator.", "rating": "5.0 out of 5 stars", "customer_id": "Nuclear Powered Finger Puppet", "body": "I'm just a bad math student. The engineering department at my school uses these, and I bought one after the math department required a TI-84 that I literally never used. The quality of this calculator kind of made me angry because the TI stuff is just... worse. It's not about the functionality. That varies based on what your needs are. It's the buttons, the contrast of the display, etc. It's just pleasant to use.", "people_count": 26, "image_usage": 0, "written_date": "January 3, 2021", "product_index": 9}, {"title": "The same functionality", "rating": "5.0 out of 5 stars", "customer_id": "Jason B.", "body": "This calculator has all the same functionality as its predecessor but in a new design. I can't see a difference between the old and the new with the exception of some basic improvements on the design. It's not faster, it's not better in my honest opinion.", "people_count": 0, "image_usage": 0, "written_date": "October 16, 2021", "product_index": 9}, {"title": "Affordable Calculator for Students", "rating": "5.0 out of 5 stars", "customer_id": "Tan Panda", "body": "This is perhaps the best value calculator you can get. Shows you fraction, complex fraction, and decimals. You can also set up equations for repetitive calculation. It can also do matrix. Just read the manual to find out what else it can do.", "people_count": 0, "image_usage": 0, "written_date": "October 16, 2021", "product_index": 9}, {"title": "casio fx 115splus2", "rating": "4.0 out of 5 stars", "customer_id": "latti", "body": "gift to my granddaughter", "people_count": 0, "image_usage": 0, "written_date": "November 20, 2021", "product_index": 9}, {"title": "Cumple exactamente con lo que ofrece, producto original", "rating": "5.0 out of 5 stars", "customer_id": "Jorge", "body": "Cumple exactamente con lo que ofrece, producto original", "people_count": 0, "image_usage": 1, "written_date": "April 4, 2022", "product_index": 9}, {"title": "If you can't use a graphing calculator, get this one.", "rating": "5.0 out of 5 stars", "customer_id": "Evelyn Coleman", "body": "This calculator is amazing. I needed a calculator that wasn't a graphing calculator for my college Algebra class.This one is easy to use a lot of the heavy lifting for you. Take your time to go through the very short manual so you can switch back and forth between getting decimal answers and getting fractions.", "people_count": 4, "image_usage": 0, "written_date": "April 2, 2021", "product_index": 9}, {"title": "I Love this Calculator!", "rating": "5.0 out of 5 stars", "customer_id": "Alex", "body": "I already have gotten much use from this calculator, and I think it will come in handy for my college work.", "people_count": 0, "image_usage": 1, "written_date": "January 21, 2022", "product_index": 9}, {"title": "Easy to use/learn", "rating": "5.0 out of 5 stars", "customer_id": "D. Vaughn", "body": "I bought this to do fractions. It has easy to follow instructions, I carry with me every where I go.", "people_count": 0, "image_usage": 0, "written_date": "January 24, 2022", "product_index": 9}], [{"title": "Very good", "rating": "5.0 out of 5 stars", "customer_id": "MD", "body": "As expected. Very good.", "people_count": 0, "image_usage": 0, "written_date": "April 18, 2022", "product_index": 9}, {"title": "neat calculator", "rating": "5.0 out of 5 stars", "customer_id": "gamer", "body": "works intuitively.", "people_count": 0, "image_usage": 0, "written_date": "April 29, 2022", "product_index": 9}, {"title": "Good", "rating": "5.0 out of 5 stars", "customer_id": "nabil kherib", "body": "Good 👍", "people_count": 0, "image_usage": 0, "written_date": "April 26, 2022", "product_index": 9}, {"title": "It is very nice.", "rating": "5.0 out of 5 stars", "customer_id": "Jayden C.", "body": "I used it for trig.", "people_count": 0, "image_usage": 0, "written_date": "March 25, 2022", "product_index": 9}, {"title": "N/A", "rating": "5.0 out of 5 stars", "customer_id": "Daniel holder", "body": "Works as intended.", "people_count": 0, "image_usage": 0, "written_date": "April 6, 2022", "product_index": 9}, {"title": "Best with this price", "rating": "5.0 out of 5 stars", "customer_id": "Iman Dabbaghchian", "body": "I searched for weeks before buying this and after a semester I can say this is the best calculator you can buy in this range of money.", "people_count": 0, "image_usage": 0, "written_date": "November 30, 2021", "product_index": 9}, {"title": "Me encanta", "rating": "5.0 out of 5 stars", "customer_id": "Michelle Maldonado Mendez", "body": "Siento que tengo la calculadora más cara del mundo aunque pagué muy poco por ella, buen material y funciona a la perfección.", "people_count": 0, "image_usage": 0, "written_date": "December 15, 2021", "product_index": 9}, {"title": "It’s giving dollar store", "rating": "2.0 out of 5 stars", "customer_id": "cmxp", "body": "I used this for 1.5 weeks before calling it quits. It’s physically TOO light, (I suppose tech efficiency is the culprit, no more bulky chips and such) but there should be some type of mechanism to keep it sturdy when barely bumping it or just punching in numbers. The keys were also unnecessarily tall. Ick.", "people_count": 0, "image_usage": 0, "written_date": "July 24, 2022", "product_index": 9}, {"title": "Good", "rating": "5.0 out of 5 stars", "customer_id": "S K", "body": "Good", "people_count": 0, "image_usage": 0, "written_date": "March 20, 2022", "product_index": 9}, {"title": "This is a great calculator.", "rating": "5.0 out of 5 stars", "customer_id": "Michael Smith", "body": "This calculator does it all. It’s not a graphing calculator, but it can calculate everything that you would find in a course of study at a university. It’s cheap and made by a well know brand. It comes with a user manual and I can use it for virtually everything I do when it come to mathematics.", "people_count": 1, "image_usage": 0, "written_date": "September 26, 2020", "product_index": 9}]]