[[{"title": "Great wide angle webcam, audio is just ok, +1 for physical privacy guard", "rating": "4.0 out of 5 stars", "customer_id": "andyrblank", "body": "First of all the picture quality is great on this camera and it's performed well on one Zoom call so far. It's a very wide angle so it gets a lot of the room in the frame too.If you don't like that the wide angle includes a lot of the room in the frame another cool feature of this webcam is the free software from their website which allows you to zoom the camera up on where you want the frame to be along with a bunch of color and exposure options.The microphone is the only downside about this camera I've found so far. In Windows it lists it as a \"1 channel 16 bit 16,000 Hz (Tape Recorder Quality)\" microphone. When I recorded and played back some audio in the Windows camera app it doesn't sound great either. Kind of like a muffled sound talking through an old telephone. For zoom calls it works though and for now it will keep me from adding another cord for a microphone.I really do appreciate that this camera comes with a physical privacy guard and lights to indicate when the camera is plugged in (red) and active (green). With devices that are always connected to the internet it's better to be safe than sorry and a physical control is something that no one can control over the internet.That being said I'd still like to see a physical switch for the microphone in the future.", "people_count": 3, "image_usage": 1, "written_date": "April 12, 2023", "product_index": 0}, {"title": "Nice camera", "rating": "5.0 out of 5 stars", "customer_id": "Serena C.", "body": "I am using this for gaming purposes. Namely speaking for Discord and Twitch streaming. I received the camera in a small box. Came with a manual, the camera itself that has a USB cord, and the privacy protector. Camera looks very pretty and sleek. The attached USB cord is approximately a little more than 3ft long, which is a good length. The privacy protector has a sticky side where you can stick onto the top of the camera as shown in my pictures. Video quality is a lot better than I expected, so it was a plus! I haven't used the mic yet, but it sounded good during my testing. I will update once I get a few uses out of it.", "people_count": 4, "image_usage": 1, "written_date": "April 9, 2023", "product_index": 0}, {"title": "Great for the price", "rating": "4.0 out of 5 stars", "customer_id": "WhiskeyMan", "body": "This webcam is very nice for the price. Its not as good as the name brand ones that cost much more, but that's sort of the point. I didn't need a bunch of fancy features or perfectly undistorted video - just needed a quality webcam that works well every time I plug it in and fire up a video call. This unit is perfect for the average user and is easily recommend it to others looking for an option at a more affordable price.", "people_count": 0, "image_usage": 0, "written_date": "April 17, 2023", "product_index": 0}, {"title": "Reasonably good camera", "rating": "4.0 out of 5 stars", "customer_id": "J. Jones", "body": "Had no trouble with the setup (Mac) and appears to have an acceptable picture quality although somewhat overly bright.My primary concerns are the poor quality of the lens cover door. It appears to come apart if not handled very delicately and also the positioning of the connection cord on the edge of one side at the back of the camera. This location tends to move the camera around and is not conducive to a steady positioning. As a result, I have had to move the camera from the top of my monitor to my computer stand (with a support to insure the proper angle.", "people_count": 4, "image_usage": 0, "written_date": "March 31, 2023", "product_index": 0}, {"title": "High Quality & Great Price", "rating": "5.0 out of 5 stars", "customer_id": "Hello", "body": "I can't believe how high quality this webcam is, especially for such an affordable price. I connected it to the external monitor to my laptop so now I can look at the camera and the screen at the same time. I get a lot of compliments in Zoom meetings for how high quality my video looks compared to everyone else using the built-in webcam on their laptop.", "people_count": 0, "image_usage": 0, "written_date": "April 21, 2023", "product_index": 0}, {"title": "Works well", "rating": "4.0 out of 5 stars", "customer_id": "First time using a second screen and i don’t think I can ever go back to just one! Buy it!", "body": "Easy to work with! I wish it had a feature that would allow it to be more firm on my laptop and also came in a sturdy enough box that I could always put in back in when I am not using it. Otherwise it’s cool", "people_count": 0, "image_usage": 0, "written_date": "April 12, 2023", "product_index": 0}, {"title": "great budget option for a beginner streamer", "rating": "5.0 out of 5 stars", "customer_id": "Alexander wilems", "body": "love the camera. bought this to start streaming on twitch. works well, decent picture, and I can use it for meetings at work as well. mic is not as useful, but I already have a dedicated microphone, so that really isn't much of an issue. feel like it competes well against Logitech or other larger, more expensive brands.", "people_count": 2, "image_usage": 0, "written_date": "April 13, 2023", "product_index": 0}, {"title": "Great Webcam for the Price!", "rating": "5.0 out of 5 stars", "customer_id": "Dee R.", "body": "This webcam was very user-friendly. I bought it for weekly Zoom meetings. It is ready to go out the box. I just changed my camera settings to recognize the webcam and it was up and running. The picture quality is very clear and the lighting is perfect.", "people_count": 1, "image_usage": 0, "written_date": "April 13, 2023", "product_index": 0}, {"title": "Works well", "rating": "5.0 out of 5 stars", "customer_id": "DonnaLee", "body": "During video calls everyone says the clarity is really good. Has a wider area, which I like, better than a closeup on the face only. Microphone works well. Easy plug & play and has an assortment of settings.", "people_count": 0, "image_usage": 0, "written_date": "April 17, 2023", "product_index": 0}, {"title": "Good product with nice features", "rating": "4.0 out of 5 stars", "customer_id": "Krishna Vallala", "body": "Loved the product, looks neat and easy to use. No installation required, no software required, just plug and play. Has a wide angle coverage and fitted my 65inch tv perfectly. Clarity was great, except saw some smoothness issues or focus. Sound quality was great.", "people_count": 1, "image_usage": 0, "written_date": "April 6, 2023", "product_index": 0}], [{"title": "Works perfectly.", "rating": "5.0 out of 5 stars", "customer_id": "PaulaFaughender", "body": "Great camera microphone combo. I bought it to use during my piano lessons, and it is exactly what I needed. I tip the camera down so my instructor can see my keyboard, but I can still see my laptop screen for instruction. Sound quality is excellent. Glad I bought it!", "people_count": 1, "image_usage": 1, "written_date": "April 11, 2023", "product_index": 0}, {"title": "It's smaller than you expect but it's good!", "rating": "4.0 out of 5 stars", "customer_id": "LizMarcus", "body": "Meets my need exactly", "people_count": 0, "image_usage": 0, "written_date": "April 24, 2023", "product_index": 0}, {"title": "Plug and play is easy and is recognizable at all times", "rating": "5.0 out of 5 stars", "customer_id": "Daniel", "body": "Needed this for work for our Teams meetings and always works perfect. Love the mic combo and never have any issues.", "people_count": 0, "image_usage": 0, "written_date": "April 22, 2023", "product_index": 0}, {"title": "Great webcame for the price!", "rating": "4.0 out of 5 stars", "customer_id": "MY", "body": "I plugged this into my laptop, which is 6 years old (has Windows 11 installed) and it was recognized immediately. The picture is crystal clear.I had camera issues early on with Zoom and some video and screen capture software, but I found that you had to make sure you enable Microsoft Store in Settings. I did some other trouble shooting and found that the USB port in which it was plugged was faulty and that was why it wasn't picking up video. I was unable to pick up audio from the microphone in Zoom, but I'm not sure if my computer is the issue since it's old, so I won't say it's the camera for now. I'm buying a new laptop. I'll know soon enough.If I had to give it a con, it would be the mounting. The clip lies low on the screen and partially blocks the task bar on top. But for the money, you can't beat this little camera.", "people_count": 8, "image_usage": 0, "written_date": "January 16, 2023", "product_index": 0}, {"title": "It's too wide angle for some uses", "rating": "4.0 out of 5 stars", "customer_id": "Lucia", "body": "For my purposes, 1:1 videoconferences, the 110 degree lens is too wide angle. Shows everything in the room, alongside my person. In researching this after the fact, I found that approximately 65 to 78 degrees is best for 1:1. In case it's useful to you. The field of vision on this one is not adjustable. Thus, this is going back. I have now ordered another brand, with a 72.5 degree field of vision.", "people_count": 29, "image_usage": 0, "written_date": "March 11, 2023", "product_index": 0}, {"title": "Very easy to set up & great picture!", "rating": "5.0 out of 5 stars", "customer_id": "William Lucas", "body": "This is the 2nd one we own & are very pleased.", "people_count": 0, "image_usage": 0, "written_date": "April 25, 2023", "product_index": 0}, {"title": "High quality camera", "rating": "5.0 out of 5 stars", "customer_id": "Maddie", "body": "Love the setting on this camera. It susto adjusts to the room and makes a very clear and bright picture.", "people_count": 0, "image_usage": 0, "written_date": "April 17, 2023", "product_index": 0}, {"title": "great support", "rating": "5.0 out of 5 stars", "customer_id": "Charles Thiesen", "body": "I thought there was a problem with this camera out of the box, so I contacted their tech support. Turns out it was a problem with Zoom. Nexigo support replied to my email quickly and helped me diagnose the problem. They were fast and accurate. To me this is almost more important than the quality of the camera which is fine.", "people_count": 4, "image_usage": 0, "written_date": "March 29, 2023", "product_index": 0}, {"title": "Perfect for Teams meetings", "rating": "5.0 out of 5 stars", "customer_id": "Michael Kohls", "body": "Does exactly what it says it would. Privacy cover is handy, as well,.", "people_count": 0, "image_usage": 0, "written_date": "April 21, 2023", "product_index": 0}, {"title": "Clear, wide image, garbage sound quality", "rating": "4.0 out of 5 stars", "customer_id": "Yanni", "body": "The microphone is totally useless, but the camera is good otherwise. I like the form factor and the lens cover.", "people_count": 0, "image_usage": 0, "written_date": "April 2, 2023", "product_index": 0}], [{"title": "Works great with my PC for showing the room during ZOOM meetings", "rating": "5.0 out of 5 stars", "customer_id": "GaTechIE", "body": "I use this camera for meetings when I have some attendees in the room and some on ZOOM. I attach it to my PC and just toggle between my PC camera (when I need to be seen) and this camera when I want to show the other attendees in the room. It has a great picture with a good field of view.", "people_count": 3, "image_usage": 0, "written_date": "March 27, 2023", "product_index": 0}, {"title": "A few annoyances but not enough to return, price is right.", "rating": "4.0 out of 5 stars", "customer_id": "Nick", "body": "The red light “power” indicator is annoying, it’s always going to be on while it’s plugged in…which I will pretty much always keep plugged in. The red indicator light is a complete design flaw and not necessary but enough about that.The camera quality is a fuzzy 1080p but is fine for the price, same with the audio - passable quality but don’t imagine you’ll be doing any quality vlogging with this. Granted I just got it because my desktop computer had a prior one that was going out so I needed a basic replacement.That’s what it is….like, don’t expect to get the best when buying a generic branded cereal at the store. It’s cheap for a reason.", "people_count": 11, "image_usage": 0, "written_date": "February 1, 2023", "product_index": 0}, {"title": "Nice Web Camera", "rating": "5.0 out of 5 stars", "customer_id": "Sport-Lover", "body": "I attached this web camera to my desktop that did not have a camera. The set up was easy, the camera fits on the top of the screen quite nicely, the camera/picture quality is clear. There also a screen that slides across so you can cover the camera. There is also a red indicator light to tell if the camera is on.", "people_count": 3, "image_usage": 0, "written_date": "March 27, 2023", "product_index": 0}, {"title": "Great for Zoom meetings", "rating": "5.0 out of 5 stars", "customer_id": "Brian Propst", "body": "My PC did not come with a built-in camera and microphone. This product filled both those needs for a zoom meeting I had. It is easy to install and worked the first time I used it without a lot of hassle. I also like the fact you can close the lens cap so people at the Zoom meeting can't see you unless you want them too.", "people_count": 3, "image_usage": 0, "written_date": "March 26, 2023", "product_index": 0}, {"title": "Just aiming it at you.", "rating": "5.0 out of 5 stars", "customer_id": "BRIAN LEVINE", "body": "Web cam. It works very well.", "people_count": 0, "image_usage": 0, "written_date": "April 24, 2023", "product_index": 0}, {"title": "It gets the job done", "rating": "4.0 out of 5 stars", "customer_id": "Drew Sells Homes", "body": "For the price this a fine camera to get the job done. Easy to setup the application to download does not add much to the camera itself. Overall really good value", "people_count": 1, "image_usage": 0, "written_date": "March 17, 2023", "product_index": 0}, {"title": "Great quality and price", "rating": "5.0 out of 5 stars", "customer_id": "Bwagn", "body": "This camera works very well. I specifically ask people on the other end of my web calls how the quality is and they all say it's really good. If I need to replace my camera for any reason, I'll be buying another one of this brand.", "people_count": 0, "image_usage": 0, "written_date": "March 27, 2023", "product_index": 0}, {"title": "Great", "rating": "5.0 out of 5 stars", "customer_id": "Edward", "body": "Does exactly what it says. Software works", "people_count": 0, "image_usage": 0, "written_date": "April 20, 2023", "product_index": 0}, {"title": "Works fine", "rating": "5.0 out of 5 stars", "customer_id": "Amazon Customer", "body": "Works fine with no problem", "people_count": 0, "image_usage": 0, "written_date": "April 22, 2023", "product_index": 0}, {"title": "excellente product", "rating": "5.0 out of 5 stars", "customer_id": "Pedro A", "body": "easy installation, good quality, download software and that's it", "people_count": 0, "image_usage": 0, "written_date": "April 21, 2023", "product_index": 0}], [{"title": "Good quality", "rating": "5.0 out of 5 stars", "customer_id": "Abby Woodbury", "body": "Good quality webcam. It comes with a cover for the camera if you don't want your camera on for chats. Stays on the computer really well.", "people_count": 0, "image_usage": 0, "written_date": "April 8, 2023", "product_index": 0}, {"title": "It’s great!", "rating": "5.0 out of 5 stars", "customer_id": "Joseph C.", "body": "Love it. Buy it.", "people_count": 0, "image_usage": 0, "written_date": "April 22, 2023", "product_index": 0}, {"title": "It works great", "rating": "5.0 out of 5 stars", "customer_id": "Rick", "body": "All good", "people_count": 0, "image_usage": 0, "written_date": "April 23, 2023", "product_index": 0}, {"title": "good quality", "rating": "5.0 out of 5 stars", "customer_id": "scott huff", "body": "Works good", "people_count": 0, "image_usage": 0, "written_date": "April 23, 2023", "product_index": 0}, {"title": "Adaptable", "rating": "5.0 out of 5 stars", "customer_id": "Peter Cor", "body": "Fits well onto computer screen", "people_count": 0, "image_usage": 0, "written_date": "April 18, 2023", "product_index": 0}, {"title": "You can find what you need", "rating": "5.0 out of 5 stars", "customer_id": "Brad calais", "body": "I enjoy browsing through all your items.", "people_count": 0, "image_usage": 0, "written_date": "April 18, 2023", "product_index": 0}, {"title": "Compact", "rating": "4.0 out of 5 stars", "customer_id": "Granny Goose 2", "body": "Upgraded my compute and needed a new camera. Liked the reviews on this one. Easy to install and use. I like the lens privacy cover. Only thing that would make it better is if the manufacturer offered a small program to manually control it.", "people_count": 1, "image_usage": 0, "written_date": "March 4, 2023", "product_index": 0}, {"title": "Very nice camera for the price.", "rating": "5.0 out of 5 stars", "customer_id": "Murray G.", "body": "I didn't need a very sophisticated camera, but there were a few minimum requirements, such as 1080p resolution, ease of use, attachment options to my desktop monitor, and plug and play installation. The NexiGo N60 had everything I needed at a very good price. I've only been using it a few days, but I'm happy with it so far.", "people_count": 3, "image_usage": 0, "written_date": "March 22, 2023", "product_index": 0}, {"title": "Love the Privacy Screen", "rating": "5.0 out of 5 stars", "customer_id": "TMR", "body": "It is great for video conferencing.", "people_count": 0, "image_usage": 0, "written_date": "April 18, 2023", "product_index": 0}, {"title": "GREAT camera for the price", "rating": "5.0 out of 5 stars", "customer_id": "Vince", "body": "This camera replaced another 1080 camera I was using that did not give me a sharp picture. The picture on this camera is VERY good, very sharp and very clear. I make this the default camera for the company I work for as well. Great price as well.", "people_count": 2, "image_usage": 0, "written_date": "March 24, 2023", "product_index": 0}], [{"title": "A good logitech alternative, if not better", "rating": "5.0 out of 5 stars", "customer_id": "T. Yang", "body": "The picture tone appears more natural than on Logitech C920, to me.", "people_count": 0, "image_usage": 0, "written_date": "April 11, 2023", "product_index": 0}, {"title": "Good camera for the price", "rating": "4.0 out of 5 stars", "customer_id": "J.T.", "body": "I know this is not the best webcam on the market but for the price the quality of the image is good", "people_count": 0, "image_usage": 0, "written_date": "March 9, 2023", "product_index": 0}, {"title": "Camera", "rating": "5.0 out of 5 stars", "customer_id": "Sharon H.", "body": "Installation was easy. Very pleased with the product.", "people_count": 0, "image_usage": 0, "written_date": "April 10, 2023", "product_index": 0}, {"title": "Plug & play on Linux Mint", "rating": "5.0 out of 5 stars", "customer_id": "grjtusij4l2j4", "body": "I figured it would work on Linux and it did just fine. No problems whatsoever. We use Linux Mint 20.", "people_count": 0, "image_usage": 0, "written_date": "March 28, 2023", "product_index": 0}, {"title": "Its good", "rating": "4.0 out of 5 stars", "customer_id": "Adri", "body": "Surprisingly good. Not the best top of the line but for the price if you know how to adjust to make the best of this camera it works more that well", "people_count": 1, "image_usage": 0, "written_date": "February 25, 2023", "product_index": 0}, {"title": "value", "rating": "5.0 out of 5 stars", "customer_id": "andrew holmes", "body": "great value easy setup", "people_count": 0, "image_usage": 0, "written_date": "April 10, 2023", "product_index": 0}, {"title": "Nice cam for the money", "rating": "5.0 out of 5 stars", "customer_id": "J. pridgen", "body": "I needed a new cam for Teams and this 1 works and looks great. esp. for the money", "people_count": 0, "image_usage": 0, "written_date": "March 30, 2023", "product_index": 0}, {"title": "Great To Use", "rating": "5.0 out of 5 stars", "customer_id": "Shalie Lanchester", "body": "This has been one of the best webcams I have used in nearly two decades. Good audio quality for it's microphone, and great quality in the picture. It can still be grainy and doesn't focus when I try to show something small close to the lens, and doesn't seem to have any sort of lens adjustment for focusing manually or trying to trick it to do it automatically.", "people_count": 1, "image_usage": 0, "written_date": "March 3, 2023", "product_index": 0}, {"title": "Great value", "rating": "5.0 out of 5 stars", "customer_id": "Visilor", "body": "Great value", "people_count": 0, "image_usage": 0, "written_date": "April 11, 2023", "product_index": 0}, {"title": "A really god camera", "rating": "4.0 out of 5 stars", "customer_id": "Jonathan Vargas V", "body": "I feel happy about the camera quality and its price. It's a product no one will regret. It's a good camera, but the mic got some eco. I suggest having a different mic.", "people_count": 0, "image_usage": 0, "written_date": "February 17, 2023", "product_index": 0}], [{"title": "Works as expected.", "rating": "5.0 out of 5 stars", "customer_id": "Dawn Smith", "body": "It was easy to make it work with Zoom which is why we bought it. The camera is smaller than I was expecting, so it's less obtrusive than I was imagining it would be atop my monitor. I like that it can also be attached to a tripod. I tried that out and it worked like a charm.", "people_count": 2, "image_usage": 0, "written_date": "March 6, 2023", "product_index": 0}, {"title": "Excellent webcam!", "rating": "5.0 out of 5 stars", "customer_id": "David H.", "body": "This isn't the most expensive camera I used or had access to but it is one the top ones for clarity and picture quality. I bought two and they work great. Several people on my Zoom calls mentioned that the picture was very sharp and they could see details in the room they could not see before. Very pleased with this cam. Recommend it to anyone looking for a good cam at a reasonable price.", "people_count": 2, "image_usage": 0, "written_date": "February 24, 2023", "product_index": 0}, {"title": "Pleasantly surprised", "rating": "5.0 out of 5 stars", "customer_id": "Lau", "body": "Great quality, easy to use and super affordable.", "people_count": 0, "image_usage": 0, "written_date": "April 1, 2023", "product_index": 0}, {"title": "Colors look little weird but does the job", "rating": "4.0 out of 5 stars", "customer_id": "Jadisage", "body": "I needed a camera and mic for college to submit a video assignment. The mic is sensitive and the camera isn’t the best quality. If you want to professionally stream or something like that I would pass but for the price it’s worth what I paid.If you just need a basic camera and mic this is perfect. Nothing too fancy and just plug and go.", "people_count": 0, "image_usage": 0, "written_date": "January 25, 2023", "product_index": 0}, {"title": "Amazing webcam for the price", "rating": "5.0 out of 5 stars", "customer_id": "Joe Nannini", "body": "Absolutely love this webcam ,has amazing clear picture and audio . You cannot beat the price either , high quality webcam for a budget !!", "people_count": 0, "image_usage": 0, "written_date": "March 16, 2023", "product_index": 0}, {"title": "Great stationary camera", "rating": "4.0 out of 5 stars", "customer_id": "Kindle Customer", "body": "The whole thing is super easy to set up. I dont recommend moving it all that much after you do though. The camera quality is great especially with the price. But if you have it set up a little bit away from you the mic isnt always accurate. If you dont have headphones be sure to use the mic only in a room with little ambient sound.", "people_count": 3, "image_usage": 0, "written_date": "January 17, 2023", "product_index": 0}, {"title": "Easy install works like a charm", "rating": "5.0 out of 5 stars", "customer_id": "C. L.", "body": "Easy to use, plug n play camera. I especially like that it comes with a privacy flip down cover. It just sticks to the top of the camera so that when you ready for privacy, it can be easily flipped down. Clarity is good. Overall, happy with this choice.", "people_count": 0, "image_usage": 0, "written_date": "February 28, 2023", "product_index": 0}, {"title": "Nice camera for Windows 10 older PC", "rating": "5.0 out of 5 stars", "customer_id": "OldRetiree", "body": "My PC would not accept several popular models, the software would not work. This camera is great, has very good microphone as well.I'd recommend it highly.One thing I like is it has a little flap that allows me to close the camera so it is not viewing when I don't want to be on camera. Also, there is a red light that shows the camera is installed and green light comes on when camera is turned on and viewing.", "people_count": 4, "image_usage": 0, "written_date": "February 16, 2023", "product_index": 0}, {"title": "Not in the way.", "rating": "5.0 out of 5 stars", "customer_id": "TIGER41", "body": "Good clear quality, sturdy, light, have used often for several months, no issues so far.", "people_count": 0, "image_usage": 0, "written_date": "March 22, 2023", "product_index": 0}, {"title": "Good for money but has a few flaws", "rating": "4.0 out of 5 stars", "customer_id": "John", "body": "The price is right. The picture is fairly crisp. I don’t use the microphone as I have a better one - so no complaints on that. My only issues are (A) the video color is a bit off -everything looks bluer than it actually is. My dark brown chair looks navy. My black jackets look navy. My green shirt looks blue-green. And my face is a bit blue - I don’t actually look blue but I need a ton of makeup to not look slightly sickly. (B) the picture is warped at the corners. There’s a door just in frame and it looks curved. I assure you, it’s a regular straight door but if you’re on a zoom with me you’d think otherwise.", "people_count": 15, "image_usage": 0, "written_date": "November 29, 2022", "product_index": 0}], [{"title": "Not bad for price!", "rating": "4.0 out of 5 stars", "customer_id": "Marian M.", "body": "I've had this product for about a year now and it's definitely a perfect start for a first webcam. good quality comes with a privacy flap that's detachable, and it's super easy to set up.", "people_count": 0, "image_usage": 0, "written_date": "February 1, 2023", "product_index": 0}, {"title": "Works intermittently", "rating": "3.0 out of 5 stars", "customer_id": "Robin K.", "body": "I bought this camera a couple months ago because I was tired of having to open my laptop to use a camera (I have a set up with double monitors). I don’t have any complaints about the camera picture quality. It does the job. There has been a few times however when it has stopped working if I’ve used it a lot during the day. For example, it will work for an hour and a zoom meeting but then when I switched to a teams meeting it stops working. Sometimes, unplugging it and re-plugging it works. But not always. For that reason, I would not recommend buying it unless there’s some type of user error but I can’t imagine what I’m doing wrong. Also, given my set up, I would prefer the camera to be more in the middle, as opposed to at the top of the monitor. In hindsight, I would pick a different camera set up so that it would not sit on top of the monitor.", "people_count": 0, "image_usage": 0, "written_date": "March 5, 2023", "product_index": 0}, {"title": "webcam", "rating": "5.0 out of 5 stars", "customer_id": "Lee Marletto", "body": "The package arrived intact. I have not set up the webcam yet.", "people_count": 0, "image_usage": 0, "written_date": "March 20, 2023", "product_index": 0}, {"title": "Great cam at a great price", "rating": "5.0 out of 5 stars", "customer_id": "AmazonJunkie", "body": "Very happy with the camera! Easy to use and install. Support was kind enough to send me a replacement for the privacy cover which i lost too!", "people_count": 0, "image_usage": 0, "written_date": "March 8, 2023", "product_index": 0}, {"title": "It work good", "rating": "5.0 out of 5 stars", "customer_id": "David w lumpkin", "body": "Love on my computer great", "people_count": 0, "image_usage": 1, "written_date": "March 23, 2023", "product_index": 0}, {"title": "Outstanding value and received it the same day I ordered it.", "rating": "5.0 out of 5 stars", "customer_id": "Rex Owens", "body": "Zoom meetings.", "people_count": 0, "image_usage": 0, "written_date": "March 27, 2023", "product_index": 0}, {"title": "This Web Camera NexiGo N60 1080P is Fantastic.", "rating": "5.0 out of 5 stars", "customer_id": "AT", "body": "This Web Camera NexiGo N60 1080P is Fantastic.", "people_count": 0, "image_usage": 0, "written_date": "March 22, 2023", "product_index": 0}, {"title": "Webcam is good, but does not work correctly", "rating": "3.0 out of 5 stars", "customer_id": "Taylor", "body": "I got this webcam in October 2020 for work. The camera worked great for about a year to year and a half. Every time I am on a teams call for longer than a few minutes, my camera times out and disconnects. There is no way to update it. I got a new computer and hoped that it was just an issue with my computer, but the camera still disconnects in my calls. It resets after a few minutes, but it's not very professional when I'm presenting and my camera just dies.", "people_count": 0, "image_usage": 0, "written_date": "April 3, 2023", "product_index": 0}, {"title": "Micro/cam", "rating": "4.0 out of 5 stars", "customer_id": "precious kitten", "body": "I have a hard time w it as it seems only the microphone works but not camera. But most importantly whenever i plug it in to use it it freezes up my keyboard and mouse", "people_count": 1, "image_usage": 0, "written_date": "January 25, 2023", "product_index": 0}, {"title": "Great picture quality. Easy to use", "rating": "5.0 out of 5 stars", "customer_id": "Attentive_gal04", "body": "I bought this camera for Zoom meetings at home because the camera quality on my laptop was terrible, and I didn’t like having to open my laptop for meetings. This camera was reasonably priced, and it works great! It’s really easy to mount on a monitor, and there is no setup! Plug and go. I liked it so much that I bought another for my office. I highly recommend. I’ve been using it for about eight months with no problems.", "people_count": 5, "image_usage": 0, "written_date": "February 11, 2023", "product_index": 0}], [{"title": "Causing Zoom App & Slack Huddles to Crash on Macbook Pro (Ventura 13.2.1)", "rating": "3.0 out of 5 stars", "customer_id": "BZ", "body": "I was excited to use this camera, as the picture quality far exceeded the built-in camera on my Macbook Pro (currently on OS Ventura 13.2.1). However, after one Zoom call my Zoom desktop and browser applications started to crash, along with the video on my Slack Huddles. When I can get Zoom to start up, I've also noticed a lag when using the share / stop sharing screen feature. I've tried deleting and reinstalling apps, updating the preferences on my Mac to recognize the camera, scouring the user manual, and even reached out to my work IT team to see if our internal security was blocking access to the camera. Unfortunately, the only solution so far seems to be unplugging and plugging the camera back in multiple times a day, which isn't ideal. I'll likely be returning this camera unless I can find a solution.", "people_count": 1, "image_usage": 0, "written_date": "March 2, 2023", "product_index": 0}, {"title": "Great picture for the price - but not under fluorescent lights", "rating": "4.0 out of 5 stars", "customer_id": "T Doherty", "body": "After seeing some sample videos posted by other reviewers, I purchased this to replace a failing Logitech webcam. I'm very happy with the outstanding sharpness, color and overall picture quality when I use it in my remote office at home. But be forewarned, the webcam does a terrible job under fluorescent lighting. I had an offsite work meeting with several colleagues and the room's fluorescent lights caused rolling bands of interference. Of the eight of us using webcams in the room, the NexiGo was the only one with a fluorescent light issue. I took off a rating star because of this. Otherwise the picture is super sharp.Also, the built in mic is poor. This isn't an issue for me since I always use my Pixel buds, but if you're depending on the NexiGo for audio, you might be disappointed.", "people_count": 8, "image_usage": 0, "written_date": "October 7, 2022", "product_index": 0}, {"title": "Quality Picture", "rating": "5.0 out of 5 stars", "customer_id": "Robert R.", "body": "The Nexigo camera was easy to setup; just plug into a USB slot on your computer. The video and sound quality is very good.", "people_count": 0, "image_usage": 0, "written_date": "March 6, 2023", "product_index": 0}, {"title": "Good while it lasted", "rating": "3.0 out of 5 stars", "customer_id": "Northwest Reader", "body": "These are shoddily and cheaply built, so if you're OK with buying an easy to use, decent plug and play camera that will last about a year and a half, this is your choice. But like so many things built today, this camera is all about QUANTITY not QUALITY so it won't last long and could go out right in the middle of a class, meeting, or job interview.", "people_count": 0, "image_usage": 0, "written_date": "April 8, 2023", "product_index": 0}, {"title": "Great For Asking Price", "rating": "4.0 out of 5 stars", "customer_id": "BladeDragon", "body": "I've had many different Webcams over the years, to date, this is one of the best. ONLY issue is, with the software there is NO way to flip the image. Outside of that a great buy.", "people_count": 0, "image_usage": 0, "written_date": "January 16, 2023", "product_index": 0}, {"title": "Good", "rating": "5.0 out of 5 stars", "customer_id": "Bill Schaepe", "body": "Installed easy, worked fine, good picture quality", "people_count": 0, "image_usage": 0, "written_date": "March 17, 2023", "product_index": 0}, {"title": "good webcam", "rating": "5.0 out of 5 stars", "customer_id": "ZhijingZeng", "body": "I used it every day, it is better than my laptop's camera. Very clear! Happy about the purchase every time I use it.", "people_count": 0, "image_usage": 0, "written_date": "March 5, 2023", "product_index": 0}, {"title": "Good value", "rating": "5.0 out of 5 stars", "customer_id": "Reddog35", "body": "Very simple plug and play. The camera has excellent video quality. I use it primarily for zoom and the picture is great and those watching / listening on the other side say it’s a really good picture and very clear sound.", "people_count": 1, "image_usage": 0, "written_date": "February 20, 2023", "product_index": 0}, {"title": "Works great for Zoom meetings", "rating": "4.0 out of 5 stars", "customer_id": "SP", "body": "I love the lens cover", "people_count": 0, "image_usage": 0, "written_date": "February 7, 2023", "product_index": 0}, {"title": "It works and has privacy cover", "rating": "5.0 out of 5 stars", "customer_id": "Britt", "body": "I ordered this because work insists I use video calls. Anyway, I previously had two different cameras on my computer and they were, ahem, budget, not much cheaper than this one. Both of those started giving me all sorts of errors and I couldn't fix them so I figured it was a driver/software issue. It really wasn't, the cameras themselves broke down. I've only had this one a little bit so I was super happy that I just had to plug it in and it worked and that was it.It sits almost comfortably on my monitor, but it doesn't sit snugly on my monitor so the slightest shaking of my desk can create some motion in the camera. Not really an issue for me, but worth noting.It has a privacy cover which I truly enjoy because I get paranoid about the camera still being on.Video quality is alright, I notice mine is better than most people in my zoom meetings so if I had to make a statement, I'd say it's better than standard laptop cameras and/or most cheap cameras people would buy. Auto color adjustment on it is whatever, but that may also be Zoom and Teams and nothing to do with the camera. There is some grain in my camera, but I also use a 1920px monitor so I'm not too shocked because if I really wanted crystal clear photos or videos I highly doubt anything in this price range can do it.All in all, this does what you expect it to, and want it to and comes at a great price. I would buy again.", "people_count": 16, "image_usage": 0, "written_date": "August 12, 2022", "product_index": 0}], [{"title": "Great for the Home PC", "rating": "5.0 out of 5 stars", "customer_id": "Gene Lalicker", "body": "Easy installation with great picture quality.", "people_count": 0, "image_usage": 0, "written_date": "March 14, 2023", "product_index": 0}, {"title": "Works great, albeit the quirks.", "rating": "4.0 out of 5 stars", "customer_id": "Amazon Customer", "body": "This is probably the best, cheaper end webcam I have bought in a long time. The microphone and camera quality are quite nice. Though after installing the software for it, it reacted... less than expected in OBS. The screen tore, it flashed green and red, then stopped working. It also tries to hijack your audio settings from time to time if you apps like discord.The positives however are there. It has a large wide view lens that can cropped in the software, it controls contrast and other features too, and fits snug on the monitor. The little lens cap attachment is a nice plus for you tech minded individuals out there. All in all? Not bad. Plus same day shipping was absolutely correct. Arrived perfectly on time. What more could you ask for in a bargain webcam?", "people_count": 5, "image_usage": 0, "written_date": "September 9, 2022", "product_index": 0}, {"title": "Lasted a Year", "rating": "3.0 out of 5 stars", "customer_id": "Klynne", "body": "I ordered this March 7, 2022. In the last week it has started freezing at least 1-2x each call and never catches me looking good. I have disconnected and reconnected and it doesn’t help. I have been using the same PC and operating software for the last year.", "people_count": 0, "image_usage": 0, "written_date": "April 6, 2023", "product_index": 0}, {"title": "Pivot ball broke.", "rating": "3.0 out of 5 stars", "customer_id": "SRB", "body": "Purchased in January and just tried to adjust the direction and the ball broke off of the housing.", "people_count": 0, "image_usage": 0, "written_date": "April 24, 2023", "product_index": 0}, {"title": "Simple plug and play", "rating": "5.0 out of 5 stars", "customer_id": "Donnie Burgess", "body": "I purchased this because my home setup for my work computer has the laptop closed and on a keyboard tray. The laptop is the only mic and camera I have. I had tried using other brands of mic and or camera through a cheap docking station with no success (connecting to a typical dell latitude corporate laptop) with a thunderbolt connector.This one was true to its word; I didn't have to install or set up anything. I connected it to the USB 3.0 output on my docking station and the audio worked immediately. The camera took me changing in a setting in webex to get it to find this camera (which was there, just not set to default). Teams automatically used the new camera. I can't figure out how to use the camera outside of those two programs, but I don't need to anyway, so that's not a problem for me.The microphone sounds great and people can still hear me clearly when I turn my head from side to side or reach to the desk beside me to use my home PC. As long as my head is pointed in the general direction of the thing and within a few feet of it, all is well.", "people_count": 13, "image_usage": 0, "written_date": "October 20, 2022", "product_index": 0}, {"title": "Great camera", "rating": "5.0 out of 5 stars", "customer_id": "Russ T.", "body": "The camera was plug and play and works just fine", "people_count": 0, "image_usage": 0, "written_date": "March 6, 2023", "product_index": 0}, {"title": "I didn’t know what I was missing!", "rating": "5.0 out of 5 stars", "customer_id": "Cristobol", "body": "To start, this was a simple plug and play product that required zero setup on my HP laptop. The native camera in my computer always turned every shirt in wore, with the exception of white, to purple. Don’t get me wrong, purple is a great color, but I don’t want customers to think I only own white and purple shirts!The NexiGo camera instantly became the default camera and was crystal clear across the three different web meeting platforms I use. Normally, I have a grainy image that makes my bald white head shine through as the dominant feature in an otherwise dark video.For my day job, the computer is provided for me and all of my meetings are for that job only, so I can blame image quality on them as my colleagues are in a similar situation and none of us look good. For my consulting job, it is my personal computer that is used and bad image quality reflects poorly on me as a specialist that they paid to see and hear.I use dual monitors and prefer to work off of the larger monitor that does not have a camera. Well, it does now and I no longer have to look like I’m taking to the side when I use that monitor. I don’t move around a lot to best utilize the capabilities of the autofocus feature, but from where I sat for my first meeting, everything was in perfect focus.Not that I need another one for my day job, but I seriously want to buy another after my initial experience with this one.", "people_count": 8, "image_usage": 0, "written_date": "June 24, 2022", "product_index": 0}, {"title": "Clarity of picture", "rating": "5.0 out of 5 stars", "customer_id": "Marge Sobczak", "body": "This is a very easy product to set up. Works well right out of the box!", "people_count": 0, "image_usage": 0, "written_date": "March 1, 2023", "product_index": 0}, {"title": "Broke off it’s stand in less than 4 months - but their CS made it right", "rating": "4.0 out of 5 stars", "customer_id": "TSanta", "body": "Went to jump on a video call and the camera broke off it’s stand. It’s very cheaply connected to the monitor attachment. Amazon only covers it for 90 days now I need to go through the manufacturer for a replacement. **Update** - I have to say I changed this from a 1 star to 4 star review after receiving a replacement within 3 days of submitting my warranty claim to the company.", "people_count": 5, "image_usage": 1, "written_date": "November 21, 2022", "product_index": 0}, {"title": "Good quality for the price", "rating": "4.0 out of 5 stars", "customer_id": "Aviv", "body": "Relatively short cable", "people_count": 0, "image_usage": 0, "written_date": "January 21, 2023", "product_index": 0}]]