[[{"title": "First usage of 'better' mouse", "rating": "5.0 out of 5 stars", "customer_id": "Amazon Richard", "body": "I wanted to title this \"First usage of a high-end mouse\", but at this price, it isn't really high-end, but it is a step up from the cheaper mice, and I wanted to see what it was like.I am impressed (mostly).It is a heavier mouse, but that makes it feel more solid, and I like that a lot. I also really, really noticed the very smooth gliding of the mouse, and like this a lot.I don't do head-to-head gaming; most of my games are solo playing. I don't really see much of a difference with this mouse over the old mice.I'm really used to 3-button mouse, so I really don't know what to use the two extra mouse buttons for (they are on the left side of the mouse, and they won't be accidentally clicked as long as the grip stays in the lower area. I looked up some suggestions, but I was a bit disappointed that some key combinations don't work (I was hoping to map ctrl+windows+left to one button and ctrl+windows+right to the other, but it doesn't seem to realize when I press the windows button).That brings us to the software.. you have to install it to adjust the lights or assign the buttons. The EULA basically says that they collect data on usage. I did want the lights to turn off after a time, and I like the \"breathing\" light... so, for now, I'm running it (the effects don't stick when you don't run the program). I don't trust the software that comes with the mouse. There may be some other way to control it.Aside from the software, I'm impressed by my foray into fancier mice.", "people_count": 3, "image_usage": 0, "written_date": "February 24, 2023", "product_index": 0}, {"title": "Comfy mouse, but scroll press is weird", "rating": "4.0 out of 5 stars", "customer_id": "stillo", "body": "I don’t mind this mouse, I had a razor one before and it hasn’t done me wrong. The only complaint I have is that when I use scroll up and down (I use a lot in gaming) it mistakes it as scroll press way too easily, my old mouse wasn’t like that. If I scroll up just a little too much it will activate the scroll press in my games (which is usually ping) and it’s annoying. Other than that the mouse is pretty looking", "people_count": 0, "image_usage": 1, "written_date": "March 29, 2023", "product_index": 0}, {"title": "This mouse is perfect for your gaming needs!", "rating": "5.0 out of 5 stars", "customer_id": "Tyler", "body": "For years I have wanted a mouse with the ergonomic build this one has, when I first started gaming I ordered a cheap mouse from Amazon roughly ~$20 and when I saw this and ordered it I was so upset with myself. This mouse is so easy to use the buttons on the side are perfect for gaming keybinds, the clicking is so smooth and easy, and the DPI is perfect and adjustable! You can set the RGB to different settings such as solid color or breathing and more! I absolutely love this mouse and definitely would recommend it to everyone!", "people_count": 2, "image_usage": 0, "written_date": "March 15, 2023", "product_index": 0}, {"title": "Very great mouse, especially for the price", "rating": "5.0 out of 5 stars", "customer_id": "Katya Mogilevsky", "body": "I just bought it again because I had my last one for about 6 years and it worked perfectly well the whole time. In the last year, the right-click started acting up a bit, but I also mashed the buttons (aggressively) a lot playing Cookie Clicker, so that might be on me.", "people_count": 0, "image_usage": 0, "written_date": "April 4, 2023", "product_index": 0}, {"title": "Decent mouse", "rating": "4.0 out of 5 stars", "customer_id": "Jorge Jovana", "body": "Great for the price and will probably deem reliable after long periods of use. I had to get this mouse cause my logitech had a scrolling problem so I got this and when i first got it, it was really heavy compared to my previous mouses. I'll get use to it but it's kind of like a thick yet lightweight mouse. I give it a 4.5/5", "people_count": 0, "image_usage": 0, "written_date": "March 22, 2023", "product_index": 0}, {"title": "Almost perfect fit", "rating": "5.0 out of 5 stars", "customer_id": "Harris", "body": "I love the way it looks and works. For me, the fit is a little off - If I palm it the way that it's formed, the fit is good but it makes my wrist turn a little too far \"flat\" to the desk. if it were just \"tilted\" so my wrist was angled \"up\" a few degrees it would be great. Also, it is super light. I like that it's not heavy, but I'd like a little more \"feel\" to it when I go to hold/engage it. This is obviously all personal preference.", "people_count": 1, "image_usage": 1, "written_date": "March 13, 2023", "product_index": 0}, {"title": "Great mouse for the value.", "rating": "5.0 out of 5 stars", "customer_id": "Happy Reader!", "body": "I needed a high quality laser mouse. I play FPS games. Not \"professionally\" and I don't even intend to try. I imagine there is a need for very advanced mice. So if that is you, maybe check reviews by people who intend to game+stream for a living to ensure you are getting the really in-depth look and the best information. If you need durable laser mouse and enjoy games, and are trying to find that sweet spot between buying quality and not breaking the bank, I think this is your mouse. I probably got it on sale, but my Logitech M500s broke a second time (RIP good buddy) I decided I would just try a new mouse. That Logitech was basically everything I needed and wanted in a mouse but I figure Razer made nice stuff and I wanted to try a simple corded mouse with a few extra buttons. This was everything I needed and more. It has 1) a light on it and 2) some software to install. I didn't really want to but I installed it. I think you have to register. I did. It wasn't a pain but it's a mouse. You should plug it in and use it and that's it. The bad thing is the light. It's a green light and bright. That's completely unnecessary. You can easily turn it off with the software you install and I did. Beyond that, I have everything I need. It feels great in the hand. The additional buttons are in sensible places and that helps with games. The scroll-wheel is just fine. Great mouse! Turn the light off and it is even better.", "people_count": 8, "image_usage": 0, "written_date": "January 11, 2023", "product_index": 0}, {"title": "improved on aiming instantly", "rating": "4.0 out of 5 stars", "customer_id": "Vladimir", "body": "I used to have an old cheap mouse that wasn't bad but wasn't great either, but compared to THIS mouse it was terrible. THIS mouse is incredible, it feels so smooth and high quality. It is a little big and thick compared to what I've seen as the average mouse but still very high quality, I definitely recommend you to try it out", "people_count": 2, "image_usage": 0, "written_date": "March 25, 2023", "product_index": 0}, {"title": "Great", "rating": "5.0 out of 5 stars", "customer_id": "Apple", "body": "I love this product so much I am a huge fan of razor and I will still keep buying from Razer. This products overall is a five star really love this item. It is cute and also you can decorate the mouse which is really fine you could just buy a little stickers that you need for the razor customization as your own . Also, it did come with the sticker which I’m really loving and thank you so much.", "people_count": 1, "image_usage": 0, "written_date": "March 16, 2023", "product_index": 0}, {"title": "Worth it so far", "rating": "5.0 out of 5 stars", "customer_id": "Jmandy", "body": "So far I really like the mouse I just got it the day I'm writing this, and ok have no trouble. I went from a 8 dollar mouse to this and it is a really big improvement. I am mostly a gamer so having a gaming mouse helps me get better. Overall I give this. A 4/10 because I have no idea how this is going to work in the future. I recommend and would buy again.", "people_count": 0, "image_usage": 1, "written_date": "March 15, 2023", "product_index": 0}], [{"title": "Amazing for price.", "rating": "5.0 out of 5 stars", "customer_id": "Sean Thamrongpradith", "body": "Great mouse overall. Sturdy enough for drops. You can easily select the different DPI settings. It's the essentials version so it doesn't let you chose from the RGB internal lights but allows for other features like breathing and light brightness", "people_count": 0, "image_usage": 0, "written_date": "March 30, 2023", "product_index": 0}, {"title": "Excellent Entry Level Mouse", "rating": "5.0 out of 5 stars", "customer_id": "James liebler", "body": "For the price you can't beat this mouse for daily computer use as well as gaming. It avoids the gimmicky pitfalls of similar mice in this price point and simply delivers on quality. I've bought two for gifts and have only heard high praise for them. For those who want the endgame version I recommend the viper ultimate.", "people_count": 0, "image_usage": 0, "written_date": "March 22, 2023", "product_index": 0}, {"title": "Perfect for FPS and general computer shenanigans", "rating": "5.0 out of 5 stars", "customer_id": "Dom", "body": "I mean... It's a Razer... Are you surprised about the quality? Top quality mouse for all of your computer and gaming needs!", "people_count": 0, "image_usage": 0, "written_date": "April 8, 2023", "product_index": 0}, {"title": "No changeable dpi", "rating": "4.0 out of 5 stars", "customer_id": "Mason", "body": "It would have been a 5 star but you can’t change the dpi and for games like valorant and csgo it’s hard to play with 6400 dpi other than that it’s a great mouse for the price", "people_count": 0, "image_usage": 0, "written_date": "March 21, 2023", "product_index": 0}, {"title": "Great mouse!!!", "rating": "5.0 out of 5 stars", "customer_id": "Aaron", "body": "Got it for about 20$ and it's a beast!!! Fast, accurate and reliable. Yes it's wired which might not be the best for everyone but its the best mouse I've used.", "people_count": 0, "image_usage": 0, "written_date": "March 28, 2023", "product_index": 0}, {"title": "Top Tier Budget Mouse", "rating": "4.0 out of 5 stars", "customer_id": "Wensly", "body": "Its a great mouse at its price point. It is a bit big and heavier than what I'm used to. It also lights up green. Great mouse if your budgeting", "people_count": 0, "image_usage": 0, "written_date": "March 17, 2023", "product_index": 0}, {"title": "An absolute for its price", "rating": "5.0 out of 5 stars", "customer_id": "Zepto-YT", "body": "Great price definetly worth it, idk how its that cheap but its amazing because you can use it for hours and ur wrist will be just fine", "people_count": 0, "image_usage": 0, "written_date": "March 27, 2023", "product_index": 0}, {"title": "Really Nice Gaming Mouse", "rating": "5.0 out of 5 stars", "customer_id": "Masked Reviewer", "body": "I am super happy with this mouse for the price point. I wanted a gaming mouse to use with my laptop but I didn't want to pay a lot of money for it. This one is great. It's comfortable for my hand and it definitely improves my gaming experience.", "people_count": 0, "image_usage": 0, "written_date": "March 13, 2023", "product_index": 0}, {"title": "Good", "rating": "4.0 out of 5 stars", "customer_id": "Margie shorek", "body": "He loves it", "people_count": 0, "image_usage": 0, "written_date": "March 29, 2023", "product_index": 0}, {"title": "Solid for the price", "rating": "5.0 out of 5 stars", "customer_id": "Amazon Customer", "body": "I don't use this for gaming, as I'm not a gamer. I only use it for office work. Compared to any other mouse I've tried in the price range, this is by far the best. It's comfortable in the hand, it's light, and moves with ease, and the buttons respond well. Not really much more to ask for in a mouse if it's for office use unless you want to go super high-end4.", "people_count": 0, "image_usage": 0, "written_date": "February 27, 2023", "product_index": 0}], [{"title": "great product", "rating": "4.0 out of 5 stars", "customer_id": "xbadwolf", "body": "love this mouse, my go to for years, could be a bit better built and last longer though", "people_count": 0, "image_usage": 0, "written_date": "March 14, 2023", "product_index": 0}, {"title": "Good for 20 bucks", "rating": "5.0 out of 5 stars", "customer_id": "Aaron", "body": "My brother liked it, and it was a bargain since i only paid 20 for it brand new", "people_count": 0, "image_usage": 0, "written_date": "March 27, 2023", "product_index": 0}, {"title": "looks good", "rating": "5.0 out of 5 stars", "customer_id": "Sober Poster", "body": "I had mouse issue thought this would fix BUT not related and lead to fixing real issue, thanks.", "people_count": 0, "image_usage": 0, "written_date": "March 26, 2023", "product_index": 0}, {"title": "Works great for computer games!", "rating": "5.0 out of 5 stars", "customer_id": "natalia", "body": "my son is very happy with the purchase!", "people_count": 0, "image_usage": 0, "written_date": "March 31, 2023", "product_index": 0}, {"title": "good", "rating": "4.0 out of 5 stars", "customer_id": "anita", "body": "it’s good, had it for about a year and it’s lasting well.", "people_count": 0, "image_usage": 0, "written_date": "March 11, 2023", "product_index": 0}, {"title": "Basic mouse", "rating": "4.0 out of 5 stars", "customer_id": "Rockwell", "body": "The buttons are very loud but it does what it needs to do.", "people_count": 0, "image_usage": 0, "written_date": "March 12, 2023", "product_index": 0}, {"title": "good gaming mouse", "rating": "5.0 out of 5 stars", "customer_id": "Tokyo XVII", "body": "great for gaming", "people_count": 0, "image_usage": 0, "written_date": "March 29, 2023", "product_index": 0}, {"title": "not too 'busy'", "rating": "5.0 out of 5 stars", "customer_id": "Brad Lastnamehere", "body": "I love this mouse! You can set sensitivity and set buttons to do different things. As far as gaming mice go, its pretty basic. That's all I need though.", "people_count": 1, "image_usage": 0, "written_date": "March 10, 2023", "product_index": 0}, {"title": "my son is using this to play World of Warcraft. He says it is working great :)", "rating": "5.0 out of 5 stars", "customer_id": "C. Elders", "body": "We like it! Recommend it to gamers.", "people_count": 0, "image_usage": 0, "written_date": "March 22, 2023", "product_index": 0}, {"title": "Good starter mouse", "rating": "5.0 out of 5 stars", "customer_id": "Yellow shenron", "body": "Easy set up starter mouse. No complaints yet.", "people_count": 0, "image_usage": 0, "written_date": "March 20, 2023", "product_index": 0}], [{"title": "Better than more $$$ options", "rating": "5.0 out of 5 stars", "customer_id": "kelsey", "body": "It's perfect for me. It's a bigger mouse and I love that. I have multiple more expensive Razer gaming mice and prefer this one for prolonged use. Amazing price for what you get. It is only the green illumination, so it's not RGB if that bothers you!", "people_count": 0, "image_usage": 0, "written_date": "February 24, 2023", "product_index": 0}, {"title": "new item", "rating": "5.0 out of 5 stars", "customer_id": "wai", "body": "good brand new not refurbish", "people_count": 0, "image_usage": 0, "written_date": "March 22, 2023", "product_index": 0}, {"title": "My favorite mouse", "rating": "5.0 out of 5 stars", "customer_id": "reunited", "body": "This is my favorite mouse of all time. I have 3 as backups in case Razer every changes it. I have small hands and can't use an MMORPG mouse (big sad) so it's helpful to have the couple extra buttons on the side.", "people_count": 0, "image_usage": 0, "written_date": "February 27, 2023", "product_index": 0}, {"title": "Scroll wheel bad after <7 months of use", "rating": "4.0 out of 5 stars", "customer_id": "Bethany Siau", "body": "Ugh. I loved this mouse. It looks and feels great. A couple of months ago the scroll wheel started to jump when I use it. It's a new mouse so it shouldn't have any issues yet, but I looked it up and I guess this is a normal problem for this mouse. I did the settings trick: control panel > mouse > wheel > one page at a time. This helped a little but it still jumps up and down. I would rather not open my mouse up to try to fix it but I think that's where I'm at :/", "people_count": 16, "image_usage": 0, "written_date": "December 29, 2022", "product_index": 0}, {"title": "perfect mouse for gaming", "rating": "5.0 out of 5 stars", "customer_id": "Krystle Garcia", "body": "i’m so sad that you can’t change the color of the rgb in the mouse! ( i have other razor items ) but it’s fine i made my setup match anyways :)", "people_count": 0, "image_usage": 0, "written_date": "February 27, 2023", "product_index": 0}, {"title": "Not bad", "rating": "4.0 out of 5 stars", "customer_id": "Robert Nellinger", "body": "Not bad but feels really cheap", "people_count": 0, "image_usage": 0, "written_date": "February 20, 2023", "product_index": 0}, {"title": "Good gaming mouse", "rating": "5.0 out of 5 stars", "customer_id": "daniel futado", "body": "infinitely better than the $20 logitech mouse I bought for gaming and everything else. Would reccomend", "people_count": 0, "image_usage": 0, "written_date": "March 8, 2023", "product_index": 0}, {"title": "cat approves", "rating": "5.0 out of 5 stars", "customer_id": "victoria", "body": "i’ve had it for 3 months and i have had any problems, and the led it still as bright! :>", "people_count": 2, "image_usage": 1, "written_date": "February 28, 2023", "product_index": 0}, {"title": "Easy to set up PnP all the way", "rating": "5.0 out of 5 stars", "customer_id": "Jimmy Rosenberry", "body": "I always bought a cheap mouse and never spent more than 20 USD when I see this mouse for around 20 USD I was like let's buy and see what the fuse is all about . Well, Now I Know this is a great mouse my gameplay has gotten better This is a quality Mouse and is worth the money for a budget gamer.", "people_count": 2, "image_usage": 0, "written_date": "February 5, 2023", "product_index": 0}, {"title": "it works and easy to setup", "rating": "4.0 out of 5 stars", "customer_id": "jeffrey k johns", "body": "it works and easy to setup", "people_count": 0, "image_usage": 0, "written_date": "February 7, 2023", "product_index": 0}], [{"title": "Good stuff", "rating": "5.0 out of 5 stars", "customer_id": "Aviv", "body": "Good stuff I guess", "people_count": 0, "image_usage": 1, "written_date": "March 8, 2023", "product_index": 0}, {"title": "great budget option", "rating": "5.0 out of 5 stars", "customer_id": "gerg hoffley", "body": "good sensor & ergonomics, can drag click, white led, what else can you ask for a 20-30 dollar budget alternative?", "people_count": 0, "image_usage": 0, "written_date": "February 25, 2023", "product_index": 0}, {"title": "Let me tell you why the other reviews on here are WRONG", "rating": "5.0 out of 5 stars", "customer_id": "Bolokai", "body": "1. This mouse is not \"lightweight junk\".2. Braided cables are worse.3. Silicone side grips were never that great.Some of the reviews on here are ridiculous. Let me clear some things up.The Kailh switches in here are mid-weight and feel slightly heavier (and less mushy) than the optical switches in the Deathadder V2. The side buttons feel significantly better than the V2. The scroll wheel is less tactile (or smoother, depending on how you look at it).This is a heavy, heavy boy by today's standards. This thing is better built than the V2, but consequently harder to do a weight reduction mod because the plastic is so damn thick.People that complain about this version not having a braided cable... you want an even less flexible one?! Razer's braided cable is the same rubber cable with an additional outside sheath, making it even less flexible. This cable is an improvement from years past, but it's not great. Fortunately because it's not braided, it's easy to rip the rubber sheath and shielding off, and paracord it.The side grips are meh. It's a bit more than molded plastic, but not as noticeable as the silicone on the V2. Silicone still gets slippery when wet, so best solution was always aftermarket grips. If the V2 had G703 quality rubber grips to being with, then I could see the grip complaints on here being justified.My biggest problem with this thing is the lack of replacement skates. No corepads or tiger ice for this model. It has the rear skate of the V2, but two front skates more similar to the V2 Pro. If you you like the white color or mechanical switches, and use less than 6400dpi, then can't go wrong for $20 and some elbow grease.Software still blows. Can use open source software to permaset light effects when not plugged into PC w/ Synapse.", "people_count": 29, "image_usage": 0, "written_date": "July 12, 2022", "product_index": 0}, {"title": "Enjoyable!", "rating": "5.0 out of 5 stars", "customer_id": "📖immersionreader🎧", "body": "This mouse is price effective and very nice. Its the kind that fits your whole hand so it just sits there without cramping up", "people_count": 0, "image_usage": 0, "written_date": "February 21, 2023", "product_index": 0}, {"title": "Scroll Wheel Broken After a Few Months", "rating": "3.0 out of 5 stars", "customer_id": "Andrew", "body": "Overall I loved this mouse. It feels so good ergonomically and the responsiveness is excellent. But I ordered it back in October 2022 (It is now March 2023) and I have to buy a new mouse now because the scroll wheel is going crazy on me. Every time I try to scroll one way it scrolls the other, and then it doesn't and then it does, it confuses me. So in all, great mouse for the time that it lasted which wasn't as long as I would have hoped.", "people_count": 1, "image_usage": 0, "written_date": "March 25, 2023", "product_index": 0}, {"title": "Great, but scroll wheel issues", "rating": "4.0 out of 5 stars", "customer_id": "Stephen Ferguson", "body": "Great until the scroll wheel starts messing up and requires disassemble and cleaning", "people_count": 1, "image_usage": 0, "written_date": "January 26, 2023", "product_index": 0}, {"title": "Great beginners mouse", "rating": "5.0 out of 5 stars", "customer_id": "Jeeper", "body": "Great beginners mouse for people newer to PC gaming. It’s not too small or too big.", "people_count": 1, "image_usage": 0, "written_date": "February 26, 2023", "product_index": 0}, {"title": "it works!", "rating": "5.0 out of 5 stars", "customer_id": "Shelby Vazquez", "body": "came in perfectly and works well", "people_count": 0, "image_usage": 0, "written_date": "March 4, 2023", "product_index": 0}, {"title": "Great mouse but short lifespan?", "rating": "4.0 out of 5 stars", "customer_id": "Jordan Reger", "body": "This mouse is a beautiful piece but it has weird scrolling issues, after barely a month? Worth every penny though.", "people_count": 0, "image_usage": 0, "written_date": "January 20, 2023", "product_index": 0}, {"title": "Wheel bounces up and down while scrolling after 4 month of normal utilization", "rating": "4.0 out of 5 stars", "customer_id": "François", "body": "All is in the title... scrolling is extremely frustrating as the scroll wheel bounces up and downs. It started just 4 months after buying a new model. I thought Razer was a premium brand for mouse, how disappointing. First and last time i buy a razer mouse[edit]Well, I cried wolf too quick. I went to the razer forum and a proposed solution was to blow some air to remove dust, if any. I don't have compressed air, so I just blow some air with my mouth, and it fixed the issue. So 4 stars, the mouse is good. I just hope razer would be more cautious with dust infiltration, but after all that's a budget mouse in their catalog... can't ask too much.", "people_count": 19, "image_usage": 0, "written_date": "October 29, 2022", "product_index": 0}], [{"title": "Love it", "rating": "5.0 out of 5 stars", "customer_id": "Kaleb", "body": "For someone who's a big gamer, this is one of my favorite brands to buy from. I love how their mouses and keyboards are especially. For the price, it's really good quality. Very light and easy to hold. I wish the cable wasn't so annoying but it's just something that needs fixing on my end.Definitely a great buy for the price.", "people_count": 2, "image_usage": 0, "written_date": "January 31, 2023", "product_index": 0}, {"title": "Good", "rating": "5.0 out of 5 stars", "customer_id": "Samir", "body": "Excelent", "people_count": 0, "image_usage": 0, "written_date": "March 5, 2023", "product_index": 0}, {"title": "Excellent budget mouse", "rating": "5.0 out of 5 stars", "customer_id": "Zach", "body": "Great mouse with a nice large size.", "people_count": 0, "image_usage": 0, "written_date": "February 22, 2023", "product_index": 0}, {"title": "HUGE MOUSE", "rating": "4.0 out of 5 stars", "customer_id": "iyyene", "body": "this mouse is really big for my hands, for reference i am 5’0…i should’ve gotten the mini🥲 it’s cute tho!", "people_count": 1, "image_usage": 1, "written_date": "January 3, 2023", "product_index": 0}, {"title": "Great mouse for price", "rating": "4.0 out of 5 stars", "customer_id": "Yeahwhynotkid", "body": "It’s really nice and I like how it feels the only thing I don’t like is how bright the rgb is but other than that’s it’s really nice", "people_count": 0, "image_usage": 1, "written_date": "December 23, 2022", "product_index": 0}, {"title": "this item changed my life", "rating": "5.0 out of 5 stars", "customer_id": "Aydin atwater", "body": "i am a 23 year old male, i was recently fired from my job, i was working on my computer when my mouse broke up with me so i bought this one with my finger instead of my ex-mouse, once this beauty came i was instantly changed, she told me the way to her heart-drive, and i was instantly in love, as soon as my boss saw on my myspace story that i got a new wife he instantly hired me back with a 30% pay raise, my mother adopted me back into the family and my father came back with the milk, i am a new man thanks to sheila my mouse, i am changed for the better, my dead dog came back from the afterlife along with my grandparents, my little sister twice removed found it in her heart to love me again, kanye west was un-cancelled and gave me a big ol' kiss on the cheek, j-cole arose from the dead, pop smoke is still dead, i am a happier man, me and sheila have been together for 56 years going on our 170th aniversery, anyway, 23 year old man signing out.", "people_count": 53, "image_usage": 0, "written_date": "November 10, 2022", "product_index": 0}, {"title": "Average mouse.", "rating": "3.0 out of 5 stars", "customer_id": "stevenn @ Socal Area", "body": "The mouse was good for over 10 days, after that the wheel is very squeaky and loudly at night. I have to return products back to Amazon.", "people_count": 0, "image_usage": 0, "written_date": "April 7, 2023", "product_index": 0}, {"title": "Broken scroll wheel - this mouse does not meet the quality of the brand.", "rating": "3.0 out of 5 stars", "customer_id": "Jason", "body": "Often, scrolling down will scroll up randomly. I noticed it whilst scrolling YouTube shorts. My old deathadder did not do this. The issue kept getting worse until its a coinflip on what a scroll up or down will actually do. Apparently this is a well-documented issue.", "people_count": 2, "image_usage": 0, "written_date": "March 27, 2023", "product_index": 0}, {"title": "The mouse is great, but the wheel stopped working after just a few months", "rating": "3.0 out of 5 stars", "customer_id": "A. Holzmeist", "body": "I've used to by Logitech mouses for many years, then their mouses stopped working after a year or so... sometimes it is the wheel sometimes is double clicks, no middle click, etc... I decided to give Razer a chance after many years that I had one (same issue as the logitech), and this time it lasted much less than previous times... it's sad how the mouses are lastingless and less these days...", "people_count": 0, "image_usage": 0, "written_date": "March 11, 2023", "product_index": 0}, {"title": "No Rubber", "rating": "3.0 out of 5 stars", "customer_id": "CJ", "body": "Very lightweight, very plasticky, cheap feeling mouse. I now understand why the price was so low. Would be great for use in a kiosk-like setting. Very accurate point-and-click and will get the job done in day to day operation. No rubber to speak of as described in the product description . Will definitely upgrade.", "people_count": 0, "image_usage": 1, "written_date": "March 22, 2023", "product_index": 0}], [{"title": "pretty decent", "rating": "3.0 out of 5 stars", "customer_id": "nat", "body": "well, i got this december 2022 and a few months ago the scroll wheel broke. whenever i scroll it just, messes up completely and its actually really annoying and im looking to get a new mouse, other than that i dont see an issue with it at all.", "people_count": 1, "image_usage": 0, "written_date": "March 23, 2023", "product_index": 0}, {"title": "Not Quite the Thing I Needed", "rating": "3.0 out of 5 stars", "customer_id": "L. Love", "body": "The good news is that the product is sleek, tracks well, and has great ergonomics. I would rate it a genuinely great buy except that the left-side, rearward (away from the cable) button does not work. Hmm, I thought maybe it needs programming, so I downloaded the app. A bit clunky, it recognized the button being pushed, but offered no way to switch its function with a working button. Clearly from the software, it is not defective, it is just unrecognized. I did some online searches only to find this is a very common problem with this mouse - button 4 does not work. The suggestions were the usual, unplug and replug - to no avail. Tried on a different machine, still not recognized.If you do not need that particular button, treat this as a 5/5 review. If you do, there really seems to be no guarantee you can make that button work. Caveat: this is on a high-end Windows gaming PC - your mileage may vary on some other platform.", "people_count": 0, "image_usage": 0, "written_date": "December 28, 2022", "product_index": 0}, {"title": "Good Mouse, Gets the Job Done", "rating": "5.0 out of 5 stars", "customer_id": "Alexander Caswell", "body": "I'm currently away from home due to my job, and i'll be away from home often because of it. So i needed a A mouse, and this one was the perfect fit.", "people_count": 0, "image_usage": 0, "written_date": "January 30, 2023", "product_index": 0}, {"title": "An oldie but a goodie", "rating": "5.0 out of 5 stars", "customer_id": "Ss", "body": "Always like this mouse.Works great!", "people_count": 0, "image_usage": 0, "written_date": "February 16, 2023", "product_index": 0}, {"title": "Gaming", "rating": "4.0 out of 5 stars", "customer_id": "Angelia evans", "body": "I love it, it just bigger then i expected but overall good for games", "people_count": 0, "image_usage": 0, "written_date": "December 19, 2022", "product_index": 0}, {"title": "Esta bueno", "rating": "4.0 out of 5 stars", "customer_id": "Annes", "body": "A mi hijo le gustó, buena compra", "people_count": 0, "image_usage": 0, "written_date": "December 31, 2022", "product_index": 0}, {"title": "To much money", "rating": "3.0 out of 5 stars", "customer_id": "djj", "body": "I’m not a gamer but my godson told me to buy this mouse for control.", "people_count": 0, "image_usage": 0, "written_date": "April 4, 2023", "product_index": 0}, {"title": "Worked good for a while.", "rating": "4.0 out of 5 stars", "customer_id": "Amazon Customer", "body": "Bought this about a year or so ago 2 of them for me and my S.O, worked great. The last month for some reason when I scroll (fast or slow) the scroll wheel will go down for a bit then immediately scroll back up a bit then down and up. My S.O's went at the same time, I've cleaned it and tried trouble shooting, I just assume its faulty, but still a good deal.", "people_count": 6, "image_usage": 0, "written_date": "October 22, 2022", "product_index": 0}, {"title": "So good I bought it twice", "rating": "4.0 out of 5 stars", "customer_id": "kaleb", "body": "Had a older black edition since 2016 (still works) got the white edition and the size and reliability is still wonderful", "people_count": 1, "image_usage": 0, "written_date": "December 2, 2022", "product_index": 0}], [{"title": "Turn off any macros you have", "rating": "4.0 out of 5 stars", "customer_id": "Inertia", "body": "The mouse is great and not too much of a fan for the non braided cable but its a good mouse for the price. However, if you dont delete any of the macros you made they go off at random times even though you turned the macro feature off in synapse. Of course this could only be a problem for me as though I could have a faulty feature in the mouse or software but be aware.", "people_count": 4, "image_usage": 0, "written_date": "October 17, 2022", "product_index": 0}, {"title": "Fits just right!!!!!", "rating": "5.0 out of 5 stars", "customer_id": "Ethan", "body": "Right as I got it out the box I put in on my mouse pad and instantly my hand perfectly fits the mouse right size the left click and right have a indent so your fingers fit it perfectly and it's light so you can move fast for games like cod but over all its very good ༼ つ ◕_◕ ༽つ", "people_count": 1, "image_usage": 0, "written_date": "January 12, 2023", "product_index": 0}, {"title": "Muy bueno", "rating": "5.0 out of 5 stars", "customer_id": "Julián Aponte", "body": "De muy buena calidad, muy estable y preciso. Lo mejor es el tamaño, adecuado para un hombre adulto.", "people_count": 0, "image_usage": 0, "written_date": "February 3, 2023", "product_index": 0}, {"title": "Squeaky Wheel", "rating": "3.0 out of 5 stars", "customer_id": "seamonkey10", "body": "Seems like a good mouse, but the wheel squeaks like nails on a chalkboard, which leaves me with the options of taking it apart and fixing the wheel, shooting WD-40 inside, or returning it, all of which are a pain because I just want a simple mouse that works. Is there QA to make sure the wheels are greased before sending these out?", "people_count": 0, "image_usage": 0, "written_date": "February 27, 2023", "product_index": 0}, {"title": "Nice mouse", "rating": "4.0 out of 5 stars", "customer_id": "Marissa Estrada", "body": "Works perfectly fine. I didn't realize I couldn't change the color of the lights though. I know on other models you can but for this one, green is all you get.", "people_count": 0, "image_usage": 0, "written_date": "November 22, 2022", "product_index": 0}, {"title": "Item not the same as the old one with same model from official website", "rating": "4.0 out of 5 stars", "customer_id": "Pascal", "body": "I'm not able to verify if it's new model or not authentic. Since the wire is rubber wrap not nylon(I've also attached the picture of my current mouse brought 1year ago with same model). And small details are different.Also, they are different weights.The Deathadder essential brought from rayzer website is 123g currentlyThe Deathadder essential brought from here weight is 128g.Amazing! I wear and tear 5g of material from the old mouse after 1 year!But hey, it's 4 stars for its current status, it's good to use.", "people_count": 3, "image_usage": 1, "written_date": "September 22, 2022", "product_index": 0}, {"title": "As advertised", "rating": "5.0 out of 5 stars", "customer_id": "crasher", "body": "Mouse working like a mouse should :-)", "people_count": 0, "image_usage": 0, "written_date": "February 8, 2023", "product_index": 0}, {"title": "Good but has issues", "rating": "3.0 out of 5 stars", "customer_id": "William", "body": "The mouse initially seems good. The ergonomic fit seems too ergonomic to the point it feels weird. But that is more personal preference. However the page lies about the \"rubberized side grips\" there is no rubber, it just textured plastic, the same that is on the whole mouse. Overall basic gaming mouse does what is intended but misleading informaction.", "people_count": 0, "image_usage": 0, "written_date": "February 23, 2023", "product_index": 0}, {"title": "Buttons are too sensitive", "rating": "3.0 out of 5 stars", "customer_id": "AZ Gardener", "body": "I keep accidentally right clicking in factorio and deleting things. Never happened with any other mouse.", "people_count": 0, "image_usage": 0, "written_date": "March 27, 2023", "product_index": 0}, {"title": "Premium quality", "rating": "5.0 out of 5 stars", "customer_id": "Logan", "body": "1. Very good gamming mouse for the price2. Premium quality3. Works good for gaming4. Recommend this mouse for gammers that are on budgets", "people_count": 0, "image_usage": 0, "written_date": "January 26, 2023", "product_index": 0}], [{"title": "big", "rating": "3.0 out of 5 stars", "customer_id": "emily", "body": "this mouse is nice and clean looking but it's very big and hard to grip if you have smaller hands", "people_count": 0, "image_usage": 0, "written_date": "March 24, 2023", "product_index": 0}, {"title": "Good mouse", "rating": "4.0 out of 5 stars", "customer_id": "Connor", "body": "Decent mouse. Everything works. Only thing is I downloaded the software and my pc started lagging. Games weren’t as smooth and it froze a lot. It also blocked some of the computers features. I have an Asus Zephyrus rog m15 and turbo mode would not turn on. Uninstalled the software and the games ran smooth again and turbo mode turned back on. Good mouse otherwise", "people_count": 0, "image_usage": 0, "written_date": "October 12, 2022", "product_index": 0}, {"title": "Smooth and lightweight", "rating": "5.0 out of 5 stars", "customer_id": "macka jezis", "body": "Mouse is large but still comfortable, very lightweight and good for gaming/general computer use. The only color the LED comes in is white but that's fine since I don't like flashy lights anyways. Overall a good and cheap upgrade from my former chinese malware mouse", "people_count": 0, "image_usage": 0, "written_date": "January 10, 2023", "product_index": 0}, {"title": "My gamer husband really likes this mouse", "rating": "5.0 out of 5 stars", "customer_id": "iliketomakestuff", "body": "My husband needed something simple and light, and this fits the bill.", "people_count": 0, "image_usage": 0, "written_date": "January 31, 2023", "product_index": 0}, {"title": "Great", "rating": "5.0 out of 5 stars", "customer_id": "John A", "body": "Like a charm!", "people_count": 0, "image_usage": 0, "written_date": "February 7, 2023", "product_index": 0}, {"title": "It is a mid mouse", "rating": "3.0 out of 5 stars", "customer_id": "Jackson O", "body": "I like this mouse but it is all plastic and has only two programmable buttons. But It is a good product for what I paid for. I would not recommend this if it is for anything other than gaming though. The mouse sensitivity is way too high for other uses. I am still happy with the purchase I made.", "people_count": 0, "image_usage": 0, "written_date": "February 10, 2023", "product_index": 0}, {"title": "good quality for the price <3", "rating": "5.0 out of 5 stars", "customer_id": "Savannah", "body": "would definitely recommend!", "people_count": 0, "image_usage": 0, "written_date": "February 7, 2023", "product_index": 0}, {"title": "The scroll wheel is squeaky", "rating": "4.0 out of 5 stars", "customer_id": "Thomas ghilay", "body": "The scroll wheel is very squeaky.", "people_count": 1, "image_usage": 0, "written_date": "December 3, 2022", "product_index": 0}, {"title": "Could use better speed adjustment", "rating": "4.0 out of 5 stars", "customer_id": "Bio Bane", "body": "Great product overall. However there really isn’t a great or easy way to adjust the cursor speed.", "people_count": 0, "image_usage": 0, "written_date": "November 11, 2022", "product_index": 0}, {"title": "Mac buyers beware- Control software not compatible with MacOS...", "rating": "3.0 out of 5 stars", "customer_id": "efm", "body": "It's a fine mouse-works right out of the box on my MacBook Pro. However, the in-house mouse control software (the bells & whistles part) is not available for the Mac, and that little tidbit was not apparent on Amazon or Razer's website. Another missing piece is the interface- I have a Thunderbolt Mac. Had to buy an adapter. That would have been nice to know. Should have stuck with a known- Logitech's mouse software is available for MacOS. Alas...", "people_count": 1, "image_usage": 0, "written_date": "January 21, 2023", "product_index": 0}]]