[[{"title": "Great product for the price!!", "rating": "5.0 out of 5 stars", "customer_id": "Kyad", "body": "The Goods:Accurate and easy-to-use: The digital display is easy to read and the scale is accurate to 0.05lb/0.02kg, making it perfect for tracking changes in weight and body fat. The Bluetooth connectivity feature allows me to sync my data to the Etekcity app, making it easy to track my progress and set goals. The app is user-friendly and provides detailed insights into my body composition, including muscle mass and BMI.Slim and Sleek Design: The scale is well-constructed and can support up to 400lb. Its slim and sleek design makes it easy to store in my bathroom and its automatic on/off feature helps save battery life.Strongly Recommended: Overall, I would highly recommend the Etekcity Smart Scale to anyone who wants to track their body composition and monitor their progress over time. It's an excellent product that is accurate, easy to use, and packed with features.The Bads:Inaccurate on Soft Surfaces: It should definitely be used on a hard surface, as even our very low-pile carpeting altered the results.Careful Placement: When you step on the scale, don't step on the edge instead of on the metal contact points or the scale will flip up on you.Connectivity Issues: Once it was connected, it is easy to use and keep track of the results, but connecting with my smartphone was not that straightforward, and I had to read the instructions carefully. I would make sure that you have Bluetooth turned on before you get on the scale so you can have it record your results.", "people_count": 20, "image_usage": 0, "written_date": "March 12, 2023", "product_index": 3}, {"title": "Love this bathroom scale", "rating": "5.0 out of 5 stars", "customer_id": "Book Worm", "body": "I absolutely love this bathroom scale. My old scale broke and I needed new one. I chose this one partly because of the name. I have the kitchen scale for several years. I also love the features on this scale, I haven't used all the features yet but only had the scale a few days. My husband passed away a couple of months ago and I haven't been eating much. I decided I needed to check my weight as I can't afford to lose weight. My scales weren't giving me a good reading, kept fluctuating. So got this scale. Easy to set up and pair with my cellphone. So much information with the reading. I make sure to weigh myself at the same time every morning. I highly recommend this scale. You can set it for multiple users so the family can keep track of their individual weights. It's very accurate, and easy to read the results.", "people_count": 10, "image_usage": 0, "written_date": "March 30, 2023", "product_index": 3}, {"title": "Great Purchase", "rating": "5.0 out of 5 stars", "customer_id": "A Richardson", "body": "I have had one other digital scale that was a poor investment mainly because it quit working to soon. I went back to the old style scales that required a continues zero reset for accurate weights. I came back to the digital scales with my purchase of this Elekcity Smart Scale and all I can say is there is a tremendous improvement over what was available before and this scale has provided information that if needed I can present it to a doctor via my phone app. There is no longer a need to reset my scale each time I use it and for me as a senior citizen is a big relief not having to bend over all the time. Additionally, it looks good in our bathroom. If you are truly looking for a dependable scale this is one I can recommend you purchase.", "people_count": 5, "image_usage": 0, "written_date": "March 19, 2023", "product_index": 3}, {"title": "Good scale", "rating": "4.0 out of 5 stars", "customer_id": "Derek", "body": "I've been using this scale for about 2 weeks now. It is consistent and accurate. I step on the scale multiple times and it reads the same. I've compared this measurement against an analog scale at my gym and it is the same or very close.I like the app as it allows me to keep a history. Also tracks other measurements such as hydration, BMI, etc. I think these measurements are using algorithms but still probably roughly accurate, so useful.The only problem I've had is that when the scale turns on, it doesn't immediately connect to Bluetooth and my app. I have to step on the scale a couple times for it to connect. Other than that, I'm very happy with this purchase.", "people_count": 1, "image_usage": 0, "written_date": "April 5, 2023", "product_index": 3}, {"title": "Accurate!", "rating": "5.0 out of 5 stars", "customer_id": "Honest Review", "body": "I recently purchased the Etekcity Smart Scale and I am extremely impressed with its accuracy and ease-of-use. The digital display is easy to read and the scale is accurate to 0.05lb/0.02kg, making it perfect for tracking changes in weight and body fat.I also love the Bluetooth connectivity feature which allows me to sync my data to the Etekcity app, making it easy to track my progress and set goals. The app is user-friendly and provides detailed insights into my body composition, including muscle mass and BMI.The scale is well-constructed and can support up to 400lb. Its slim and sleek design makes it easy to store in my bathroom and its automatic on/off feature helps save battery life.Overall, I am extremely satisfied with my purchase of the Etekcity Smart Scale and would highly recommend it to anyone looking for an accurate and easy-to-use body scale.", "people_count": 4, "image_usage": 0, "written_date": "March 8, 2023", "product_index": 3}, {"title": "I love the app for this!", "rating": "5.0 out of 5 stars", "customer_id": "Lindsi Garand", "body": "I read soooo many reviews for different scales on here, and this one had the best reviews. Now that I’ve had this scale for a little while, I understand why. It’s very easy to read with the LED numbers. It’s awesome to have all the data upload to an app that can keep track of everything. It does my weight, BMI, visceral fast, and body fat %. You can make goals you want to hit throughout the week and track your progress. You can have multiple users on the app as well. DEFINITELY recommend.", "people_count": 1, "image_usage": 0, "written_date": "April 2, 2023", "product_index": 3}, {"title": "Actually Accurate!", "rating": "5.0 out of 5 stars", "customer_id": "Yummymocha", "body": "It came undamaged and with measurement tape. It measures the correct weight and more. Earlier I made the mistake of placing the scale on carpet so it made the invalid weight. I decided to reread the instructions and realized I didn’t place the scale on a flat surface. Having me change my location to the bathroom floor. The correct weight appeared. I love this scale! And the app that also gives advice on how to lose weight in different methods.", "people_count": 1, "image_usage": 1, "written_date": "April 6, 2023", "product_index": 3}, {"title": "What can I say the analytics part in the app sucks, scale is good", "rating": "4.0 out of 5 stars", "customer_id": "Trina", "body": "Skills. Decent like the scale although all the analytics or different feedback, it gives you is from my experience basically BS! It doesn’t not account for people who are muscular it assumes we’re all very scrawny and just packing around a bunch of extra fat so the minute you get muscle you will be overweight if you try to build muscle your metabolic Angel double so just don’t pay attention to anything but your weight in your body and let there a little criteria is the talk about go in one ear and out the other because it’s BS unless of course you are somebody who has very little muscle and continue to gain fat and have no control over your diet lifestyle her body that may help you, but most of us in shape it doesn’t mean much at all except this is accounting for the people who are still muscular at their age.", "people_count": 3, "image_usage": 0, "written_date": "March 16, 2023", "product_index": 3}, {"title": "Personal", "rating": "5.0 out of 5 stars", "customer_id": "uniquely kreated", "body": "I love this scale. I connect it to my phone. It gives thorough details about you such as BMI, body fat (subcutaneous and visceral), BMR, skeletal muscle percentage, and more. You can add multiple people, for those with families on a fitness journey. The app allows you to take accountability for your health by having challenges and sending notifications to your phone with you need to check your weight or commit to your challenge.", "people_count": 1, "image_usage": 0, "written_date": "April 3, 2023", "product_index": 3}, {"title": "Not when it’s cold", "rating": "4.0 out of 5 stars", "customer_id": "MrsJMc", "body": "I got this scale 3 weeks ago. It was easy to set up and I’ve had fun seeing all the data provided for both my husband and myself. After 2 weeks it stopped recording anything but weight first thing in the morning. I read the trouble shooting tips provided in the app and followed the instructions. Still no. I contacted support through the app and told them the steps I’d taken. They replied within 12 hours with a worthless answer telling me to do all the things I had already told them I had done.Then I figured it out. We have had a cold snap this week and the bathroom has been in the mid 50’s in the mornings. The sensors won’t read when that cold. The scale continued to work fine later in the day but not first thing. If I stand on the scale and warm up the sensors for a minute or two then step off and reweigh myself it will take all readings. My feet, fresh from an electric blanket cocoon, are warm enough to heat the sensors.Crazy but true.", "people_count": 21, "image_usage": 0, "written_date": "February 27, 2023", "product_index": 3}], [{"title": "Good scale just have to reconnect very often to app", "rating": "4.0 out of 5 stars", "customer_id": "Cheryl", "body": "Must have app to read findings as it only shows weight on the scale only. The app fails and doesn’t connect automatically where u have to open the app to reconnect. Not sure about other values such as water, protein, bone mass etc of how accurate it is. I drink at least 1/2 to 1 gallon of water a day to say my water is low. Protein is low? I’m eating enough protein. Not sure how it gets it’s measurements exactly. It’s a good scale though not sure about competitors if I used another one to see their results", "people_count": 0, "image_usage": 0, "written_date": "March 27, 2023", "product_index": 3}, {"title": "Like everything", "rating": "5.0 out of 5 stars", "customer_id": "Karen", "body": "If you want to find out more about your body and also keep track on your weight, this scale is awesome. I like the app too, as it offers many functions like diet plans, food tracking etc. I think that the app is one of the best health tracking apps and it's free! So if you are interested in keeping your body healthy, this scale is a must have!", "people_count": 1, "image_usage": 0, "written_date": "March 27, 2023", "product_index": 3}, {"title": "Must buy!!!", "rating": "5.0 out of 5 stars", "customer_id": "Alicia R.", "body": "Just got this scale today. Unboxed it and downloaded the app. This thing is amazing; especially for the price. The information it provides in awesome and it really motivates you to get in top of your fitness goals for sure. I did a video about it in social media and it drew a lot of attention and several people ended up purchasing it. Bottom line…just buy it!", "people_count": 0, "image_usage": 0, "written_date": "March 30, 2023", "product_index": 3}, {"title": "Excellent", "rating": "5.0 out of 5 stars", "customer_id": "Matticus", "body": "I recently purchased this digital body weight scale on Amazon, and I am very pleased with its accuracy and functionality. The scale is easy to use and provides accurate weight measurements in both pounds and kilograms. The digital display is clear and easy to read, and the scale itself is compact and lightweight, making it easy to store and transport. Overall, I am extremely satisfied with my purchase and would highly recommend this digital body weight scale to anyone in need of a reliable and accurate weighing device for monitoring their weight.", "people_count": 1, "image_usage": 0, "written_date": "March 17, 2023", "product_index": 3}, {"title": "Does what it is supposed to do", "rating": "5.0 out of 5 stars", "customer_id": "Buzzardlip", "body": "It is a nice looking, easy to move around scale that does more than I need it to. It should definitely be used on a hard surface, as even our very low-pile carpeting altered the results. When you step on the scale, don't do what I did the first time and step on the edge instead of on the metal contact points or the scale will flip up on you. That is NOT the scales fault - that was me being a doofus!It was easy to connect with my smartphone, but I would definitely read the instructions carefully. Once it was connected it is easy to use and keep track of the results. I would make sure if you are connecting to your smartphone that you have Bluetooth turned on before you get on the scale so you can have it record your results.Another thing I like about this scale is that the readout is easy to see and I don't have great eyesight so that is a major plus. Also, the scale is low enough that I can open and close the bathroom door without it hitting the scale. Your results may vary.", "people_count": 22, "image_usage": 0, "written_date": "February 24, 2023", "product_index": 3}, {"title": "Perfect scale", "rating": "5.0 out of 5 stars", "customer_id": "Roslyn Jones", "body": "Would repurchase as a gift. I haven’t checked out all the awesome phone connection pluses it has yet.Just giving pointers for weighing yourself on a scale1-Go to CVS or Walgreens or the doctors office to get weighed. Then go home and weigh yourself. This way, you know your weight is correct.2- When you wake up in the morning, go to the bathroom first, then weigh yourself before you drink or eat.3- NEVER weigh yourself throughout the day!!!! You will gain weight within the day that you will lose by morning (water weight)Some people weigh in daily and some weekly. Choose what is best for you. I personally prefer to weigh in daily. This way can check myself if I see it going in the wrong direction.Good luck", "people_count": 12, "image_usage": 0, "written_date": "March 5, 2023", "product_index": 3}, {"title": "Love the Bluetooth", "rating": "5.0 out of 5 stars", "customer_id": "Clayis30", "body": "I was worried at first that it may scratch easily; however, after dropping a knife on it at 3 am whilst making a sandwich, because I only bought this thing to remind myself I’m fat, it left no blemishes or grape jelly stains so pleasantly surprised to say the least.", "people_count": 2, "image_usage": 0, "written_date": "April 5, 2023", "product_index": 3}, {"title": "Strongly recommend!", "rating": "5.0 out of 5 stars", "customer_id": "Mia H", "body": "I absolutely love my Etekcity Smart Scale! It's not just a regular bathroom scale - it's a complete body composition monitor that gives me accurate readings of my weight, body fat, muscle mass, and BMI. The Bluetooth connectivity makes it super easy to track my progress and see how my body is changing over time.What I love most about this scale is the accuracy - it measures weight to the nearest 0.05lb and body fat to the nearest 0.02kg. This level of precision is truly amazing and gives me the confidence to know that I'm getting accurate readings.The scale is also very easy to use - simply step on and it gives you a quick and accurate reading. The display is large and easy to read, and the readings are very consistent. I also appreciate the fact that it has a weight capacity of up to 400lb, so it can accommodate people of all sizes.Overall, I would highly recommend the Etekcity Smart Scale to anyone who wants to track their body composition and monitor their progress over time. It's an excellent product that is accurate, easy to use, and packed with features. I give it a 5-star rating and would definitely recommend it in the future!", "people_count": 20, "image_usage": 0, "written_date": "February 13, 2023", "product_index": 3}, {"title": "Very accurate and easy to use. Love that it can weigh small objects (like my 11lb dog)!", "rating": "5.0 out of 5 stars", "customer_id": "MC", "body": "I like everything about this scale. It's lightweight, accurate, easy to use and even looks nice sitting in the kitchen. I can also weigh my small senior dog and keep track of his weight with this. Most scales aren't accurate with light objects (my dog is 11-12 pounds). Great scale, great price, totally recommend.", "people_count": 0, "image_usage": 0, "written_date": "March 28, 2023", "product_index": 3}, {"title": "As accurate as my doctor's office scale!", "rating": "5.0 out of 5 stars", "customer_id": "E. Schmidt", "body": "We were looking for an easy to use scale that is accurate. After searching Amazon, comparing numerous scales, and reading reviews, I decided that this scale looked like it would give us what we needed. I use it daily, and it shows increments in 1/10 pounds. I did a comparison between it and the one used at my doctor's office when I went in for my physical this past week. Wearing the same attire, the difference was about 2/10 of a pound - can't ask for much better than that. The scale's Bluetooth connectivity to my phone is very convenient as it syncs with multiple apps.Highly recommend this scale!", "people_count": 5, "image_usage": 0, "written_date": "March 4, 2023", "product_index": 3}], [{"title": "Super easy set up", "rating": "5.0 out of 5 stars", "customer_id": "Daniel G Wood", "body": "Easy to follow directions and set up via QR code. Lots of different data is available. Now there’s no reason for me to not lose weight… Right?UPDATE: sometimes in the morning, it won’t take a data reading. It just reads my weight. I realize that if I put some lotion on my feet, then it will take a reading correctly.", "people_count": 0, "image_usage": 0, "written_date": "March 24, 2023", "product_index": 3}, {"title": "BEST EVER!", "rating": "5.0 out of 5 stars", "customer_id": "Naeysha S", "body": "I love this scale so much! It’s very bougie in my opinion because you can set up so much on the apps. It allows you to have multiple users as well to calculate your weight & its history & recommendations.", "people_count": 0, "image_usage": 0, "written_date": "March 31, 2023", "product_index": 3}, {"title": "AMAZING", "rating": "5.0 out of 5 stars", "customer_id": "Karly Livermore", "body": "This is an incredible scale. The multitude of tracking of numbers go straight to the app on the phone and you are able to track your results over time. I absolutely love it! And it’s a cute and light weight design, in addition to being affordable! Would 100% recommend!", "people_count": 0, "image_usage": 0, "written_date": "March 28, 2023", "product_index": 3}, {"title": "Good value and accurate.", "rating": "5.0 out of 5 stars", "customer_id": "Leah K. Grittner", "body": "I love this scale. I like the app. I think it is important to measure in order to achieve goals. I feel like scale and app would help anyone succeed. Great price and I feel like it is great tech.", "people_count": 0, "image_usage": 0, "written_date": "April 2, 2023", "product_index": 3}, {"title": "AMAZING!!", "rating": "5.0 out of 5 stars", "customer_id": "Taylor Ry", "body": "This is the best weight scale i've had in YEARS! The app is the easiest thing to setup even though I was skeptical at first. The app breaks down everything you'd need to know about your body. I know people that pay big money to find out their body fat percentage and yet it's so easily accessible to me. Even within the app you clicking on the subcategories such as your BMR, Metabolic Age, as well as many more useful things such as water weight, muscle mass, even how much protein is stored in your body at the moment. If you're really wanting to get into tracking your body and how it works i'd recommend getting this scale as well as seeing a dietitian, both of these together will put you up for success!!!!", "people_count": 8, "image_usage": 0, "written_date": "February 20, 2023", "product_index": 3}, {"title": "It works", "rating": "5.0 out of 5 stars", "customer_id": "Shanadora D.", "body": "I love this product it 💯 % works and i love the fact that the whole family can use it. I have lost 15lbs since I got this product", "people_count": 0, "image_usage": 0, "written_date": "April 8, 2023", "product_index": 3}, {"title": "Love this scale!", "rating": "5.0 out of 5 stars", "customer_id": "Queenfancypants", "body": "Got this model to replace a different Etekcity scale, and it’s great. Easy to set up, pairs seamlessly with my phone and the scale’s accuracy and continuity are both very solid. The app is fantastic, not glitchy whatsoever and has some helpful features like a food diary/logger, recipe suggestions and goal tracking. It’s also easy to sync the scale up to other apps, as there are a lot of customizable options in the app settings.Not much more you can ask for for the money. Great value.", "people_count": 1, "image_usage": 0, "written_date": "March 11, 2023", "product_index": 3}, {"title": "Love all the info it gives", "rating": "5.0 out of 5 stars", "customer_id": "Nicole", "body": "This scale +corresponding app gives you a ton of info! It helps you create wellness plans, tracks calories, muscle mass, water level, BMI and everything! Low cost for great item!", "people_count": 0, "image_usage": 0, "written_date": "April 7, 2023", "product_index": 3}, {"title": "Great family scale", "rating": "5.0 out of 5 stars", "customer_id": "KimB", "body": "Our whole family of 5 use this scale to stay on our fitness and health tracks. 2 of our sons joined their school wrestling team this year and this has been wonderful for them to accurately maintain their weight. I find it easy to sync to the phone app via Bluetooth and find all the information it provides within the app helpful. We highly recommend", "people_count": 0, "image_usage": 0, "written_date": "March 14, 2023", "product_index": 3}, {"title": "Works great. Exactly as I would have wanted.", "rating": "5.0 out of 5 stars", "customer_id": "Martin", "body": "Works well and much better than my last scale. My impression is that it is consistent, reliable and reassuringly consistent. The app works very well. It is also small, so easy to put out of the way if you need the space.", "people_count": 0, "image_usage": 0, "written_date": "March 22, 2023", "product_index": 3}], [{"title": "Great great product!", "rating": "5.0 out of 5 stars", "customer_id": "Nicholas Margiotta", "body": "Love love love this scale. I already used the app for some outlets I have and the scale just integrated so well, would recommend!!", "people_count": 0, "image_usage": 0, "written_date": "April 2, 2023", "product_index": 3}, {"title": "Doesn't connect automatically", "rating": "4.0 out of 5 stars", "customer_id": "clay282", "body": "The product is good. The 3 triple A batteries instead of the flat type, are great. What I don't like is the app. It doesn't just update the weight each time I weigh. If I want to keep track, I have to go find my phone, open the app and then update it. Right out of the shower, naked, getting ready for work... the last thing I want to do is fit in some stupid app that requires me to open my phone and sync it.", "people_count": 2, "image_usage": 0, "written_date": "March 19, 2023", "product_index": 3}, {"title": "Beautiful design.", "rating": "5.0 out of 5 stars", "customer_id": "Grace Xenios", "body": "I used to scale every morning. It is very accurate and classy looking in my bathroom. I highly recommend buying this product.", "people_count": 0, "image_usage": 0, "written_date": "April 4, 2023", "product_index": 3}, {"title": "Still figuring out the app...", "rating": "4.0 out of 5 stars", "customer_id": "Elena Bertolini", "body": "Haven't messed with the app much but I'm happy with the options and everything it shows you. This was a great purchase I love it how tracks my weight and it's easy to connect to Bluetooth.", "people_count": 0, "image_usage": 0, "written_date": "April 6, 2023", "product_index": 3}, {"title": "Scales seems inconsistent", "rating": "4.0 out of 5 stars", "customer_id": "jessica", "body": "The digital scale I had broke so I searched amazon and picked this one because it had high ratings and decent reviews. The scale seems a bit inconsistent, you weigh yourself, step off, step back on and get a very different weight. One of the times it was a few pound difference other times it was only a few ounces. The mobile app is easy to navigate. Going to continue using the scale until I can find a better option.", "people_count": 0, "image_usage": 0, "written_date": "March 16, 2023", "product_index": 3}, {"title": "Good scale", "rating": "5.0 out of 5 stars", "customer_id": "Roman Zaets", "body": "Honestly I would take results with a grain of salt… but it’s cool to trend out numbers", "people_count": 0, "image_usage": 0, "written_date": "April 2, 2023", "product_index": 3}, {"title": "Easy set up and app use", "rating": "5.0 out of 5 stars", "customer_id": "Amy Strouse", "body": "Very easy to set up and connect. Great for tracking progress to have in the app", "people_count": 0, "image_usage": 0, "written_date": "April 4, 2023", "product_index": 3}, {"title": "Love, love, love!", "rating": "5.0 out of 5 stars", "customer_id": "Jane Geggus", "body": "I may not like the numbers on the scale but that’s not the scales fault lol This is the best scale on the market. You know it is accurate, the numbers are clear and easy to read (even for people who usually need glasses can see these numbers), and it’s connected to my phone. Easy set up on my phone and easy way to use.", "people_count": 0, "image_usage": 0, "written_date": "March 9, 2023", "product_index": 3}, {"title": "Easy to use and fun to track progress", "rating": "5.0 out of 5 stars", "customer_id": "JUDY", "body": "It lets me know what I need to work on. I’ve never checked on accuracy but it’s fun to watch my statistics improve. Keeps me on the right track.", "people_count": 0, "image_usage": 0, "written_date": "March 25, 2023", "product_index": 3}, {"title": "Gets the job done", "rating": "5.0 out of 5 stars", "customer_id": "Andy Perez", "body": "Accurate scale that is slim and well designed. I like the electric display a lot. It has app and Bluetooth connectivity options. I have not used those so I can’t comment. I just use it to see my weight when I need to.", "people_count": 0, "image_usage": 0, "written_date": "March 19, 2023", "product_index": 3}], [{"title": "Lots of information", "rating": "4.0 out of 5 stars", "customer_id": "Tyree Bray", "body": "The app gives lots of information. Seems very accurate. Set up was easy. It does lose connection to my phone every now and then. App offers meal plans", "people_count": 0, "image_usage": 0, "written_date": "April 3, 2023", "product_index": 3}, {"title": "Keeps track of my progress", "rating": "5.0 out of 5 stars", "customer_id": "Kaley Faye", "body": "I purchased this scale just so I could check my weight as often as I wanted in the privacy of my own home. I was thrilled to discover that when you use the ap, it keeps track of your weight and tells you how you are progressing. No more guessing that a 6 pack of beer a night is making my husband rounder. I have proof.Jokes aside, I would buy this scale again in a heartbeat.", "people_count": 2, "image_usage": 0, "written_date": "March 3, 2023", "product_index": 3}, {"title": "Excellent scale", "rating": "5.0 out of 5 stars", "customer_id": "Tony", "body": "I love being able to easily keep track of my weight so easily. It’s a great tool for my fitness journey. I wanted a scale that could tell me my muscle mass gain/loss over time and this does so much more. A very affordable price and sleek design. Also great for weighing shipping packages. I definitely recommend this.", "people_count": 1, "image_usage": 0, "written_date": "March 7, 2023", "product_index": 3}, {"title": "Works great!", "rating": "5.0 out of 5 stars", "customer_id": "Sam Ritter", "body": "Bought this for my fitness journey. I wish it connected to my primary fitness app but I'm not going to complain. The app works well and does what it's supposed to and the scale works just fine and likes up with the scale at the gym. Good buy.", "people_count": 0, "image_usage": 0, "written_date": "March 13, 2023", "product_index": 3}, {"title": "Awesome", "rating": "5.0 out of 5 stars", "customer_id": "Kendal M Correll", "body": "This is probably the best scale I’ve ever owned! Super glad I bought it!", "people_count": 0, "image_usage": 0, "written_date": "April 7, 2023", "product_index": 3}, {"title": "Works as expected.", "rating": "5.0 out of 5 stars", "customer_id": "Alyson W", "body": "Love the app to track weights easily. Even works well for tracking the little kids weights. It’s not bulky and the white looks good in the bathroom. Readings seem to be accurate.", "people_count": 0, "image_usage": 0, "written_date": "March 27, 2023", "product_index": 3}, {"title": "Awesome", "rating": "5.0 out of 5 stars", "customer_id": "Purple_reign98", "body": "I purchased this scale with the intent of having more information for my weight loss journey! It connected to Bluetooth easy. Definitely a great upgrade from that basic scale with no info to one that gives you all the info to help live a healthier lifestyle!", "people_count": 0, "image_usage": 0, "written_date": "March 18, 2023", "product_index": 3}, {"title": "Smart scale", "rating": "5.0 out of 5 stars", "customer_id": "N.Y. Smart shopper 44", "body": "It works good .. Replace my older one this is a nice scale that should last for a few years I recommend", "people_count": 0, "image_usage": 0, "written_date": "March 27, 2023", "product_index": 3}, {"title": "Im in love", "rating": "5.0 out of 5 stars", "customer_id": "AnaMarie Matt", "body": "This scale is amazing! I love the features on the app as well. I recommend getting this scale for more than just weight tracking. Its amazing!", "people_count": 0, "image_usage": 0, "written_date": "March 24, 2023", "product_index": 3}, {"title": "Fun!", "rating": "5.0 out of 5 stars", "customer_id": "Chris Andrews", "body": "Scale works great and I really enjoy seeing my progress on the app", "people_count": 0, "image_usage": 0, "written_date": "April 2, 2023", "product_index": 3}], [{"title": "Very nice and easy to use", "rating": "5.0 out of 5 stars", "customer_id": "Taryn Higgins", "body": "This scale is awesome. It’s very easy to set up with the Bluetooth. It also updates in real time on your phone while you’re weighing in. It’s very nice and a very affordable for the benefits included.", "people_count": 0, "image_usage": 0, "written_date": "March 23, 2023", "product_index": 3}, {"title": "Works great", "rating": "5.0 out of 5 stars", "customer_id": "RandyJ", "body": "I'm trying to lose some weight and being able to measure progress is important. I have not used the app or Bluetooth so I did not rate them.", "people_count": 0, "image_usage": 0, "written_date": "March 25, 2023", "product_index": 3}, {"title": "Great scale", "rating": "5.0 out of 5 stars", "customer_id": "Amazon Shopper", "body": "This product works as it should and all the data it collects in the app is easy to understand and help you track your goals.", "people_count": 0, "image_usage": 0, "written_date": "March 24, 2023", "product_index": 3}, {"title": "Excellent quality", "rating": "5.0 out of 5 stars", "customer_id": "Joylynne M Aviles", "body": "Love how sturdy but light it is. No problems and very accurate.", "people_count": 0, "image_usage": 0, "written_date": "April 6, 2023", "product_index": 3}, {"title": "Loving it", "rating": "5.0 out of 5 stars", "customer_id": "Adam Cummings", "body": "Good price and does a lot on the free app. It’s a good deal for what you need it to do. I’d recommend it", "people_count": 0, "image_usage": 0, "written_date": "March 31, 2023", "product_index": 3}, {"title": "Get it", "rating": "5.0 out of 5 stars", "customer_id": "Vikram N Yeldandi", "body": "Must have device if you wanted to get lean and fit!", "people_count": 0, "image_usage": 0, "written_date": "April 5, 2023", "product_index": 3}, {"title": "Love it.", "rating": "5.0 out of 5 stars", "customer_id": "WittleIndianGirl", "body": "Seems very accurate. It works just as well as the one we have at my work. I love how I can keep track with that and my diet.", "people_count": 0, "image_usage": 0, "written_date": "March 20, 2023", "product_index": 3}, {"title": "Accurate scale", "rating": "5.0 out of 5 stars", "customer_id": "UGADAWG4LIFE", "body": "Love this scale, easy to install and use, accurate", "people_count": 0, "image_usage": 0, "written_date": "April 6, 2023", "product_index": 3}, {"title": "Effective", "rating": "5.0 out of 5 stars", "customer_id": "Terri", "body": "Product is as expected. Love the app option and you can have more than one user tracking the entire family", "people_count": 0, "image_usage": 0, "written_date": "March 26, 2023", "product_index": 3}, {"title": "The scale is not accurate", "rating": "1.0 out of 5 stars", "customer_id": "TexasGirl", "body": "Initially, I was excited to use this scale because of the added measurements but it turns out, those measurements are not accurate. The measurement that is accurate is the mass itself (your body weight and BMI). The water measurement, visceral fat, muscle, protein, etc are all BS. If you want a real assessment of your metrics, go with another scale. These metrics are based on collected data received from people in a similar weight category. SMH.Example: I measured myself Day 1 and it happened to be during the end of my time of month. I weighed in at 181 pounds. BMI 30.5. Visceral fat 13. Body fat 36.1. Muscle mass 109.2.On Day 2: Weight 178.4 pounds. BMI 29.7. Body fat 35.2. Visceral fat 12. Muscle mass 108.6.On Day 3: weight 177.0 pounds. BMI 29.5. Body fat 34.9%. Visceral fat 12. Muscle mass 108.3.Skip to day 11: weight 176.5 pounds. BMI 29.4. Body fat 34.7%. Visceral fat 12. Muscle mass 108.4.Today Day 13: weight 179.7 pounds. BMI 29.9. Body fat 35.5%. Visceral fat 12. Muscle mass 109.1.For reference: my body measurements are: day 1: Bust- 38.5” DDWaist: 31”Hips: 46”Reference 2: I put on 20 pounds in the last two years. My normal measurements are Bust 34” DD, waist 26”, hips 42”Reference 3: day 13 body measurements: Bust 40” DD, waist 33”, hips 46” (measurements have gone up because I turn into a bloated lolly pop during PMS time) plus I have more muscle on my abs. Sidenote: your waist will grow slightly thicker when building muscle UNTIL you get off the extra fat and focus on cardio. I shared these measurements so that you can see, hopefully, the correlation between the scale measurements for day 13. My body expanded from water wait and it’s why the scale read a higher mass. The discrepancy lies in the body fat- I did not gain body fat in the last two weeks but the scale is saying otherwise because again, it is an average reading of people in a similar age, gender, and body weight! Look at day 11 and 13. The measurements tell me my body fat increased. This is inaccurate for two reasons: 1) I’ve increased my physical activity while I’ve cut calories and 2) I have gained water weight since it’s coming close to my cycle (NOT FAT).Now, compare my Day 1 measurements to Day 13. I call BS on this scale because my muscle mass did not go down and then suddenly back up to where it was 2 weeks prior. The difference is my diet! I’ve fluctuated between high and low carbs every few days. That’s the only difference and I’m still working out regularly. Secondly, my goal is to lose body fat and I’ve been in the gym focusing on weights to build muscle. My diet has been CLEAN and in a caloric deficit with one cheat meal a week. I eat Plantbased and have also cut sugar out and processed foods almost completely. I don’t eat processed food daily and I’ve been focusing on a large quantity of veggies and fresh fruit with each meal and snack. Also, I know for a fact I’ve gained muscle mass ( beyond what this scale is saying) because my thighs are noticeably thicker and I have more muscle on my upper arms ( triceps, deltoids, traps). Thirdly, notice how the measurements increase with an increase in body mass and how they decrease with a decrease in body mass.So again, I call BS. If you want real measurements, not just something to make you feel good and tingly inside, find another scale. If you’re only going for your body mass, this is a good scale.Just FYI- some of the days I am eating low carbs which will cause the scale to drop drastically. On the days I eat high carbs ( bread, rice), the scale is higher the very next morning. Why? Carbohydrates bond to water molecules which cause an increase in water!If I am wrong, I will come back and update this post. I will still update periodically. Hope this helps.", "people_count": 6, "image_usage": 0, "written_date": "March 13, 2023", "product_index": 3}], [{"title": "Awesome!", "rating": "5.0 out of 5 stars", "customer_id": "Licelys", "body": "Its a lightweight scale, the app its easy to manage and its awesome that calibrates its self.", "people_count": 0, "image_usage": 0, "written_date": "March 29, 2023", "product_index": 3}, {"title": "Muy linda balanza", "rating": "5.0 out of 5 stars", "customer_id": "Mordan", "body": "Muy linda balanza y da una sensacion de pesar adecuadamente. La app no siempre funciona bien", "people_count": 0, "image_usage": 0, "written_date": "March 26, 2023", "product_index": 3}, {"title": "Has to be on hardwood floor not carpet to get accurate reading", "rating": "5.0 out of 5 stars", "customer_id": "Jaime Cantu", "body": "Easy to use the app is user-friendly now my sister is buying one I recommend", "people_count": 0, "image_usage": 0, "written_date": "March 29, 2023", "product_index": 3}, {"title": "Works", "rating": "5.0 out of 5 stars", "customer_id": "Boss", "body": "Keeps on track to the T on my weight loss", "people_count": 0, "image_usage": 0, "written_date": "April 2, 2023", "product_index": 3}, {"title": "Great Scale", "rating": "5.0 out of 5 stars", "customer_id": "Andy Schlenker", "body": "This scale appears to be more accurate and consistent than my old one. The bluetooth connects quickly and it's kind of fun just to look at all the info you get on the app...other than it's telling me I'm older and fatter than I want to be!", "people_count": 1, "image_usage": 0, "written_date": "March 9, 2023", "product_index": 3}, {"title": "Love the app for this scale", "rating": "5.0 out of 5 stars", "customer_id": "Jordan Guerra", "body": "The sale works great but the app is fantastic. It makes it so easy to log food, body measurements, weight, and so much more. It also contains TONS of recipes for healthy eating. This has been super helpful in my fitness journey and I cannot recommend it enough.", "people_count": 1, "image_usage": 0, "written_date": "March 9, 2023", "product_index": 3}, {"title": "Accurate", "rating": "5.0 out of 5 stars", "customer_id": "C. Holierhoek", "body": "Had an MD appt and the scale there measured the same as the one at home. Easy to see display. I have not used the app.", "people_count": 0, "image_usage": 0, "written_date": "March 19, 2023", "product_index": 3}, {"title": "Bought for my son", "rating": "5.0 out of 5 stars", "customer_id": "Kim Camilo", "body": "Bought this for my teenage son and he loves it!! Tracks everything!!", "people_count": 0, "image_usage": 0, "written_date": "March 31, 2023", "product_index": 3}, {"title": "Love this scale", "rating": "5.0 out of 5 stars", "customer_id": "Amazon Customer", "body": "My daughter was the one that ordered it first and she really liked it so, she sent me the link. The scale is better than I expected. 10 out of 10 would recommend! Super easy to use and I love that I can track my weight on my phone.", "people_count": 1, "image_usage": 0, "written_date": "March 1, 2023", "product_index": 3}, {"title": "Nice scale", "rating": "5.0 out of 5 stars", "customer_id": "Serenity Lavalle", "body": "I love the scale, love that the app has many different functions, and that the scale is easy to use.", "people_count": 0, "image_usage": 0, "written_date": "March 26, 2023", "product_index": 3}], [{"title": "Easiest smart scale", "rating": "4.0 out of 5 stars", "customer_id": "Lynz", "body": "This was the easiest set up and so far reading the results and graphing them has been super breezy", "people_count": 0, "image_usage": 0, "written_date": "March 27, 2023", "product_index": 3}, {"title": "Shmancy", "rating": "5.0 out of 5 stars", "customer_id": "Ky", "body": "Super shmancy! Pretty, high tech and came incredibly fast!", "people_count": 0, "image_usage": 0, "written_date": "March 27, 2023", "product_index": 3}, {"title": "Accurate but inconsistent", "rating": "4.0 out of 5 stars", "customer_id": "Nahid Hossain", "body": "The weights shown in the first and second time are mostly incorrect. The results after the 2nd attempt are okay. Also, the results are inconsistent if measured multiple times.", "people_count": 0, "image_usage": 0, "written_date": "March 17, 2023", "product_index": 3}, {"title": "I can't get it to sync with Fitbit?", "rating": "4.0 out of 5 stars", "customer_id": "Amazon Customer", "body": "It's likely just me, but I'm totally frustrated trying for days to get it to sync with my Fitbit.Wish I paid twice as much for a Fitbit scale that synced easy, like my previous Fitbit scale.I'm sure it works with Fitbit, but not automatic or easy?I updated to 4 stars from 1 star.Has started syncing with my Fitbit... But I have no idea why it started working. I'm happy it did.", "people_count": 1, "image_usage": 0, "written_date": "February 18, 2023", "product_index": 3}, {"title": "Great scale", "rating": "5.0 out of 5 stars", "customer_id": "Bren", "body": "Bluetooth scale, connect with the app on my phone as well as to my apple health app. Easy to set up, directions are user friendly, scale is light weight", "people_count": 0, "image_usage": 0, "written_date": "March 12, 2023", "product_index": 3}, {"title": "Scale", "rating": "5.0 out of 5 stars", "customer_id": "Brayant H.", "body": "It's a scale. What sets this one apart is that this one tells you the decimal numbers by single digits, not multiples of 2.", "people_count": 0, "image_usage": 0, "written_date": "March 15, 2023", "product_index": 3}, {"title": "Feel great and look great i hope it last for ever", "rating": "4.0 out of 5 stars", "customer_id": "Valinda", "body": "Make sure you don't have nothing on your feet. And take your socks off", "people_count": 0, "image_usage": 0, "written_date": "March 24, 2023", "product_index": 3}, {"title": "Easy convienent to use", "rating": "4.0 out of 5 stars", "customer_id": "Amazon Customer", "body": "Love the ease, the automatic sync between scale and my phone. It has made weighing in every morning not seem like a hassle and more like part of my morning routine.", "people_count": 0, "image_usage": 0, "written_date": "March 22, 2023", "product_index": 3}, {"title": "Nice scale, most of the time", "rating": "4.0 out of 5 stars", "customer_id": "Heather F", "body": "This scale is great, when it works. It's suppose to show you not only your weight but, your muscle mass, water weight and several other things. Most of the time, it's only showing me my weight and BMI. I constantly have to sync it back to my watch and Bluetooth. When it works, it's great but when it doesn't, it's disappointing.", "people_count": 0, "image_usage": 0, "written_date": "February 24, 2023", "product_index": 3}, {"title": "Lotta fun", "rating": "4.0 out of 5 stars", "customer_id": "sean", "body": "My holiday figure isn't what I want in the new year, so I've purchased this scale to keep track of my weight and body fat. There is a downloadable program that reads many data points relating to weight and body fat. I did some research to see if all this information was actually producable with this scale and found that it is! The price was very affordable. The unit is quite attractive. The data provide to the phone app is plotted and can be followed easily as you work towards you goals. If all you want is your weight, its as easy as any floor scale. If you want more and you have a smart phone, it can be quite informative.", "people_count": 7, "image_usage": 0, "written_date": "January 23, 2023", "product_index": 3}], [{"title": "DURABLE AF", "rating": "5.0 out of 5 stars", "customer_id": "Destiny Coker", "body": "I saw so many reviews saying this breaks easily, but I have had this for months and I have bumped and dropped and hit this thing so many times and it has survived everything I threw at it. And the app works great. And it is accurate.", "people_count": 2, "image_usage": 0, "written_date": "March 1, 2023", "product_index": 3}, {"title": "Smart", "rating": "5.0 out of 5 stars", "customer_id": "Madalina Chiticaru", "body": "I love it", "people_count": 0, "image_usage": 0, "written_date": "March 25, 2023", "product_index": 3}, {"title": "Weigh in", "rating": "5.0 out of 5 stars", "customer_id": "M Aubee", "body": "Replaced an old scale and found out it was off. App tracks my weight loss. Easy enough!", "people_count": 0, "image_usage": 0, "written_date": "March 24, 2023", "product_index": 3}, {"title": "Great Scale", "rating": "5.0 out of 5 stars", "customer_id": "JT", "body": "Nice looking, precisely accurate weight, app is easy to use if you choose to use it. Nice looking and easy to use. Happy with this purchase and more than worth the price.", "people_count": 0, "image_usage": 0, "written_date": "March 8, 2023", "product_index": 3}, {"title": "Works but short battery life", "rating": "4.0 out of 5 stars", "customer_id": "MolS", "body": "It’s a fine scale, works like it says. Knocked a star down cause it drained the battery in a very short/quick time frame. Way quicker than it should have", "people_count": 0, "image_usage": 0, "written_date": "March 12, 2023", "product_index": 3}, {"title": "good scales but....", "rating": "4.0 out of 5 stars", "customer_id": "Mary Nelson", "body": "It connected to my phone the first time I stepped on them and hasn't done right since.will recorded my weight but the rest of the stuff won't record.", "people_count": 0, "image_usage": 0, "written_date": "March 19, 2023", "product_index": 3}, {"title": "The scale", "rating": "5.0 out of 5 stars", "customer_id": "m. Ann", "body": "I like the app link and overall information you garner from the scale.", "people_count": 0, "image_usage": 0, "written_date": "March 26, 2023", "product_index": 3}, {"title": "Justo lo q nececitaba", "rating": "5.0 out of 5 stars", "customer_id": "Lia", "body": "Me gusta q se queda guardado la ultima vez q me pese en el app, aun no lo haya abierto! Muy acertado el peso!", "people_count": 0, "image_usage": 0, "written_date": "March 14, 2023", "product_index": 3}, {"title": "Worked as advertised.", "rating": "5.0 out of 5 stars", "customer_id": "Garry T. James", "body": "Very Accurate. Repeats readings.", "people_count": 0, "image_usage": 0, "written_date": "March 28, 2023", "product_index": 3}, {"title": "Great product", "rating": "5.0 out of 5 stars", "customer_id": "Shonda", "body": "Easy to set up", "people_count": 0, "image_usage": 0, "written_date": "March 24, 2023", "product_index": 3}]]